[NoCoverage] String mutation
Core/Serialization/AnyPrimitiveComponent.cs:44:43
             if (step is CompoundFreezableStep compound && compound.StepConfiguration == null)
                 return compound.StepFactory.Serializer.TrySerialize(compound.FreezableStepData);
 
-            return Result.Failure<string>("Cannot serialize compound with a step configuration");
+            return Result.Failure<string>("");
         }
 
