[NoCoverage] String mutation
Core/Serialization/BooleanComponent.cs:39:43
             if (step is CompoundFreezableStep compound && compound.StepConfiguration == null)
                 return compound.StepFactory.Serializer.TrySerialize(compound.FreezableStepData);
 
-            return Result.Failure<string>("Cannot serialize compound as a primitive");
+            return Result.Failure<string>("");
         }
 
