[NoCoverage] String mutation
Core/Serialization/EnumDisplayComponent.cs:33:49
                 .TryFindOrFail(PropertyName, null)
                 .Bind(x => x.Join(VariableNameComponent.Serialize,
                     TrySerialize,
-                    _ => Result.Failure<string>("Cannot serialize list")));
+                    _ => Result.Failure<string>("")));
 
         private static Result<string> TrySerialize(IFreezableStep step)
