[NoCoverage] String mutation
Core/Serialization/FunctionSerializer.cs:71:49
                     ConstantFreezableStep constant => SerializationMethods.SerializeConstant(constant, true),
                     CompoundFreezableStep compoundFreezableProcess => compoundFreezableProcess.StepFactory
                         .Serializer.TrySerialize(compoundFreezableProcess.FreezableStepData),
-                    _ => Result.Failure<string>("Cannot serialize")
+                    _ => Result.Failure<string>("")
                 };
             }
