[NoCoverage] String mutation
CSVReader.cs:18:50
             string filePath, string delimiter, string? commentToken, bool enclosedInQuotes)
         {
             if(filePath == null)
-                return Result.Failure<DataTable>("File path is null.");
+                return Result.Failure<DataTable>("");
             if (!File.Exists(filePath))
                 return Result.Failure<DataTable>($"'{filePath}' does not exist.");

[NoCoverage] String mutation
CSVReader.cs:20:50
             if(filePath == null)
                 return Result.Failure<DataTable>("File path is null.");
             if (!File.Exists(filePath))
-                return Result.Failure<DataTable>($"'{filePath}' does not exist.");
+                return Result.Failure<DataTable>($"");
 
             using var csvParser = new TextFieldParser(filePath);
