[NoCoverage] String mutation
Requirement.cs:65:45
                         nameof(MaxVersion) => TryConvertToVersion(value).Tap(x => requirement.MaxVersion = x),
                         nameof(Name) => value.TryConvert<string>().Tap(x => requirement.Name = x),
                         nameof(Notes) => value.TryConvert<string>().Tap(x => requirement.Notes = x),
-                        _ => Result.Failure($"Could not recognize property '{key}'.")
+                        _ => Result.Failure($"")
                     };
 

[NoCoverage] String mutation
Requirement.cs:79:48
             }
 
 
-            return Result.Failure<Requirement>($"Could not convert '{o}' to {nameof(Requirement)}");
+            return Result.Failure<Requirement>($"");
         }
 
