[NoCoverage] String mutation
Core/Internal/MultipleTypeReference.cs:32:29
                 {
                     if (set.OfType<ActualTypeReference>().Count() > 1)
                         return Result.Failure<ITypeReference>(
-                            $"Could not infer type for {parentStep} as it's children have different types ({string.Join(", ", set.OfType<ActualTypeReference>().Select(x=>x.Type.Name))}).");
+                            $"");
                     return new MultipleTypeReference(set);
                 }
