[NoCoverage] String mutation
Core/Internal/StepContext.cs:117:29
                         0 => Result.Failure<KeyValuePair<VariableName, Type>>($"The type '{key}' is never set."),
                         1 => new KeyValuePair<VariableName, Type>(key, actualTypes.Single().Type),
                         _ => Result.Failure<KeyValuePair<VariableName, Type>>(
-                            $"The type '{key}' is set to more than one type - ({string.Join(", ", actualTypes.Select(x => x.Type.Name))})")
+                            $"")
                     };
                 }
