[NoCoverage] String mutation
Core/Serialization/StepMemberParser.cs:366:51
             if (stepFactoryStore.EnumTypesDictionary.TryGetValue(enumName, out var type))
                 if (Enum.TryParse(type, value, true, out var enumValue))
                     return new ConstantFreezableStep(enumValue!);
-            return Result.Failure<IFreezableStep>("Could not parse enum");
+            return Result.Failure<IFreezableStep>("");
         }
 
