[NoCoverage] String mutation
Core/Util/FunctionalExtensions.cs:32:38
             if (obj is T type)
                 return type;
 
-            return Result.Failure<T>($"Could not cast '{obj}' to {typeof(T).Name}");
+            return Result.Failure<T>($"");
         }
 
