[NoCoverage] Negate expression
Configuration.cs:44:17
         /// </summary>
         public static Configuration? Combine(Configuration? parent, Configuration? child)
         {
-            if (parent == null)
+            if (!(parent == null))
                 return child;
             if (child == null)

[NoCoverage] Equality mutation
Configuration.cs:44:17
         /// </summary>
         public static Configuration? Combine(Configuration? parent, Configuration? child)
         {
-            if (parent == null)
+            if (parent != null)
                 return child;
             if (child == null)

[NoCoverage] Equality mutation
Configuration.cs:46:17
         {
             if (parent == null)
                 return child;
-            if (child == null)
+            if (child != null)
                 return parent;
 

[NoCoverage] Negate expression
Configuration.cs:46:17
         {
             if (parent == null)
                 return child;
-            if (child == null)
+            if (!(child == null))
                 return parent;
 

[NoCoverage] Boolean mutation
Configuration.cs:51:111
 
             return new Configuration
             {
-                AdditionalRequirements = Combine(parent.AdditionalRequirements, child.AdditionalRequirements, true),
+                AdditionalRequirements = Combine(parent.AdditionalRequirements, child.AdditionalRequirements, false),
                 TargetMachineTags = Combine(parent.TargetMachineTags, child.TargetMachineTags, true),
                 DoNotSplit = parent.DoNotSplit || child.DoNotSplit,

[NoCoverage] Boolean mutation
Configuration.cs:52:96
             return new Configuration
             {
                 AdditionalRequirements = Combine(parent.AdditionalRequirements, child.AdditionalRequirements, true),
-                TargetMachineTags = Combine(parent.TargetMachineTags, child.TargetMachineTags, true),
+                TargetMachineTags = Combine(parent.TargetMachineTags, child.TargetMachineTags, false),
                 DoNotSplit = parent.DoNotSplit || child.DoNotSplit,
                 Priority = child.Priority?? parent.Priority

[NoCoverage] Logical mutation
Configuration.cs:53:30
             {
                 AdditionalRequirements = Combine(parent.AdditionalRequirements, child.AdditionalRequirements, true),
                 TargetMachineTags = Combine(parent.TargetMachineTags, child.TargetMachineTags, true),
-                DoNotSplit = parent.DoNotSplit || child.DoNotSplit,
+                DoNotSplit = parent.DoNotSplit && child.DoNotSplit,
                 Priority = child.Priority?? parent.Priority
             };

[NoCoverage] Equality mutation
Configuration.cs:73:66
                 var results = new List<Result>();
 
 
-                foreach (var (key, value) in dictionary.Where(x=>x.Value != null))
+                foreach (var (key, value) in dictionary.Where(x=>x.Value == null))
                 {
                     var result = key switch

[NoCoverage] Equality mutation
Configuration.cs:103:17
 
         private static List<T>? Combine<T>(List<T>? l1, List<T>? l2, bool distinct)
         {
-            if (l1 == null) return l2;
+            if (l1 != null) return l2;
             if (l2 == null) return l1;
 

[NoCoverage] Negate expression
Configuration.cs:103:17
 
         private static List<T>? Combine<T>(List<T>? l1, List<T>? l2, bool distinct)
         {
-            if (l1 == null) return l2;
+            if (!(l1 == null)) return l2;
             if (l2 == null) return l1;
 

[NoCoverage] Equality mutation
Configuration.cs:104:17
         private static List<T>? Combine<T>(List<T>? l1, List<T>? l2, bool distinct)
         {
             if (l1 == null) return l2;
-            if (l2 == null) return l1;
+            if (l2 != null) return l1;
 
             return distinct ? l1.Concat(l2).Distinct().ToList() : l1.Concat(l2).ToList();

[NoCoverage] Negate expression
Configuration.cs:104:17
         private static List<T>? Combine<T>(List<T>? l1, List<T>? l2, bool distinct)
         {
             if (l1 == null) return l2;
-            if (l2 == null) return l1;
+            if (!(l2 == null)) return l1;
 
             return distinct ? l1.Concat(l2).Distinct().ToList() : l1.Concat(l2).ToList();

[NoCoverage] Negate expression
Configuration.cs:106:20
             if (l1 == null) return l2;
             if (l2 == null) return l1;
 
-            return distinct ? l1.Concat(l2).Distinct().ToList() : l1.Concat(l2).ToList();
+            return !(distinct ) ? l1.Concat(l2).Distinct().ToList() : l1.Concat(l2).ToList();
         }
     }
