[NoCoverage] Equality mutation
CSVReader.cs:17:16
         public static Result<DataTable> TryReadCSVFromFile(
             string filePath, string delimiter, string? commentToken, bool enclosedInQuotes)
         {
-            if(filePath == null)
+            if(filePath != null)
                 return Result.Failure<DataTable>("File path is null.");
             if (!File.Exists(filePath))

[NoCoverage] Negate expression
CSVReader.cs:17:16
         public static Result<DataTable> TryReadCSVFromFile(
             string filePath, string delimiter, string? commentToken, bool enclosedInQuotes)
         {
-            if(filePath == null)
+            if(!(filePath == null))
                 return Result.Failure<DataTable>("File path is null.");
             if (!File.Exists(filePath))

[NoCoverage] Negate expression
CSVReader.cs:19:17
         {
             if(filePath == null)
                 return Result.Failure<DataTable>("File path is null.");
-            if (!File.Exists(filePath))
+            if (!(!File.Exists(filePath)))
                 return Result.Failure<DataTable>($"'{filePath}' does not exist.");
 

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
CSVReader.cs:19:17
         {
             if(filePath == null)
                 return Result.Failure<DataTable>("File path is null.");
-            if (!File.Exists(filePath))
+            if (File.Exists(filePath))
                 return Result.Failure<DataTable>($"'{filePath}' does not exist.");
 

[NoCoverage] Negate expression
CSVReader.cs:38:16
         public static Result<DataTable> TryReadCSVFromString(
             string csvString, string delimiter, string? commentToken, bool enclosedInQuotes)
         {
-            if(csvString == null)
+            if(!(csvString == null))
                 return Result.Failure<DataTable>("CSV string is null.");
 

[NoCoverage] Equality mutation
CSVReader.cs:38:16
         public static Result<DataTable> TryReadCSVFromString(
             string csvString, string delimiter, string? commentToken, bool enclosedInQuotes)
         {
-            if(csvString == null)
+            if(csvString != null)
                 return Result.Failure<DataTable>("CSV string is null.");
 

[NoCoverage] Equality mutation
CSVReader.cs:54:16
         {
             var errorsSoFar = new List<string>();
 
-            if(commentToken != null)
+            if(commentToken == null)
                 csvParser.CommentTokens = new[] {commentToken};
 

[NoCoverage] Negate expression
CSVReader.cs:54:16
         {
             var errorsSoFar = new List<string>();
 
-            if(commentToken != null)
+            if(!(commentToken != null))
                 csvParser.CommentTokens = new[] {commentToken};
 

[NoCoverage] Negate expression
CSVReader.cs:74:20
             }
 
             var rowNumber = 1;
-            while (!csvParser.EndOfData)
+            while (!(!csvParser.EndOfData))
             {
                 // Read current line fields, pointer moves to the next line.

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
CSVReader.cs:74:20
             }
 
             var rowNumber = 1;
-            while (!csvParser.EndOfData)
+            while (csvParser.EndOfData)
             {
                 // Read current line fields, pointer moves to the next line.

[NoCoverage] Equality mutation
CSVReader.cs:81:25
                 {
                     var fields = csvParser.ReadFields();
 
-                    if (fields.Length != dataTable.Columns.Count)
+                    if (fields.Length == dataTable.Columns.Count)
                         errorsSoFar.Add($"There were {fields.Length} columns in row {rowNumber} but we expected {dataTable.Columns.Count}.");
                     else

[NoCoverage] Negate expression
CSVReader.cs:81:25
                 {
                     var fields = csvParser.ReadFields();
 
-                    if (fields.Length != dataTable.Columns.Count)
+                    if (!(fields.Length != dataTable.Columns.Count))
                         errorsSoFar.Add($"There were {fields.Length} columns in row {rowNumber} but we expected {dataTable.Columns.Count}.");
                     else

[NoCoverage] PostIncrementExpression to PostDecrementExpression mutation
CSVReader.cs:92:17
                     errorsSoFar.Add(e.Message);
                 }
 
-                rowNumber++;
+                
+                rowNumber--;
             }
 

[NoCoverage] Negate expression
CSVReader.cs:95:17
                 rowNumber++;
             }
 
-            if (errorsSoFar.Any())
+            if (!(errorsSoFar.Any()))
                 return Result.Failure<DataTable>(string.Join("\r\n", errorsSoFar));
 
