[NoCoverage] String mutation
EmptySettings.cs:22:26
 
         /// <inheritdoc />
         public Result<Unit, IRunErrors> CheckRequirement(string processName, Requirement requirement) =>
-            new RunError($"Requirement '{requirement}' not met.", processName, null,
+            new RunError($"", processName, null,
                 ErrorCode.RequirementsNotMet);
     }
