[NoCoverage] Negate expression
ExternalProcessRunner.cs:35:17
         /// <inheritdoc />
         public async Task<Result<Unit, IRunErrors>> RunExternalProcess(string processPath, ILogger logger, string callingProcessName, IErrorHandler errorHandler, IEnumerable<string> arguments)
         {
-            if (!File.Exists(processPath))
+            if (!(!File.Exists(processPath)))
                 return new RunError($"Could not find '{processPath}'", callingProcessName, null, ErrorCode.ExternalProcessNotFound);
 

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
ExternalProcessRunner.cs:35:17
         /// <inheritdoc />
         public async Task<Result<Unit, IRunErrors>> RunExternalProcess(string processPath, ILogger logger, string callingProcessName, IErrorHandler errorHandler, IEnumerable<string> arguments)
         {
-            if (!File.Exists(processPath))
+            if (File.Exists(processPath))
                 return new RunError($"Could not find '{processPath}'", callingProcessName, null, ErrorCode.ExternalProcessNotFound);
 

[NoCoverage] Boolean mutation
ExternalProcessRunner.cs:45:39
                 {
                     FileName = processPath,
                     Arguments = argumentString,
-                    UseShellExecute = false,
+                    UseShellExecute = true,
                     RedirectStandardOutput = true,
                     RedirectStandardError = true,

[NoCoverage] Boolean mutation
ExternalProcessRunner.cs:46:46
                     FileName = processPath,
                     Arguments = argumentString,
                     UseShellExecute = false,
-                    RedirectStandardOutput = true,
+                    RedirectStandardOutput = false,
                     RedirectStandardError = true,
                     WindowStyle = System.Diagnostics.ProcessWindowStyle.Hidden, //don't display a window

[NoCoverage] Boolean mutation
ExternalProcessRunner.cs:47:45
                     Arguments = argumentString,
                     UseShellExecute = false,
                     RedirectStandardOutput = true,
-                    RedirectStandardError = true,
+                    RedirectStandardError = false,
                     WindowStyle = System.Diagnostics.ProcessWindowStyle.Hidden, //don't display a window
                     CreateNoWindow = true,

[NoCoverage] Boolean mutation
ExternalProcessRunner.cs:49:38
                     RedirectStandardOutput = true,
                     RedirectStandardError = true,
                     WindowStyle = System.Diagnostics.ProcessWindowStyle.Hidden, //don't display a window
-                    CreateNoWindow = true,
+                    CreateNoWindow = false,
                     StandardErrorEncoding = System.Text.Encoding.UTF8,
                     StandardOutputEncoding = System.Text.Encoding.UTF8

[NoCoverage] Boolean mutation
ExternalProcessRunner.cs:65:20
             var errors = new List<RunError>();
 
             //Read the output one line at a time
-            while (true)
+            while (false)
             {
                 var line = await multiStreamReader.ReadLineAsync();

[NoCoverage] Negate expression
ExternalProcessRunner.cs:65:20
             var errors = new List<RunError>();
 
             //Read the output one line at a time
-            while (true)
+            while (!(true))
             {
                 var line = await multiStreamReader.ReadLineAsync();

[NoCoverage] Negate expression
ExternalProcessRunner.cs:68:21
             while (true)
             {
                 var line = await multiStreamReader.ReadLineAsync();
-                if (line == null) //We've reached the end of the file
+                if (!(line == null)) //We've reached the end of the file
                     break;
                 if (line.Value.source == Source.Error)

[NoCoverage] Equality mutation
ExternalProcessRunner.cs:68:21
             while (true)
             {
                 var line = await multiStreamReader.ReadLineAsync();
-                if (line == null) //We've reached the end of the file
+                if (line != null) //We've reached the end of the file
                     break;
                 if (line.Value.source == Source.Error)

[NoCoverage] Negate expression
ExternalProcessRunner.cs:70:21
                 var line = await multiStreamReader.ReadLineAsync();
                 if (line == null) //We've reached the end of the file
                     break;
-                if (line.Value.source == Source.Error)
+                if (!(line.Value.source == Source.Error))
                 {
                     var errorText = string.IsNullOrWhiteSpace(line.Value.line) ? "Unknown Error" : line.Value.line;

[NoCoverage] Equality mutation
ExternalProcessRunner.cs:70:21
                 var line = await multiStreamReader.ReadLineAsync();
                 if (line == null) //We've reached the end of the file
                     break;
-                if (line.Value.source == Source.Error)
+                if (line.Value.source != Source.Error)
                 {
                     var errorText = string.IsNullOrWhiteSpace(line.Value.line) ? "Unknown Error" : line.Value.line;

[NoCoverage] Negate expression
ExternalProcessRunner.cs:72:37
                     break;
                 if (line.Value.source == Source.Error)
                 {
-                    var errorText = string.IsNullOrWhiteSpace(line.Value.line) ? "Unknown Error" : line.Value.line;
+                    var errorText = !(string.IsNullOrWhiteSpace(line.Value.line) ) ? "Unknown Error" : line.Value.line;
 
                     if (errorHandler.ShouldIgnoreError(errorText))

[NoCoverage] String mutation
ExternalProcessRunner.cs:72:82
                     break;
                 if (line.Value.source == Source.Error)
                 {
-                    var errorText = string.IsNullOrWhiteSpace(line.Value.line) ? "Unknown Error" : line.Value.line;
+                    var errorText = string.IsNullOrWhiteSpace(line.Value.line) ? "" : line.Value.line;
 
                     if (errorHandler.ShouldIgnoreError(errorText))

[NoCoverage] Negate expression
ExternalProcessRunner.cs:74:25
                 {
                     var errorText = string.IsNullOrWhiteSpace(line.Value.line) ? "Unknown Error" : line.Value.line;
 
-                    if (errorHandler.ShouldIgnoreError(errorText))
+                    if (!(errorHandler.ShouldIgnoreError(errorText)))
                         logger.LogWarning(line.Value.line);
                     else

[NoCoverage] Negate expression
ExternalProcessRunner.cs:86:17
 
             pProcess.WaitForExit();
 
-            if (errors.Any())
+            if (!(errors.Any()))
             {
                 var e = RunErrorList.Combine(errors);

[Survived] String mutation
ExternalProcessRunner.cs:95:77
             return Unit.Default;
         }
 
-        private static readonly Regex BackslashRegex = new Regex(@"(\\*)" + "\"", RegexOptions.Compiled);
+        private static readonly Regex BackslashRegex = new Regex(@"(\\*)" + "", RegexOptions.Compiled);
         private static readonly Regex TermWithSpaceRegex = new Regex(@"^(.*\s.*?)(\\*)$", RegexOptions.Compiled | RegexOptions.Singleline);
 

[Survived] Bitwise mutation
ExternalProcessRunner.cs:96:91
         }
 
         private static readonly Regex BackslashRegex = new Regex(@"(\\*)" + "\"", RegexOptions.Compiled);
-        private static readonly Regex TermWithSpaceRegex = new Regex(@"^(.*\s.*?)(\\*)$", RegexOptions.Compiled | RegexOptions.Singleline);
+        private static readonly Regex TermWithSpaceRegex = new Regex(@"^(.*\s.*?)(\\*)$", RegexOptions.Compiled & RegexOptions.Singleline);
 
         private static string EncodeParameterArgument(string original)

[Survived] Regex quantifier removal mutation
ExternalProcessRunner.cs:96:70
         }
 
         private static readonly Regex BackslashRegex = new Regex(@"(\\*)" + "\"", RegexOptions.Compiled);
-        private static readonly Regex TermWithSpaceRegex = new Regex(@"^(.*\s.*?)(\\*)$", RegexOptions.Compiled | RegexOptions.Singleline);
+        private static readonly Regex TermWithSpaceRegex = new Regex("^(.*\\s.*?)(\\\\)$", RegexOptions.Compiled | RegexOptions.Singleline);
 
         private static string EncodeParameterArgument(string original)

[NoCoverage] Negate expression
ExternalProcessRunner.cs:100:17
 
         private static string EncodeParameterArgument(string original)
         {
-            if (string.IsNullOrEmpty(original))
+            if (!(string.IsNullOrEmpty(original)))
                 return $"\"{original}\"";
             var value = BackslashRegex.Replace(original, @"$1\$0");
