[NoCoverage] Boolean mutation
IgnoreAllErrorHandler.cs:16:52
         public static IErrorHandler Instance = new IgnoreAllErrorHandler();
 
         /// <inheritdoc />
-        public bool ShouldIgnoreError(string s) => true;
+        public bool ShouldIgnoreError(string s) => false;
     }
 }
