[NoCoverage] Boolean mutation
IgnoreNoneErrorHandler.cs:16:52
         public static IErrorHandler Instance = new IgnoreNoneErrorHandler();
 
         /// <inheritdoc />
-        public bool ShouldIgnoreError(string s) => false;
+        public bool ShouldIgnoreError(string s) => true;
     }
 }
