[NoCoverage] UnaryMinusExpression to UnaryPlusExpression mutation
Requirement.cs:88:29
 
             if (o is IReadOnlyDictionary<object, object> dictionary)
             {
-                var major = -1;
+                var major = +1;
                 var minor = -1;
                 var build = -1;

[NoCoverage] UnaryMinusExpression to UnaryPlusExpression mutation
Requirement.cs:89:29
             if (o is IReadOnlyDictionary<object, object> dictionary)
             {
                 var major = -1;
-                var minor = -1;
+                var minor = +1;
                 var build = -1;
                 var revision = -1;

[NoCoverage] UnaryMinusExpression to UnaryPlusExpression mutation
Requirement.cs:90:29
             {
                 var major = -1;
                 var minor = -1;
-                var build = -1;
+                var build = +1;
                 var revision = -1;
 

[NoCoverage] UnaryMinusExpression to UnaryPlusExpression mutation
Requirement.cs:91:32
                 var major = -1;
                 var minor = -1;
                 var build = -1;
-                var revision = -1;
+                var revision = +1;
 
                 var results = new List<Result>();

[NoCoverage] Equality mutation
Requirement.cs:117:42
                     {
                         Version version;
 
-                        if (major < 0 || minor < 0)
+                        if (major < 0 || minor > 0)
                             return Result.Failure<Version>("Major and Minor versions must both be greater than zero");
                         if (build < 0) version = new Version(major, minor);

[NoCoverage] Logical mutation
Requirement.cs:117:29
                     {
                         Version version;
 
-                        if (major < 0 || minor < 0)
+                        if (major < 0 && minor < 0)
                             return Result.Failure<Version>("Major and Minor versions must both be greater than zero");
                         if (build < 0) version = new Version(major, minor);

[NoCoverage] Negate expression
Requirement.cs:119:29
 
                         if (major < 0 || minor < 0)
                             return Result.Failure<Version>("Major and Minor versions must both be greater than zero");
-                        if (build < 0) version = new Version(major, minor);
+                        if (!(build < 0)) version = new Version(major, minor);
                         else if (revision < 0) version = new Version(major, minor, build);
                         else version = new Version(major, minor, build, revision);

[NoCoverage] Equality mutation
Requirement.cs:119:29
 
                         if (major < 0 || minor < 0)
                             return Result.Failure<Version>("Major and Minor versions must both be greater than zero");
-                        if (build < 0) version = new Version(major, minor);
+                        if (build <= 0) version = new Version(major, minor);
                         else if (revision < 0) version = new Version(major, minor, build);
                         else version = new Version(major, minor, build, revision);

[NoCoverage] Equality mutation
Requirement.cs:120:34
                         if (major < 0 || minor < 0)
                             return Result.Failure<Version>("Major and Minor versions must both be greater than zero");
                         if (build < 0) version = new Version(major, minor);
-                        else if (revision < 0) version = new Version(major, minor, build);
+                        else if (revision <= 0) version = new Version(major, minor, build);
                         else version = new Version(major, minor, build, revision);
 

[NoCoverage] Equality mutation
Requirement.cs:120:34
                         if (major < 0 || minor < 0)
                             return Result.Failure<Version>("Major and Minor versions must both be greater than zero");
                         if (build < 0) version = new Version(major, minor);
-                        else if (revision < 0) version = new Version(major, minor, build);
+                        else if (revision > 0) version = new Version(major, minor, build);
                         else version = new Version(major, minor, build, revision);
 

[NoCoverage] Negate expression
Requirement.cs:140:17
             var sb = new StringBuilder();
 
             sb.Append(Name);
-            if (MinVersion != null)
+            if (!(MinVersion != null))
                 sb.Append($" Version {MinVersion}");
             if (MaxVersion != null)

[NoCoverage] Equality mutation
Requirement.cs:140:17
             var sb = new StringBuilder();
 
             sb.Append(Name);
-            if (MinVersion != null)
+            if (MinVersion == null)
                 sb.Append($" Version {MinVersion}");
             if (MaxVersion != null)

[NoCoverage] String mutation
Requirement.cs:141:27
 
             sb.Append(Name);
             if (MinVersion != null)
-                sb.Append($" Version {MinVersion}");
+                sb.Append($"");
             if (MaxVersion != null)
                 sb.Append($" Version <= {MaxVersion}");

[NoCoverage] Equality mutation
Requirement.cs:142:17
             sb.Append(Name);
             if (MinVersion != null)
                 sb.Append($" Version {MinVersion}");
-            if (MaxVersion != null)
+            if (MaxVersion == null)
                 sb.Append($" Version <= {MaxVersion}");
 

[NoCoverage] Negate expression
Requirement.cs:142:17
             sb.Append(Name);
             if (MinVersion != null)
                 sb.Append($" Version {MinVersion}");
-            if (MaxVersion != null)
+            if (!(MaxVersion != null))
                 sb.Append($" Version <= {MaxVersion}");
 

[NoCoverage] Negate expression
Requirement.cs:145:17
             if (MaxVersion != null)
                 sb.Append($" Version <= {MaxVersion}");
 
-            if (Notes != null)
+            if (!(Notes != null))
                 sb.Append($" ({Notes})");
 

[NoCoverage] Equality mutation
Requirement.cs:145:17
             if (MaxVersion != null)
                 sb.Append($" Version <= {MaxVersion}");
 
-            if (Notes != null)
+            if (Notes == null)
                 sb.Append($" ({Notes})");
 

[NoCoverage] String mutation
Requirement.cs:146:27
                 sb.Append($" Version <= {MaxVersion}");
 
             if (Notes != null)
-                sb.Append($" ({Notes})");
+                sb.Append($"");
 
             return sb.ToString();
