[Killed] Negate expression
StateMonad.cs:53:17
         /// </summary>
         public Result<T,IRunErrors> GetVariable<T>(VariableName key, string stepName)
         {
-            if (_stateDictionary.TryGetValue(key, out var value))
+            if (!(_stateDictionary.TryGetValue(key, out var value)))
             {
                 if (value is T typedValue)
