[NoCoverage] String mutation
Core/Attributes/RequiredVersionAttribute.cs:35:31
         /// <summary>
         /// The required version in human readable form.
         /// </summary>
-        public string Text => $"{SoftwareName} {RequiredVersion}";
+        public string Text => $"";
 
         /// <inheritdoc />
