[Killed] Negate expression
Core/General/AppendString.cs:33:17
         public override Result<Unit, IRunErrors> Run(StateMonad stateMonad)
         {
             var currentValue = stateMonad.GetVariable<string>(Variable, Name);
-            if (currentValue.IsFailure)
+            if (!(currentValue.IsFailure))
                 return currentValue.ConvertFailure<Unit>();
 

[Killed] Negate expression
Core/General/AppendString.cs:38:17
 
 
             var str = String.Run(stateMonad);
-            if (str.IsFailure)
+            if (!(str.IsFailure))
                 return str.ConvertFailure<Unit>();
 

[Killed] Negate expression
Core/General/AppendString.cs:44:17
             var value = currentValue.Value + str.Value;
 
             var r = stateMonad.SetVariable(Variable, value);
-            if (r.IsFailure)
+            if (!(r.IsFailure))
                 return r.ConvertFailure<Unit>();
 
