[Killed] Negate expression
Core/General/ApplyBooleanOperator.cs:42:17
         public override Result<bool, IRunErrors> Run(StateMonad stateMonad)
         {
             var l = Left.Run(stateMonad);
-            if (l.IsFailure) return l;
+            if (!(l.IsFailure)) return l;
             var op = Operator.Run(stateMonad);
             if (op.IsFailure) return op.ConvertFailure<bool>();

[Killed] Negate expression
Core/General/ApplyBooleanOperator.cs:44:17
             var l = Left.Run(stateMonad);
             if (l.IsFailure) return l;
             var op = Operator.Run(stateMonad);
-            if (op.IsFailure) return op.ConvertFailure<bool>();
+            if (!(op.IsFailure)) return op.ConvertFailure<bool>();
 
             switch (op.Value)

[Killed] Negate expression
Core/General/ApplyBooleanOperator.cs:50:25
             {
                 case BooleanOperator.And:
                 {
-                    if (l.Value == false)
+                    if (!(l.Value == false))
                         return false;
 

[Killed] Boolean mutation
Core/General/ApplyBooleanOperator.cs:50:36
             {
                 case BooleanOperator.And:
                 {
-                    if (l.Value == false)
+                    if (l.Value == true)
                         return false;
 

[Killed] Boolean mutation
Core/General/ApplyBooleanOperator.cs:51:32
                 case BooleanOperator.And:
                 {
                     if (l.Value == false)
-                        return false;
+                        return true;
 
                     var r = Right.Run(stateMonad);

[NoCoverage] Negate expression
Core/General/ApplyBooleanOperator.cs:58:25
                 }
                 case BooleanOperator.Or:
                 {
-                    if (l.Value)
+                    if (!(l.Value))
                         return true;
 

[NoCoverage] Boolean mutation
Core/General/ApplyBooleanOperator.cs:59:32
                 case BooleanOperator.Or:
                 {
                     if (l.Value)
-                        return true;
+                        return false;
 
                     var r = Right.Run(stateMonad);
