[Killed] Negate expression
Core/General/ApplyMathOperator.cs:18:17
         public override Result<int, IRunErrors> Run(StateMonad stateMonad)
         {
             var left = Left.Run(stateMonad);
-            if (left.IsFailure) return left;
+            if (!(left.IsFailure)) return left;
 
             var right = Right.Run(stateMonad);

[Killed] Negate expression
Core/General/ApplyMathOperator.cs:21:17
             if (left.IsFailure) return left;
 
             var right = Right.Run(stateMonad);
-            if (right.IsFailure) return right;
+            if (!(right.IsFailure)) return right;
 
             var @operator = Operator.Run(stateMonad);

[Killed] Negate expression
Core/General/ApplyMathOperator.cs:24:17
             if (right.IsFailure) return right;
 
             var @operator = Operator.Run(stateMonad);
-            if (@operator.IsFailure) return @operator.ConvertFailure<int>();
+            if (!(@operator.IsFailure)) return @operator.ConvertFailure<int>();
 
             var result = @operator.Value switch

[Killed] Arithmetic mutation
Core/General/ApplyMathOperator.cs:28:37
 
             var result = @operator.Value switch
             {
-                MathOperator.Add => left.Value + right.Value,
+                MathOperator.Add => left.Value - right.Value,
                 MathOperator.Subtract => left.Value - right.Value,
                 MathOperator.Multiply => left.Value * right.Value,

[NoCoverage] Arithmetic mutation
Core/General/ApplyMathOperator.cs:29:42
             var result = @operator.Value switch
             {
                 MathOperator.Add => left.Value + right.Value,
-                MathOperator.Subtract => left.Value - right.Value,
+                MathOperator.Subtract => left.Value + right.Value,
                 MathOperator.Multiply => left.Value * right.Value,
                 MathOperator.Divide => left.Value / right.Value,

[Killed] Arithmetic mutation
Core/General/ApplyMathOperator.cs:30:42
             {
                 MathOperator.Add => left.Value + right.Value,
                 MathOperator.Subtract => left.Value - right.Value,
-                MathOperator.Multiply => left.Value * right.Value,
+                MathOperator.Multiply => left.Value / right.Value,
                 MathOperator.Divide => left.Value / right.Value,
                 MathOperator.Modulo => left.Value % right.Value,

[NoCoverage] Arithmetic mutation
Core/General/ApplyMathOperator.cs:31:40
                 MathOperator.Add => left.Value + right.Value,
                 MathOperator.Subtract => left.Value - right.Value,
                 MathOperator.Multiply => left.Value * right.Value,
-                MathOperator.Divide => left.Value / right.Value,
+                MathOperator.Divide => left.Value * right.Value,
                 MathOperator.Modulo => left.Value % right.Value,
                 MathOperator.Power => Convert.ToInt32(Math.Pow(left.Value, right.Value)),

[NoCoverage] Arithmetic mutation
Core/General/ApplyMathOperator.cs:32:40
                 MathOperator.Subtract => left.Value - right.Value,
                 MathOperator.Multiply => left.Value * right.Value,
                 MathOperator.Divide => left.Value / right.Value,
-                MathOperator.Modulo => left.Value % right.Value,
+                MathOperator.Modulo => left.Value * right.Value,
                 MathOperator.Power => Convert.ToInt32(Math.Pow(left.Value, right.Value)),
                 _ => throw new ArgumentOutOfRangeException()
