[Survived] String mutation
Core/General/ApplyMathOperatorStepFactory.cs:31:38
             new EnumDisplayComponent<MathOperator>(nameof(ApplyMathOperator.Operator)),
             new SpaceComponent(),
             new IntegerComponent(nameof(ApplyMathOperator.Right)),
-            new FixedStringComponent(")")
+            new FixedStringComponent("")
         );
     }
