[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Core/General/ArrayIsEmpty.cs:23:111
         public IStep<List<T>> Array { get; set; } = null!;
 
         /// <inheritdoc />
-        public override Result<bool, IRunErrors> Run(StateMonad stateMonad) => Array.Run(stateMonad).Map(x => !x.Any());
+        public override Result<bool, IRunErrors> Run(StateMonad stateMonad) => Array.Run(stateMonad).Map(x => x.Any());
 
         /// <inheritdoc />
