[Killed] Negate expression
Core/General/AssertError.cs:19:17
         {
             var result = Test.Run(stateMonad);
 
-            if (result.IsFailure)
+            if (!(result.IsFailure))
                 return Unit.Default;
 
