[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
Core/General/Compare.cs:57:46
             return compareOperator switch
             {
                 CompareOperator.Equals => item1.Equals(item2),
-                CompareOperator.NotEquals => !item1.Equals(item2),
+                CompareOperator.NotEquals => item1.Equals(item2),
                 CompareOperator.LessThan => item1.CompareTo(item2) < 0,
                 CompareOperator.LessThanOrEqual => item1.CompareTo(item2) <= 0,

[Killed] Equality mutation
Core/General/Compare.cs:58:45
             {
                 CompareOperator.Equals => item1.Equals(item2),
                 CompareOperator.NotEquals => !item1.Equals(item2),
-                CompareOperator.LessThan => item1.CompareTo(item2) < 0,
+                CompareOperator.LessThan => item1.CompareTo(item2) > 0,
                 CompareOperator.LessThanOrEqual => item1.CompareTo(item2) <= 0,
                 CompareOperator.GreaterThan => item1.CompareTo(item2) > 0,

[Survived] Equality mutation
Core/General/Compare.cs:58:45
             {
                 CompareOperator.Equals => item1.Equals(item2),
                 CompareOperator.NotEquals => !item1.Equals(item2),
-                CompareOperator.LessThan => item1.CompareTo(item2) < 0,
+                CompareOperator.LessThan => item1.CompareTo(item2) <= 0,
                 CompareOperator.LessThanOrEqual => item1.CompareTo(item2) <= 0,
                 CompareOperator.GreaterThan => item1.CompareTo(item2) > 0,

[NoCoverage] Equality mutation
Core/General/Compare.cs:59:52
                 CompareOperator.Equals => item1.Equals(item2),
                 CompareOperator.NotEquals => !item1.Equals(item2),
                 CompareOperator.LessThan => item1.CompareTo(item2) < 0,
-                CompareOperator.LessThanOrEqual => item1.CompareTo(item2) <= 0,
+                CompareOperator.LessThanOrEqual => item1.CompareTo(item2) < 0,
                 CompareOperator.GreaterThan => item1.CompareTo(item2) > 0,
                 CompareOperator.GreaterThanOrEqual => item1.CompareTo(item2) >= 0,

[NoCoverage] Equality mutation
Core/General/Compare.cs:59:52
                 CompareOperator.Equals => item1.Equals(item2),
                 CompareOperator.NotEquals => !item1.Equals(item2),
                 CompareOperator.LessThan => item1.CompareTo(item2) < 0,
-                CompareOperator.LessThanOrEqual => item1.CompareTo(item2) <= 0,
+                CompareOperator.LessThanOrEqual => item1.CompareTo(item2) > 0,
                 CompareOperator.GreaterThan => item1.CompareTo(item2) > 0,
                 CompareOperator.GreaterThanOrEqual => item1.CompareTo(item2) >= 0,

[NoCoverage] Equality mutation
Core/General/Compare.cs:60:48
                 CompareOperator.NotEquals => !item1.Equals(item2),
                 CompareOperator.LessThan => item1.CompareTo(item2) < 0,
                 CompareOperator.LessThanOrEqual => item1.CompareTo(item2) <= 0,
-                CompareOperator.GreaterThan => item1.CompareTo(item2) > 0,
+                CompareOperator.GreaterThan => item1.CompareTo(item2) < 0,
                 CompareOperator.GreaterThanOrEqual => item1.CompareTo(item2) >= 0,
                 _ => throw new ArgumentOutOfRangeException(nameof(compareOperator), compareOperator, null)

[NoCoverage] Equality mutation
Core/General/Compare.cs:60:48
                 CompareOperator.NotEquals => !item1.Equals(item2),
                 CompareOperator.LessThan => item1.CompareTo(item2) < 0,
                 CompareOperator.LessThanOrEqual => item1.CompareTo(item2) <= 0,
-                CompareOperator.GreaterThan => item1.CompareTo(item2) > 0,
+                CompareOperator.GreaterThan => item1.CompareTo(item2) >= 0,
                 CompareOperator.GreaterThanOrEqual => item1.CompareTo(item2) >= 0,
                 _ => throw new ArgumentOutOfRangeException(nameof(compareOperator), compareOperator, null)

[Killed] Equality mutation
Core/General/Compare.cs:61:55
                 CompareOperator.LessThan => item1.CompareTo(item2) < 0,
                 CompareOperator.LessThanOrEqual => item1.CompareTo(item2) <= 0,
                 CompareOperator.GreaterThan => item1.CompareTo(item2) > 0,
-                CompareOperator.GreaterThanOrEqual => item1.CompareTo(item2) >= 0,
+                CompareOperator.GreaterThanOrEqual => item1.CompareTo(item2) < 0,
                 _ => throw new ArgumentOutOfRangeException(nameof(compareOperator), compareOperator, null)
             };

[Survived] Equality mutation
Core/General/Compare.cs:61:55
                 CompareOperator.LessThan => item1.CompareTo(item2) < 0,
                 CompareOperator.LessThanOrEqual => item1.CompareTo(item2) <= 0,
                 CompareOperator.GreaterThan => item1.CompareTo(item2) > 0,
-                CompareOperator.GreaterThanOrEqual => item1.CompareTo(item2) >= 0,
+                CompareOperator.GreaterThanOrEqual => item1.CompareTo(item2) > 0,
                 _ => throw new ArgumentOutOfRangeException(nameof(compareOperator), compareOperator, null)
             };
