[Killed] String mutation
Core/General/CompareStepFactory.cs:48:93
         }
 
         /// <inheritdoc />
-        public override IStepNameBuilder StepNameBuilder => new StepNameBuilderFromTemplate($"[{nameof(Compare<int>.Left)}] [{nameof(Compare<int>.Operator)}] [{nameof(Compare<int>.Right)}]");
+        public override IStepNameBuilder StepNameBuilder => new StepNameBuilderFromTemplate($"");
 
 

[Survived] String mutation
Core/General/CompareStepFactory.cs:53:38
 
         /// <inheritdoc />
         public override IStepSerializer Serializer { get; } = new StepSerializer(
-            new FixedStringComponent("("),
+            new FixedStringComponent(""),
             new IntegerComponent(nameof(Compare<int>.Left)),
             new SpaceComponent(),
