[Killed] Negate expression
Core/General/Conditional.cs:21:25
             var result = Condition.Run(stateMonad)
                 .Bind(r =>
                 {
-                    if (r)
+                    if (!(r))
                         return ThenStep.Run(stateMonad);
                     return ElseStep?.Run(stateMonad) ?? Unit.Default;
