[NoCoverage] Negate expression
Core/General/CreateDirectory.cs:20:17
         public override Result<Unit, IRunErrors> Run(StateMonad stateMonad)
         {
             var pathResult = Path.Run(stateMonad);
-            if (pathResult.IsFailure)
+            if (!(pathResult.IsFailure))
                 return pathResult.ConvertFailure<Unit>();
 

[NoCoverage] Negate expression
Core/General/CreateDirectory.cs:39:17
             }
 #pragma warning restore CA1031 // Do not catch general exception types
 
-            if (error.HasValue)
+            if (!(error.HasValue))
                 return Result.Failure<Unit, IRunErrors>(error.Value);
 
