[NoCoverage] Negate expression
Core/General/DeleteItem.cs:26:17
             var path = pathResult.Value;
 
 
-            if (Directory.Exists(path))
+            if (!(Directory.Exists(path)))
             {
                 Directory.Delete(path, true);

[NoCoverage] Boolean mutation
Core/General/DeleteItem.cs:28:40
 
             if (Directory.Exists(path))
             {
-                Directory.Delete(path, true);
+                Directory.Delete(path, false);
                 stateMonad.Logger.LogInformation($"Directory '{path}' Deleted.");
             }

[NoCoverage] Negate expression
Core/General/DeleteItem.cs:31:22
                 Directory.Delete(path, true);
                 stateMonad.Logger.LogInformation($"Directory '{path}' Deleted.");
             }
-            else if (File.Exists(path))
+            else if (!(File.Exists(path)))
             {
                 File.Delete(path);
