[NoCoverage] Negate expression
Core/General/DoesFileContain.cs:20:17
         {
             var pathResult = Path.Run(stateMonad);
 
-            if (pathResult.IsFailure) return pathResult.ConvertFailure<bool>();
+            if (!(pathResult.IsFailure)) return pathResult.ConvertFailure<bool>();
 
             if (!File.Exists(pathResult.Value))

[NoCoverage] Negate expression
Core/General/DoesFileContain.cs:22:17
 
             if (pathResult.IsFailure) return pathResult.ConvertFailure<bool>();
 
-            if (!File.Exists(pathResult.Value))
+            if (!(!File.Exists(pathResult.Value)))
                 return new RunError($"File '{pathResult.Value}' does not exist", Name, null,
                     ErrorCode.ExternalProcessError);

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
Core/General/DoesFileContain.cs:22:17
 
             if (pathResult.IsFailure) return pathResult.ConvertFailure<bool>();
 
-            if (!File.Exists(pathResult.Value))
+            if (File.Exists(pathResult.Value))
                 return new RunError($"File '{pathResult.Value}' does not exist", Name, null,
                     ErrorCode.ExternalProcessError);

[NoCoverage] String mutation
Core/General/DoesFileContain.cs:23:37
             if (pathResult.IsFailure) return pathResult.ConvertFailure<bool>();
 
             if (!File.Exists(pathResult.Value))
-                return new RunError($"File '{pathResult.Value}' does not exist", Name, null,
+                return new RunError($"", Name, null,
                     ErrorCode.ExternalProcessError);
 

[NoCoverage] Negate expression
Core/General/DoesFileContain.cs:27:17
                     ErrorCode.ExternalProcessError);
 
             var textResult = Text.Run(stateMonad);
-            if (textResult.IsFailure) return textResult.ConvertFailure<bool>();
+            if (!(textResult.IsFailure)) return textResult.ConvertFailure<bool>();
 
             Maybe<RunError> error;
