[Killed] Equality mutation
Core/General/ElementAtIndex.cs:33:30
         public override Result<T, IRunErrors> Run(StateMonad stateMonad) =>
             Array.Run(stateMonad)
                 .Compose(() => Index.Run(stateMonad))
-                .Ensure(x => x.Item2 >= 0 && x.Item2 < x.Item1.Count,
+                .Ensure(x => x.Item2 < 0  && x.Item2 < x.Item1.Count,
                     new RunError( "Index was out of the range of the array.", Name, null, ErrorCode.IndexOutOfBounds))
                 .Map(x=>x.Item1[x.Item2]);

[Killed] Equality mutation
Core/General/ElementAtIndex.cs:33:46
         public override Result<T, IRunErrors> Run(StateMonad stateMonad) =>
             Array.Run(stateMonad)
                 .Compose(() => Index.Run(stateMonad))
-                .Ensure(x => x.Item2 >= 0 && x.Item2 < x.Item1.Count,
+                .Ensure(x => x.Item2 >= 0 && x.Item2 > x.Item1.Count,
                     new RunError( "Index was out of the range of the array.", Name, null, ErrorCode.IndexOutOfBounds))
                 .Map(x=>x.Item1[x.Item2]);
