[NoCoverage] String mutation
Core/General/ElementAtIndexStepFactory.cs:24:57
         public override Type StepType => typeof(ElementAtIndex<>);
 
         /// <inheritdoc />
-        public override string OutputTypeExplanation => "T";
+        public override string OutputTypeExplanation => "";
 
         /// <inheritdoc />
