[Killed] Negate expression
Core/General/FirstIndexOf.cs:32:17
         public override Result<int, IRunErrors> Run(StateMonad stateMonad)
         {
             var str = String.Run(stateMonad);
-            if (str.IsFailure) return str.ConvertFailure<int>();
+            if (!(str.IsFailure)) return str.ConvertFailure<int>();
 
             var subString = SubString.Run(stateMonad);

[Killed] Negate expression
Core/General/FirstIndexOf.cs:35:17
             if (str.IsFailure) return str.ConvertFailure<int>();
 
             var subString = SubString.Run(stateMonad);
-            if (subString.IsFailure) return subString.ConvertFailure<int>();
+            if (!(subString.IsFailure)) return subString.ConvertFailure<int>();
 
 
