[Killed] Negate expression
Core/General/For.cs:56:17
         public override Result<Unit, IRunErrors> Run(StateMonad stateMonad)
         {
             var from = From.Run(stateMonad);
-            if (from.IsFailure) return from.ConvertFailure<Unit>();
+            if (!(from.IsFailure)) return from.ConvertFailure<Unit>();
 
             var to = To.Run(stateMonad);

[Killed] Negate expression
Core/General/For.cs:59:17
             if (from.IsFailure) return from.ConvertFailure<Unit>();
 
             var to = To.Run(stateMonad);
-            if (to.IsFailure) return from.ConvertFailure<Unit>();
+            if (!(to.IsFailure)) return from.ConvertFailure<Unit>();
 
             var increment = Increment.Run(stateMonad);

[Killed] Negate expression
Core/General/For.cs:62:17
             if (to.IsFailure) return from.ConvertFailure<Unit>();
 
             var increment = Increment.Run(stateMonad);
-            if (increment.IsFailure) return from.ConvertFailure<Unit>();
+            if (!(increment.IsFailure)) return from.ConvertFailure<Unit>();
 
             var currentValue = from.Value;

[Killed] Negate expression
Core/General/For.cs:67:17
             var currentValue = from.Value;
 
             var setResult = stateMonad.SetVariable(VariableName, currentValue);
-            if (setResult.IsFailure) return setResult.ConvertFailure<Unit>();
+            if (!(setResult.IsFailure)) return setResult.ConvertFailure<Unit>();
 
             while (currentValue <= to.Value)

[Killed] Negate expression
Core/General/For.cs:69:20
             var setResult = stateMonad.SetVariable(VariableName, currentValue);
             if (setResult.IsFailure) return setResult.ConvertFailure<Unit>();
 
-            while (currentValue <= to.Value)
+            while (!(currentValue <= to.Value))
             {
                 var r = Action.Run(stateMonad);

[Killed] Equality mutation
Core/General/For.cs:69:20
             var setResult = stateMonad.SetVariable(VariableName, currentValue);
             if (setResult.IsFailure) return setResult.ConvertFailure<Unit>();
 
-            while (currentValue <= to.Value)
+            while (currentValue > to.Value)
             {
                 var r = Action.Run(stateMonad);

[Killed] Negate expression
Core/General/For.cs:72:21
             while (currentValue <= to.Value)
             {
                 var r = Action.Run(stateMonad);
-                if (r.IsFailure) return r;
+                if (!(r.IsFailure)) return r;
 
 

[Killed] Negate expression
Core/General/For.cs:76:21
 
 
                 var currentValueResult = stateMonad.GetVariable<int>(VariableName, Name);
-                if (currentValueResult.IsFailure) return currentValueResult.ConvertFailure<Unit>();
+                if (!(currentValueResult.IsFailure)) return currentValueResult.ConvertFailure<Unit>();
                 currentValue = currentValueResult.Value;
                 currentValue += increment.Value;

[Timeout] AddAssignmentExpression to SubtractAssignmentExpression mutation
Core/General/For.cs:78:17
                 var currentValueResult = stateMonad.GetVariable<int>(VariableName, Name);
                 if (currentValueResult.IsFailure) return currentValueResult.ConvertFailure<Unit>();
                 currentValue = currentValueResult.Value;
-                currentValue += increment.Value;
+                                currentValue -=increment.Value;
 
                 var setResult2 = stateMonad.SetVariable(VariableName, currentValue);

[Killed] Negate expression
Core/General/For.cs:81:21
                 currentValue += increment.Value;
 
                 var setResult2 = stateMonad.SetVariable(VariableName, currentValue);
-                if (setResult2.IsFailure) return setResult.ConvertFailure<Unit>();
+                if (!(setResult2.IsFailure)) return setResult.ConvertFailure<Unit>();
             }
 
