[Killed] Negate expression
Core/General/ForEach.cs:41:17
         public override Result<Unit, IRunErrors> Run(StateMonad stateMonad)
         {
             var elements = Array.Run(stateMonad);
-            if (elements.IsFailure) return elements.ConvertFailure<Unit>();
+            if (!(elements.IsFailure)) return elements.ConvertFailure<Unit>();
 
             foreach (var element in elements.Value)

[Killed] Negate expression
Core/General/ForEach.cs:46:21
             foreach (var element in elements.Value)
             {
                 var setResult = stateMonad.SetVariable(VariableName, element);
-                if (setResult.IsFailure) return setResult.ConvertFailure<Unit>();
+                if (!(setResult.IsFailure)) return setResult.ConvertFailure<Unit>();
 
                 var r = Action.Run(stateMonad);
