[Killed] Negate expression
Core/General/GetLetterAtIndex.cs:32:17
         public override Result<string, IRunErrors> Run(StateMonad stateMonad)
         {
             var index = Index.Run(stateMonad);
-            if (index.IsFailure) return index.ConvertFailure<string>();
+            if (!(index.IsFailure)) return index.ConvertFailure<string>();
 
             var str = String.Run(stateMonad);

[Killed] Negate expression
Core/General/GetLetterAtIndex.cs:35:17
             if (index.IsFailure) return index.ConvertFailure<string>();
 
             var str = String.Run(stateMonad);
-            if (str.IsFailure) return str;
+            if (!(str.IsFailure)) return str;
 
             if (index.Value < 0 || index.Value >= str.Value.Length)

[Killed] Negate expression
Core/General/GetLetterAtIndex.cs:37:17
             var str = String.Run(stateMonad);
             if (str.IsFailure) return str;
 
-            if (index.Value < 0 || index.Value >= str.Value.Length)
+            if (!(index.Value < 0 || index.Value >= str.Value.Length))
                 return new RunError("Index was outside the bounds of the string", Name, null, ErrorCode.IndexOutOfBounds);
 

[Killed] Equality mutation
Core/General/GetLetterAtIndex.cs:37:36
             var str = String.Run(stateMonad);
             if (str.IsFailure) return str;
 
-            if (index.Value < 0 || index.Value >= str.Value.Length)
+            if (index.Value < 0 || index.Value < str.Value.Length)
                 return new RunError("Index was outside the bounds of the string", Name, null, ErrorCode.IndexOutOfBounds);
 

[NoCoverage] String mutation
Core/General/GetLetterAtIndex.cs:38:37
             if (str.IsFailure) return str;
 
             if (index.Value < 0 || index.Value >= str.Value.Length)
-                return new RunError("Index was outside the bounds of the string", Name, null, ErrorCode.IndexOutOfBounds);
+                return new RunError("", Name, null, ErrorCode.IndexOutOfBounds);
 
             return str.Value[index.Value].ToString();
