[Killed] String mutation
Core/General/GetLetterAtIndexStepFactory.cs:18:93
         public static SimpleStepFactory<GetLetterAtIndex, string> Instance { get; } = new GetLetterAtIndexStepFactory();
 
         /// <inheritdoc />
-        public override IStepNameBuilder StepNameBuilder => new StepNameBuilderFromTemplate($"Get character at index '[{nameof(GetLetterAtIndex.Index)}]' in '[{nameof(GetLetterAtIndex.String)}]'");
+        public override IStepNameBuilder StepNameBuilder => new StepNameBuilderFromTemplate($"");
     }
 }
