[Killed] Negate expression
Core/General/GetSubstring.cs:43:17
             var index = Index.Run(stateMonad);
             if (index.IsFailure) return index.ConvertFailure<string>();
             var length = Length.Run(stateMonad);
-            if (length.IsFailure) return length.ConvertFailure<string>();
+            if (!(length.IsFailure)) return length.ConvertFailure<string>();
 
 

[Killed] Equality mutation
Core/General/GetSubstring.cs:46:17
             if (length.IsFailure) return length.ConvertFailure<string>();
 
 
-            if (index.Value < 0 || index.Value >= str.Value.Length)
+            if (index.Value > 0  || index.Value >= str.Value.Length)
                 return new RunError("Index was outside the bounds of the string", Name, null, ErrorCode.IndexOutOfBounds);
 
