[Killed] Arithmetic mutation
Core/General/IncrementVariable.cs:32:60
         public override Result<Unit, IRunErrors> Run(StateMonad stateMonad) =>
             stateMonad.GetVariable<int>(Variable, Name)
                 .Compose(() => Amount.Run(stateMonad))
-                .Tap(x => stateMonad.SetVariable(Variable, x.Item1 + x.Item2))
+                .Tap(x => stateMonad.SetVariable(Variable, x.Item1 - x.Item2))
                 .Map(x => Unit.Default);
 
