[Killed] Negate expression
Core/General/JoinStrings.cs:32:17
         public override Result<string, IRunErrors> Run(StateMonad stateMonad)
         {
             var list = List.Run(stateMonad);
-            if (list.IsFailure) return list.ConvertFailure<string>();
+            if (!(list.IsFailure)) return list.ConvertFailure<string>();
 
             var delimiter = Delimiter.Run(stateMonad);

[Killed] Negate expression
Core/General/JoinStrings.cs:35:17
             if (list.IsFailure) return list.ConvertFailure<string>();
 
             var delimiter = Delimiter.Run(stateMonad);
-            if (delimiter.IsFailure) return delimiter;
+            if (!(delimiter.IsFailure)) return delimiter;
 
 
