[Killed] String mutation
Core/General/LengthOfStringStepFactory.cs:15:93
         public static SimpleStepFactory<LengthOfString, int> Instance { get; } = new LengthOfStringStepFactory();
 
         /// <inheritdoc />
-        public override IStepNameBuilder StepNameBuilder => new StepNameBuilderFromTemplate($"Length of [{nameof(LengthOfString.String)}]");
+        public override IStepNameBuilder StepNameBuilder => new StepNameBuilderFromTemplate($"");
 
     }
