[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Core/General/Not.cs:15:113
     public sealed class Not : CompoundStep<bool>
     {
         /// <inheritdoc />
-        public override Result<bool, IRunErrors> Run(StateMonad stateMonad) => Boolean.Run(stateMonad).Map(x => !x);
+        public override Result<bool, IRunErrors> Run(StateMonad stateMonad) => Boolean.Run(stateMonad).Map(x => x);
 
         /// <inheritdoc />
