[Survived] String mutation
Core/General/NotStepFactory.cs:24:38
         /// <inheritdoc />
         public override IStepSerializer Serializer { get; } = new StepSerializer(
             new FixedStringComponent("not"),
-            new FixedStringComponent("("),
+            new FixedStringComponent(""),
             new BooleanComponent(nameof(Not.Boolean)),
             new FixedStringComponent(")")
