[Killed] Negate expression
Core/General/Print.cs:19:17
         public override Result<Unit, IRunErrors> Run(StateMonad stateMonad)
         {
             var r = Value.Run(stateMonad);
-            if (r.IsFailure) return r.ConvertFailure<Unit>();
+            if (!(r.IsFailure)) return r.ConvertFailure<Unit>();
 
             stateMonad.Logger.LogInformation(r.Value?.ToString());
