[Survived] String mutation
Core/General/PrintStepFactory.cs:27:101
         protected override ITypeReference GetOutputTypeReference(ITypeReference memberTypeReference) => new ActualTypeReference(typeof(Unit));
 
         /// <inheritdoc />
-        public override IStepNameBuilder StepNameBuilder { get; } = new StepNameBuilderFromTemplate($"Print [{nameof(Print<object>.Value)}]");
+        public override IStepNameBuilder StepNameBuilder { get; } = new StepNameBuilderFromTemplate($"");
 
         /// <inheritdoc />
