[NoCoverage] Negate expression
Core/General/ReadCsv.cs:21:17
         public override Result<List<List<string>>, IRunErrors> Run(StateMonad stateMonad)
         {
             var textResult = Text.Run(stateMonad);
-            if (textResult.IsFailure) return textResult.ConvertFailure<List<List<string>>>();
+            if (!(textResult.IsFailure)) return textResult.ConvertFailure<List<List<string>>>();
 
             var delimiterResult = Delimiter.Run(stateMonad);

[NoCoverage] Negate expression
Core/General/ReadCsv.cs:24:17
             if (textResult.IsFailure) return textResult.ConvertFailure<List<List<string>>>();
 
             var delimiterResult = Delimiter.Run(stateMonad);
-            if (delimiterResult.IsFailure) return delimiterResult.ConvertFailure<List<List<string>>>();
+            if (!(delimiterResult.IsFailure)) return delimiterResult.ConvertFailure<List<List<string>>>();
 
             string? commentToken;

[NoCoverage] Negate expression
Core/General/ReadCsv.cs:28:17
 
             string? commentToken;
 
-            if (CommentToken == null)
+            if (!(CommentToken == null))
                 commentToken = null;
             else

[NoCoverage] Equality mutation
Core/General/ReadCsv.cs:28:17
 
             string? commentToken;
 
-            if (CommentToken == null)
+            if (CommentToken != null)
                 commentToken = null;
             else

[NoCoverage] Negate expression
Core/General/ReadCsv.cs:33:21
             else
             {
                 var commentTokenResult = CommentToken.Run(stateMonad);
-                if (commentTokenResult.IsFailure) return commentTokenResult.ConvertFailure<List<List<string>>>();
+                if (!(commentTokenResult.IsFailure)) return commentTokenResult.ConvertFailure<List<List<string>>>();
                 commentToken = commentTokenResult.Value;
             }

[NoCoverage] Negate expression
Core/General/ReadCsv.cs:38:17
             }
 
             var fieldsEnclosedInQuotesResult = HasFieldsEnclosedInQuotes.Run(stateMonad);
-            if (fieldsEnclosedInQuotesResult.IsFailure) return fieldsEnclosedInQuotesResult.ConvertFailure<List<List<string>>>();
+            if (!(fieldsEnclosedInQuotesResult.IsFailure)) return fieldsEnclosedInQuotesResult.ConvertFailure<List<List<string>>>();
 
             var columnsToMapResult = ColumnsToMap.Run(stateMonad);

[NoCoverage] Negate expression
Core/General/ReadCsv.cs:41:17
             if (fieldsEnclosedInQuotesResult.IsFailure) return fieldsEnclosedInQuotesResult.ConvertFailure<List<List<string>>>();
 
             var columnsToMapResult = ColumnsToMap.Run(stateMonad);
-            if (columnsToMapResult.IsFailure) return columnsToMapResult.ConvertFailure<List<List<string>>>();
+            if (!(columnsToMapResult.IsFailure)) return columnsToMapResult.ConvertFailure<List<List<string>>>();
 
 

[NoCoverage] Negate expression
Core/General/ReadCsv.cs:47:17
             var dataTableResult = CsvReader.TryReadCSVFromString(textResult.Value, delimiterResult.Value, commentToken,
                 fieldsEnclosedInQuotesResult.Value);
 
-            if (dataTableResult.IsFailure) return dataTableResult
+            if (!(dataTableResult.IsFailure)) return dataTableResult
                 .MapFailure(x=> new RunError(x, nameof(RunExternalProcess), null, ErrorCode.CSVError) as IRunErrors)
                 .ConvertFailure<List<List<string>>>();

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
Core/General/ReadCsv.cs:52:29
                 .ConvertFailure<List<List<string>>>();
 
             var missingColumnsErrors = columnsToMapResult.Value
-                .Where(x => !dataTableResult.Value.Columns.Contains(x))
+                .Where(x => dataTableResult.Value.Columns.Contains(x))
                 .Select(x=> new RunError($"Missing Column: '{x}'", nameof(ReadCsv), null, ErrorCode.CSVError))
                 .ToList();

[NoCoverage] Negate expression
Core/General/ReadCsv.cs:56:17
                 .Select(x=> new RunError($"Missing Column: '{x}'", nameof(ReadCsv), null, ErrorCode.CSVError))
                 .ToList();
 
-            if (missingColumnsErrors.Any())
+            if (!(missingColumnsErrors.Any()))
                 return new RunErrorList(missingColumnsErrors);
 

[NoCoverage] Boolean mutation
Core/General/ReadCsv.cs:106:89
         [StepProperty(Order = 4)]
         [DefaultValueExplanation("false")]
         [Required]
-        public IStep<bool> HasFieldsEnclosedInQuotes { get; set; } = new Constant<bool>(false);
+        public IStep<bool> HasFieldsEnclosedInQuotes { get; set; } = new Constant<bool>(true);
 
         /// <summary>
