[NoCoverage] Negate expression
Core/General/ReadFile.cs:21:17
         {
             var data = Folder.Run(stateMonad).Compose(() => FileName.Run(stateMonad));
 
-            if (data.IsFailure)
+            if (!(data.IsFailure))
                 return data.ConvertFailure<string>();
 
