[Killed] Negate expression
Core/General/RepeatWhile.cs:21:21
             while (true)
             {
                 var conditionResult = Condition.Run(stateMonad);
-                if (conditionResult.IsFailure) return conditionResult.ConvertFailure<Unit>();
+                if (!(conditionResult.IsFailure)) return conditionResult.ConvertFailure<Unit>();
 
                 if (conditionResult.Value)

[Killed] Negate expression
Core/General/RepeatWhile.cs:23:21
                 var conditionResult = Condition.Run(stateMonad);
                 if (conditionResult.IsFailure) return conditionResult.ConvertFailure<Unit>();
 
-                if (conditionResult.Value)
+                if (!(conditionResult.Value))
                 {
                     var actionResult = Action.Run(stateMonad);

[Killed] Negate expression
Core/General/RepeatWhile.cs:26:25
                 if (conditionResult.Value)
                 {
                     var actionResult = Action.Run(stateMonad);
-                    if (actionResult.IsFailure) return actionResult.ConvertFailure<Unit>();
+                    if (!(actionResult.IsFailure)) return actionResult.ConvertFailure<Unit>();
                 }
                 else break;
