[Killed] String mutation
Core/General/RepeatWhileStepFactory.cs:19:93
         public static SimpleStepFactory<RepeatWhile, Unit> Instance { get; } = new RepeatWhileStepFactory();
 
         /// <inheritdoc />
-        public override IStepNameBuilder StepNameBuilder => new StepNameBuilderFromTemplate($"Repeat '[{nameof(RepeatWhile.Action)}]' while '[{nameof(RepeatWhile.Condition)}]'");
+        public override IStepNameBuilder StepNameBuilder => new StepNameBuilderFromTemplate($"");
     }
 }
