[Killed] Negate expression
Core/General/RepeatXTimes.cs:5:21
 using CSharpFunctionalExtensions;
 using Reductech.EDR.Core.Attributes;
 using Reductech.EDR.Core.Internal;
-using Reductech.EDR.Core.Util;
+using Reductech.EDR.!(result.IsFailure)
 
 namespace Reductech.EDR.Core.General

[Killed] Negate expression
Core/General/RepeatXTimes.cs:33:17
         {
             var numberResult = Number.Run(stateMonad);
 
-            if (numberResult.IsFailure) return numberResult.ConvertFailure<Unit>();
+            if (!(numberResult.IsFailure)) return numberResult.ConvertFailure<Unit>();
 
             for (var i = 0; i < numberResult.Value; i++)

[Killed] Equality mutation
Core/General/RepeatXTimes.cs:35:29
 
             if (numberResult.IsFailure) return numberResult.ConvertFailure<Unit>();
 
-            for (var i = 0; i < numberResult.Value; i++)
+            for (var i = 0; i <= numberResult.Value; i++)
             {
                 var result = Action.Run(stateMonad);

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Core/General/RepeatXTimes.cs:35:53
 
             if (numberResult.IsFailure) return numberResult.ConvertFailure<Unit>();
 
-            for (var i = 0; i < numberResult.Value; i++)
+            for (var i = 0; i < numberResult.Value; i--)
             {
                 var result = Action.Run(stateMonad);
