[Killed] String mutation
Core/General/RepeatXTimesStepFactory.cs:19:93
 
 
         /// <inheritdoc />
-        public override IStepNameBuilder StepNameBuilder => new StepNameBuilderFromTemplate($"Repeat '[{nameof(RepeatXTimes.Action)}]' '[{nameof(RepeatXTimes.Number)}]' times.");
+        public override IStepNameBuilder StepNameBuilder => new StepNameBuilderFromTemplate($"");
     }
 }
