[NoCoverage] Negate expression
Core/General/RunExternalProcess.cs:19:17
         public override Result<Unit, IRunErrors> Run(StateMonad stateMonad)
         {
             var pathResult = ProcessPath.Run(stateMonad);
-            if (pathResult.IsFailure) return pathResult.ConvertFailure<Unit>();
+            if (!(pathResult.IsFailure)) return pathResult.ConvertFailure<Unit>();
 
             List<string> arguments;

[NoCoverage] Negate expression
Core/General/RunExternalProcess.cs:23:16
 
             List<string> arguments;
 
-            if(Arguments == null)
+            if(!(Arguments == null))
                 arguments = new List<string>();
             else

[NoCoverage] Equality mutation
Core/General/RunExternalProcess.cs:23:16
 
             List<string> arguments;
 
-            if(Arguments == null)
+            if(Arguments != null)
                 arguments = new List<string>();
             else

[NoCoverage] Negate expression
Core/General/RunExternalProcess.cs:29:21
             {
                 var argsResult = Arguments.Run(stateMonad);
 
-                if (argsResult.IsFailure) return argsResult.ConvertFailure<Unit>();
+                if (!(argsResult.IsFailure)) return argsResult.ConvertFailure<Unit>();
                 arguments = argsResult.Value;
             }
