[Killed] Linq method mutation (Reverse() to AsEnumerable())
Core/General/Sequence.cs:19:57
         /// <inheritdoc />
         public override Result<Unit, IRunErrors> Run(StateMonad stateMonad)
         {
-            var remainingSteps = new Stack<IStep<Unit>>(Steps.Reverse());
+            var remainingSteps = new Stack<IStep<Unit>>(Steps.AsEnumerable());
 
             while (remainingSteps.TryPop(out var step))

[Killed] Negate expression
Core/General/Sequence.cs:21:20
         {
             var remainingSteps = new Stack<IStep<Unit>>(Steps.Reverse());
 
-            while (remainingSteps.TryPop(out var step))
+            while (!(remainingSteps.TryPop(out var step)))
             {
                 if (step.StepCombiners.Any() && remainingSteps.TryPop(out var nextStep))

[NoCoverage] Boolean mutation
Core/General/Sequence.cs:25:36
             {
                 if (step.StepCombiners.Any() && remainingSteps.TryPop(out var nextStep))
                 {
-                    var combined = false;
+                    var combined = true;
                     foreach (var stepCombiner in step.StepCombiners)
                     {

[NoCoverage] Negate expression
Core/General/Sequence.cs:29:29
                     foreach (var stepCombiner in step.StepCombiners)
                     {
                         var combineResult = stepCombiner.TryCombine(step, nextStep);
-                        if (combineResult.IsSuccess)
+                        if (!(combineResult.IsSuccess))
                         {
                             remainingSteps.Push(combineResult.Value);

[NoCoverage] Boolean mutation
Core/General/Sequence.cs:32:40
                         if (combineResult.IsSuccess)
                         {
                             remainingSteps.Push(combineResult.Value);
-                            combined = true;
+                            combined = false;
                             break;
                         }

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
Core/General/Sequence.cs:37:24
                         }
                     }
 
-                    if(!combined)
+                    if(combined)
                         remainingSteps.Push(nextStep); //put it back
                     else

[NoCoverage] Negate expression
Core/General/Sequence.cs:37:24
                         }
                     }
 
-                    if(!combined)
+                    if(!(!combined))
                         remainingSteps.Push(nextStep); //put it back
                     else

[Killed] Negate expression
Core/General/Sequence.cs:45:21
                 }
 
                 var r = step.Run(stateMonad);
-                if (r.IsFailure)
+                if (!(r.IsFailure))
                     return r.ConvertFailure<Unit>();
 
