[Killed] String mutation
Core/General/SetVariableStepFactory.cs:31:93
 
 
         /// <inheritdoc />
-        public override IStepNameBuilder StepNameBuilder => new StepNameBuilderFromTemplate($"[{nameof(SetVariable<object>.VariableName)}] = [{nameof(SetVariable<object>.Value)}]");
+        public override IStepNameBuilder StepNameBuilder => new StepNameBuilderFromTemplate($"");
 
         /// <inheritdoc />

[Killed] Collection initializer mutation
Core/General/SetVariableStepFactory.cs:72:24
         /// </summary>
         public static IFreezableStep CreateFreezable(VariableName variableName, IFreezableStep value)
         {
-            var dict = new Dictionary<string, StepMember>
-            {
-                {nameof(SetVariable<object>.VariableName), new StepMember(variableName)},
-                {nameof(SetVariable<object>.Value), new StepMember(value)}
-            };
+            var dict = new Dictionary<string, StepMember>
+{};
 
             var fpd = new FreezableStepData(dict);
