[Killed] Linq method mutation (OrderBy() to OrderByDescending())
Core/General/SortArray.cs:40:40
         private static List<T> Sort(IEnumerable<T> list, SortOrder sortOrder) =>
             sortOrder switch
             {
-                SortOrder.Ascending => list.OrderBy(x => x).ToList(),
+                SortOrder.Ascending => list.OrderByDescending(x => x).ToList(),
                 SortOrder.Descending => list.OrderByDescending(x => x).ToList(),
                 _ => throw new ArgumentOutOfRangeException(nameof(sortOrder), sortOrder, null)

[Killed] Linq method mutation (OrderByDescending() to OrderBy())
Core/General/SortArray.cs:41:41
             sortOrder switch
             {
                 SortOrder.Ascending => list.OrderBy(x => x).ToList(),
-                SortOrder.Descending => list.OrderByDescending(x => x).ToList(),
+                SortOrder.Descending => list.OrderBy(x => x).ToList(),
                 _ => throw new ArgumentOutOfRangeException(nameof(sortOrder), sortOrder, null)
             };
