[Killed] Negate expression
Core/General/StringIsEmpty.cs:17:17
         public override Result<bool, IRunErrors> Run(StateMonad stateMonad)
         {
             var str = String.Run(stateMonad);
-            if (str.IsFailure) return str.ConvertFailure<bool>();
+            if (!(str.IsFailure)) return str.ConvertFailure<bool>();
 
             return string.IsNullOrWhiteSpace(str.Value);
