[Killed] Negate expression
Core/General/Test.cs:17:28
         public override Result<T, IRunErrors> Run(StateMonad stateMonad)
         {
             var result = Condition.Run(stateMonad)
-                .Bind(r => r ? ThenValue.Run(stateMonad) : ElseValue.Run(stateMonad));
+                .Bind(r => !(r ) ? ThenValue.Run(stateMonad) : ElseValue.Run(stateMonad));
 
             return result;
