[NoCoverage] Boolean mutation
Core/General/Unzip.cs:66:78
         [StepProperty]
         [Required]
         [DefaultValueExplanation("false")]
-        public IStep<bool> OverwriteFiles { get; set; } = new Constant<bool>(false);
+        public IStep<bool> OverwriteFiles { get; set; } = new Constant<bool>(true);
 
         /// <inheritdoc />
