[NoCoverage] Negate expression
Core/General/WriteFile.cs:40:17
             }
 #pragma warning restore CA1031 // Do not catch general exception types
 
-            if (errors.HasValue)
+            if (!(errors.HasValue))
                 return Result.Failure<Unit, IRunErrors>(errors.Value);
             return Unit.Default;
