[NoCoverage] Boolean mutation
Core/Internal/ActualTypeReference.cs:26:39
         /// <inheritdoc />
         public bool Equals(ITypeReference? other)
         {
-            if (other is null) return false;
+            if (other is null) return true;
             if (ReferenceEquals(this, other)) return true;
 

[Survived] Negate expression
Core/Internal/ActualTypeReference.cs:27:17
         public bool Equals(ITypeReference? other)
         {
             if (other is null) return false;
-            if (ReferenceEquals(this, other)) return true;
+            if (!(ReferenceEquals(this, other))) return true;
 
             return other switch

[NoCoverage] Boolean mutation
Core/Internal/ActualTypeReference.cs:27:54
         public bool Equals(ITypeReference? other)
         {
             if (other is null) return false;
-            if (ReferenceEquals(this, other)) return true;
+            if (ReferenceEquals(this, other)) return false;
 
             return other switch

[Killed] Equality mutation
Core/Internal/ActualTypeReference.cs:31:51
 
             return other switch
             {
-                ActualTypeReference actualType => Type == actualType.Type,
+                ActualTypeReference actualType => Type != actualType.Type,
                 MultipleTypeReference multipleTypeReference => multipleTypeReference.AllReferences.Count == 0 &&
                                                                multipleTypeReference.AllReferences.Contains(this),

[NoCoverage] Logical mutation
Core/Internal/ActualTypeReference.cs:32:64
             return other switch
             {
                 ActualTypeReference actualType => Type == actualType.Type,
-                MultipleTypeReference multipleTypeReference => multipleTypeReference.AllReferences.Count == 0 &&
-                                                               multipleTypeReference.AllReferences.Contains(this),
+                MultipleTypeReference multipleTypeReference => multipleTypeReference.AllReferences.Count == 0 ||
+                                                               multipleTypeReference.AllReferences.Contains(this),
                 VariableTypeReference _ => false,
                 GenericTypeReference _ => false,

[NoCoverage] Equality mutation
Core/Internal/ActualTypeReference.cs:32:64
             return other switch
             {
                 ActualTypeReference actualType => Type == actualType.Type,
-                MultipleTypeReference multipleTypeReference => multipleTypeReference.AllReferences.Count == 0 &&
+                MultipleTypeReference multipleTypeReference => multipleTypeReference.AllReferences.Count != 0  &&
                                                                multipleTypeReference.AllReferences.Contains(this),
                 VariableTypeReference _ => false,

[NoCoverage] Boolean mutation
Core/Internal/ActualTypeReference.cs:34:44
                 ActualTypeReference actualType => Type == actualType.Type,
                 MultipleTypeReference multipleTypeReference => multipleTypeReference.AllReferences.Count == 0 &&
                                                                multipleTypeReference.AllReferences.Contains(this),
-                VariableTypeReference _ => false,
+                VariableTypeReference _ => true,
                 GenericTypeReference _ => false,
                 _ => throw new ArgumentOutOfRangeException(nameof(other))

[NoCoverage] Boolean mutation
Core/Internal/ActualTypeReference.cs:35:43
                 MultipleTypeReference multipleTypeReference => multipleTypeReference.AllReferences.Count == 0 &&
                                                                multipleTypeReference.AllReferences.Contains(this),
                 VariableTypeReference _ => false,
-                GenericTypeReference _ => false,
+                GenericTypeReference _ => true,
                 _ => throw new ArgumentOutOfRangeException(nameof(other))
             };

[NoCoverage] Logical mutation
Core/Internal/ActualTypeReference.cs:41:53
         }
 
         /// <inheritdoc />
-        public override bool Equals(object? obj) => ReferenceEquals(this, obj) || obj is ITypeReference other && Equals(other);
+        public override bool Equals(object? obj) => ReferenceEquals(this, obj) && obj is ITypeReference other && Equals(other);
 
         /// <inheritdoc />

[NoCoverage] Logical mutation
Core/Internal/ActualTypeReference.cs:41:83
         }
 
         /// <inheritdoc />
-        public override bool Equals(object? obj) => ReferenceEquals(this, obj) || obj is ITypeReference other && Equals(other);
+        public override bool Equals(object? obj) => ReferenceEquals(this, obj) || obj is ITypeReference other || Equals(other);
 
         /// <inheritdoc />

[Killed] Negate expression
Core/Internal/ActualTypeReference.cs:60:17
         /// </summary>
         public static ITypeReference Create(Type type)
         {
-            if (type.IsGenericType)
+            if (!(type.IsGenericType))
             {
                 var genericTypeDef = type.GetGenericTypeDefinition();
