[Survived] Logical mutation
Core/Internal/CompoundFreezableStep.cs:85:20
         {
             if (other is null) return false;
             if (ReferenceEquals(this, other)) return true;
-            return StepFactory.Equals(other.StepFactory) &&
-                   FreezableStepData.Equals(other.FreezableStepData) &&
-                   Equals(StepConfiguration, other.StepConfiguration);
+            return StepFactory.Equals(other.StepFactory) &&
+                   FreezableStepData.Equals(other.FreezableStepData) ||
+                   Equals(StepConfiguration, other.StepConfiguration);
         }
 

[Survived] Logical mutation
Core/Internal/CompoundFreezableStep.cs:85:20
         {
             if (other is null) return false;
             if (ReferenceEquals(this, other)) return true;
-            return StepFactory.Equals(other.StepFactory) &&
-                   FreezableStepData.Equals(other.FreezableStepData) &&
+            return StepFactory.Equals(other.StepFactory) ||
+                   FreezableStepData.Equals(other.FreezableStepData)  &&
                    Equals(StepConfiguration, other.StepConfiguration);
         }

[NoCoverage] Logical mutation
Core/Internal/CompoundFreezableStep.cs:91:53
         }
 
         /// <inheritdoc />
-        public override bool Equals(object? obj) => ReferenceEquals(this, obj) || obj is CompoundFreezableStep other && Equals(other);
+        public override bool Equals(object? obj) => ReferenceEquals(this, obj) && obj is CompoundFreezableStep other && Equals(other);
 
         /// <inheritdoc />

[NoCoverage] Logical mutation
Core/Internal/CompoundFreezableStep.cs:91:83
         }
 
         /// <inheritdoc />
-        public override bool Equals(object? obj) => ReferenceEquals(this, obj) || obj is CompoundFreezableStep other && Equals(other);
+        public override bool Equals(object? obj) => ReferenceEquals(this, obj) || obj is CompoundFreezableStep other || Equals(other);
 
         /// <inheritdoc />

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
Core/Internal/CompoundFreezableStep.cs:104:102
         /// <summary>
         /// Not Equals Operator.
         /// </summary>
-        public static bool operator !=(CompoundFreezableStep? left, CompoundFreezableStep? right) => !Equals(left, right);
+        public static bool operator !=(CompoundFreezableStep? left, CompoundFreezableStep? right) => Equals(left, right);
     }
 }
