[Timeout] Equality mutation
Core/Internal/CompoundStep.cs:55:33
             get
             {
                 return GetType().GetProperties()
-                    .Where(x => x.GetCustomAttribute<StepPropertyAttribute>() != null)
+                    .Where(x => x.GetCustomAttribute<StepPropertyAttribute>() == null)
                     .Select(x => (x.Name, step: x.GetValue(this) as IStep))
                     .Where(x => x.step != null)!;

[Killed] Equality mutation
Core/Internal/CompoundStep.cs:57:33
                 return GetType().GetProperties()
                     .Where(x => x.GetCustomAttribute<StepPropertyAttribute>() != null)
                     .Select(x => (x.Name, step: x.GetValue(this) as IStep))
-                    .Where(x => x.step != null)!;
+                    .Where(x => x.step == null)!;
             }
         }

[Timeout] Equality mutation
Core/Internal/CompoundStep.cs:67:33
             {
                 return GetType()
                     .GetProperties()
-                    .Where(x => x.GetCustomAttribute<StepListPropertyAttribute>() != null)
+                    .Where(x => x.GetCustomAttribute<StepListPropertyAttribute>() == null)
                     .Select(x => (x.Name, list: x.GetValue(this) as IEnumerable<IStep>))
                     .Where(x => x.list != null)!;

[Killed] Equality mutation
Core/Internal/CompoundStep.cs:69:33
                     .GetProperties()
                     .Where(x => x.GetCustomAttribute<StepListPropertyAttribute>() != null)
                     .Select(x => (x.Name, list: x.GetValue(this) as IEnumerable<IStep>))
-                    .Where(x => x.list != null)!;
+                    .Where(x => x.list == null)!;
             }
         }

[Killed] Equality mutation
Core/Internal/CompoundStep.cs:78:29
             get
             {
                 var variableNames = GetType().GetProperties()
-                .Where(x => x.GetCustomAttribute<VariableNameAttribute>() != null)
+                .Where(x => x.GetCustomAttribute<VariableNameAttribute>() == null)
                 .Select(x => (x.Name, variableName: (VariableName)x.GetValue(this)!))
                 .Where(x => x.variableName != null)

[Killed] Equality mutation
Core/Internal/CompoundStep.cs:80:29
                 var variableNames = GetType().GetProperties()
                 .Where(x => x.GetCustomAttribute<VariableNameAttribute>() != null)
                 .Select(x => (x.Name, variableName: (VariableName)x.GetValue(this)!))
-                .Where(x => x.variableName != null)
+                .Where(x => x.variableName == null)
 
                 .ToDictionary(x => x.Name, x => new StepMember(x.variableName)  );
