[NoCoverage] Negate expression
Core/Internal/ConsoleMethods.cs:59:17
         /// </summary>
         protected void ExecuteAbstract(string? yaml, string? path)
         {
-            if (string.IsNullOrWhiteSpace(yaml))
+            if (!(string.IsNullOrWhiteSpace(yaml)))
             {
                 if (string.IsNullOrWhiteSpace(path))

[NoCoverage] Negate expression
Core/Internal/ConsoleMethods.cs:61:21
         {
             if (string.IsNullOrWhiteSpace(yaml))
             {
-                if (string.IsNullOrWhiteSpace(path))
+                if (!(string.IsNullOrWhiteSpace(path)))
                 {
                     throw new ArgumentException($"Please provide either {nameof(yaml)} or {nameof(path)}");

[NoCoverage] Negate expression
Core/Internal/ConsoleMethods.cs:96:17
                 .Bind(x => x.TryFreeze())
                 .BindCast<IStep, IStep<Unit>>();
 
-            if (freezeResult.IsFailure)
+            if (!(freezeResult.IsFailure))
                 Logger.LogError(freezeResult.Error);
             else

[NoCoverage] Negate expression
Core/Internal/ConsoleMethods.cs:102:21
             {
                 var settingsResult = TryGetSettings();
 
-                if (settingsResult.IsFailure)
+                if (!(settingsResult.IsFailure))
                     Logger.LogError(settingsResult.Error);
                 else

[NoCoverage] Negate expression
Core/Internal/ConsoleMethods.cs:110:25
 
                     var runResult = freezeResult.Value.Run(stateMonad);
 
-                    if (runResult.IsFailure)
+                    if (!(runResult.IsFailure))
                         foreach (var runError in runResult.Error.AllErrors)
                             Logger.LogError(runError.Message);
