[NoCoverage] Logical mutation
Core/Internal/ConstantFreezableStep.cs:73:53
         }
 
         /// <inheritdoc />
-        public override bool Equals(object? obj) => ReferenceEquals(this, obj) || obj is ConstantFreezableStep other && Equals(other);
+        public override bool Equals(object? obj) => ReferenceEquals(this, obj) && obj is ConstantFreezableStep other && Equals(other);
 
         /// <inheritdoc />

[NoCoverage] Logical mutation
Core/Internal/ConstantFreezableStep.cs:73:83
         }
 
         /// <inheritdoc />
-        public override bool Equals(object? obj) => ReferenceEquals(this, obj) || obj is ConstantFreezableStep other && Equals(other);
+        public override bool Equals(object? obj) => ReferenceEquals(this, obj) || obj is ConstantFreezableStep other || Equals(other);
 
         /// <inheritdoc />

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
Core/Internal/ConstantFreezableStep.cs:86:102
         /// <summary>
         /// Not Equals operator
         /// </summary>
-        public static bool operator !=(ConstantFreezableStep? left, ConstantFreezableStep? right) => !Equals(left, right);
+        public static bool operator !=(ConstantFreezableStep? left, ConstantFreezableStep? right) => Equals(left, right);
     }
 }
