[Killed] Linq method mutation (OrderBy() to OrderByDescending())
Core/Internal/DefaultStepNameBuilder.cs:23:42
         /// <inheritdoc />
         public string GetFromArguments(FreezableStepData freezableStepData)
         {
-            var args = string.Join(", ", freezableStepData
-                .Dictionary
-                .OrderBy(x=>x.Key)
-                .Select(x => $"{x.Key}: {x.Value.MemberString}"));
+            var args = string.Join(", ", freezableStepData
+                .Dictionary
+                .OrderByDescending(x=>x.Key)
+                .Select(x => $"{x.Key}: {x.Value.MemberString}"));
 
             return $"{TypeName}({args})";
