[NoCoverage] Equality mutation
Core/Documentation/DocumentationCategory.cs:30:88
         public Type? Anchor { get; }
 
         /// <inheritdoc />
-        public override bool Equals(object? obj) => obj is DocumentationCategory dc && Header == dc.Header && Anchor == dc.Anchor;
+        public override bool Equals(object? obj) => obj is DocumentationCategory dc && Header != dc.Header  && Anchor == dc.Anchor;
 
         /// <inheritdoc />

[NoCoverage] Equality mutation
Core/Documentation/DocumentationCategory.cs:30:111
         public Type? Anchor { get; }
 
         /// <inheritdoc />
-        public override bool Equals(object? obj) => obj is DocumentationCategory dc && Header == dc.Header && Anchor == dc.Anchor;
+        public override bool Equals(object? obj) => obj is DocumentationCategory dc && Header == dc.Header && Anchor != dc.Anchor;
 
         /// <inheritdoc />

[Survived] Arithmetic mutation
Core/Documentation/DocumentationCategory.cs:33:46
         public override bool Equals(object? obj) => obj is DocumentationCategory dc && Header == dc.Header && Anchor == dc.Anchor;
 
         /// <inheritdoc />
-        public override int GetHashCode() => Header.GetHashCode() + Anchor?.GetHashCode() ?? 0;
+        public override int GetHashCode() => Header.GetHashCode() - Anchor?.GetHashCode()  ?? 0;
     }
 }
