[Killed] String mutation
Core/Documentation/DocumentationCreator.cs:36:23
 
             var categories = entities.GroupBy(x => x.DocumentationCategory).ToList();
 
-            lines.Add($"# Contents");
+            lines.Add($"");
 
             var contentsRows = categories.SelectMany(x => x)

[Killed] Equality mutation
Core/Documentation/DocumentationCreator.cs:53:21
 
             foreach (var category in categories)
             {
-                if (category.Key.Anchor != null)
+                if (category.Key.Anchor == null)
                     lines.Add($"<a name=\"{TypeNameHelper.GetHumanReadableTypeName(category.Key.Anchor)}\"></a>");
                 lines.Add($"# {category.Key.Header}");

[Killed] Negate expression
Core/Documentation/DocumentationCreator.cs:53:21
 
             foreach (var category in categories)
             {
-                if (category.Key.Anchor != null)
+                if (!(category.Key.Anchor != null))
                     lines.Add($"<a name=\"{TypeNameHelper.GetHumanReadableTypeName(category.Key.Anchor)}\"></a>");
                 lines.Add($"# {category.Key.Header}");

[Killed] String mutation
Core/Documentation/DocumentationCreator.cs:59:31
 
                 foreach (var doc in category)
                 {
-                    lines.Add($"<a name=\"{doc.Name}\"></a>");
+                    lines.Add($"");
                     lines.Add($"## {doc.Name}");
                     lines.Add("");

[Killed] String mutation
Core/Documentation/DocumentationCreator.cs:61:31
                 {
                     lines.Add($"<a name=\"{doc.Name}\"></a>");
                     lines.Add($"## {doc.Name}");
-                    lines.Add("");
+                    lines.Add("Stryker was here!");
                     if (!string.IsNullOrWhiteSpace(doc.TypeDetails))
                     {

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Core/Documentation/DocumentationCreator.cs:62:25
                     lines.Add($"<a name=\"{doc.Name}\"></a>");
                     lines.Add($"## {doc.Name}");
                     lines.Add("");
-                    if (!string.IsNullOrWhiteSpace(doc.TypeDetails))
+                    if (string.IsNullOrWhiteSpace(doc.TypeDetails))
                     {
                         lines.Add($"**{doc.TypeDetails}**");

[Killed] Negate expression
Core/Documentation/DocumentationCreator.cs:62:25
                     lines.Add($"<a name=\"{doc.Name}\"></a>");
                     lines.Add($"## {doc.Name}");
                     lines.Add("");
-                    if (!string.IsNullOrWhiteSpace(doc.TypeDetails))
+                    if (!(!string.IsNullOrWhiteSpace(doc.TypeDetails)))
                     {
                         lines.Add($"**{doc.TypeDetails}**");

[Killed] String mutation
Core/Documentation/DocumentationCreator.cs:65:35
                     if (!string.IsNullOrWhiteSpace(doc.TypeDetails))
                     {
                         lines.Add($"**{doc.TypeDetails}**");
-                        lines.Add("");
+                        lines.Add("Stryker was here!");
                     }
 

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Core/Documentation/DocumentationCreator.cs:74:25
                         lines.Add("");
                     }
 
-                    if (!string.IsNullOrWhiteSpace(doc.Summary))
+                    if (string.IsNullOrWhiteSpace(doc.Summary))
                     {
                         lines.Add(Escape(doc.Summary));

[Killed] Negate expression
Core/Documentation/DocumentationCreator.cs:74:25
                         lines.Add("");
                     }
 
-                    if (!string.IsNullOrWhiteSpace(doc.Summary))
+                    if (!(!string.IsNullOrWhiteSpace(doc.Summary)))
                     {
                         lines.Add(Escape(doc.Summary));

[Killed] String mutation
Core/Documentation/DocumentationCreator.cs:77:35
                     if (!string.IsNullOrWhiteSpace(doc.Summary))
                     {
                         lines.Add(Escape(doc.Summary));
-                        lines.Add("");
+                        lines.Add("Stryker was here!");
                     }
 

[Killed] Negate expression
Core/Documentation/DocumentationCreator.cs:80:25
                         lines.Add("");
                     }
 
-                    if (doc.Parameters.Any())
+                    if (!(doc.Parameters.Any()))
                     {
                         var extraColumns = doc.Parameters.SelectMany(x => x.ExtraFields.Keys).Distinct().OrderBy(x => x).ToList();

[Survived] Linq method mutation (OrderBy() to OrderByDescending())
Core/Documentation/DocumentationCreator.cs:82:44
 
                     if (doc.Parameters.Any())
                     {
-                        var extraColumns = doc.Parameters.SelectMany(x => x.ExtraFields.Keys).Distinct().OrderBy(x => x).ToList();
+                        var extraColumns = doc.Parameters.SelectMany(x => x.ExtraFields.Keys).Distinct().OrderByDescending(x => x).ToList();
 
                         var headers = new List<string?> { "Parameter", "Type", "Required", "Summary" };

[Killed] String mutation
Core/Documentation/DocumentationCreator.cs:84:80
                     {
                         var extraColumns = doc.Parameters.SelectMany(x => x.ExtraFields.Keys).Distinct().OrderBy(x => x).ToList();
 
-                        var headers = new List<string?> { "Parameter", "Type", "Required", "Summary" };
+                        var headers = new List<string?> { "Parameter", "Type", "", "Summary" };
                         headers.AddRange(extraColumns);
                         var parameterRows = new List<List<string?>> { headers };

[Killed] Collection initializer mutation
Core/Documentation/DocumentationCreator.cs:84:39
                     {
                         var extraColumns = doc.Parameters.SelectMany(x => x.ExtraFields.Keys).Distinct().OrderBy(x => x).ToList();
 
-                        var headers = new List<string?> { "Parameter", "Type", "Required", "Summary" };
+                        var headers = new List<string?> {};
                         headers.AddRange(extraColumns);
                         var parameterRows = new List<List<string?>> { headers };

[Killed] Negate expression
Core/Documentation/DocumentationCreator.cs:97:41
                                     {
                                         rp.Name,
                                         TypeNameHelper.GetMarkupTypeName(rp.Type),
-                                        rp.Required ? "☑️" : "",
+                                        !(                                        rp.Required ) ? "☑️" : "",
                                         rp.Summary
 

[Killed] String mutation
Core/Documentation/DocumentationCreator.cs:97:55
                                     {
                                         rp.Name,
                                         TypeNameHelper.GetMarkupTypeName(rp.Type),
-                                        rp.Required ? "☑️" : "",
+                                        rp.Required ? "" : "",
                                         rp.Summary
 

[NoCoverage] Negate expression
Core/Documentation/DocumentationCreator.cs:103:59
                                     };
                                     foreach (var extraColumn in extraColumns)
                                     {
-                                        var columnValue = rp.ExtraFields.TryGetValue(extraColumn, out var cv) ? cv : null;
+                                        var columnValue = !(rp.ExtraFields.TryGetValue(extraColumn, out var cv) ) ? cv : null;
                                         r.Add(columnValue);
                                     }

[Killed] Negate expression
Core/Documentation/DocumentationCreator.cs:118:17
                 }
             }
 
-            if (enumTypes.Any())
+            if (!(enumTypes.Any()))
             {
                 lines.Add($"# Enums");

[NoCoverage] String mutation
Core/Documentation/DocumentationCreator.cs:120:27
 
             if (enumTypes.Any())
             {
-                lines.Add($"# Enums");
+                lines.Add($"");
 
                 foreach (var type in enumTypes.OrderBy(x => x.Name))

[NoCoverage] Linq method mutation (OrderBy() to OrderByDescending())
Core/Documentation/DocumentationCreator.cs:122:38
             {
                 lines.Add($"# Enums");
 
-                foreach (var type in enumTypes.OrderBy(x => x.Name))
+                foreach (var type in enumTypes.OrderByDescending(x => x.Name))
                 {
                     lines.Add($"<a name=\"{type.Name}\"></a>");

[NoCoverage] String mutation
Core/Documentation/DocumentationCreator.cs:125:31
                 foreach (var type in enumTypes.OrderBy(x => x.Name))
                 {
                     lines.Add($"<a name=\"{type.Name}\"></a>");
-                    lines.Add($"## {type.Name}");
+                    lines.Add($"");
                     var summary = type.GetXmlDocsSummary();
                     if (!string.IsNullOrWhiteSpace(summary))

[NoCoverage] Negate expression
Core/Documentation/DocumentationCreator.cs:127:25
                     lines.Add($"<a name=\"{type.Name}\"></a>");
                     lines.Add($"## {type.Name}");
                     var summary = type.GetXmlDocsSummary();
-                    if (!string.IsNullOrWhiteSpace(summary))
+                    if (!(!string.IsNullOrWhiteSpace(summary)))
                     {
                         lines.Add(Escape(summary));

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
Core/Documentation/DocumentationCreator.cs:127:25
                     lines.Add($"<a name=\"{type.Name}\"></a>");
                     lines.Add($"## {type.Name}");
                     var summary = type.GetXmlDocsSummary();
-                    if (!string.IsNullOrWhiteSpace(summary))
+                    if (string.IsNullOrWhiteSpace(summary))
                     {
                         lines.Add(Escape(summary));

[NoCoverage] String mutation
Core/Documentation/DocumentationCreator.cs:130:35
                     if (!string.IsNullOrWhiteSpace(summary))
                     {
                         lines.Add(Escape(summary));
-                        lines.Add("");
+                        lines.Add("Stryker was here!");
                     }
 

[NoCoverage] String mutation
Core/Documentation/DocumentationCreator.cs:133:79
                         lines.Add("");
                     }
 
-                    var parameterRows = new List<string?[]> { new[] { "Name", "Summary" } };
+                    var parameterRows = new List<string?[]> { new[] { "Name", "" } };
                     parameterRows.AddRange(
                         type.GetFields(BindingFlags.Public | BindingFlags.Static)

[NoCoverage] String mutation
Core/Documentation/DocumentationCreator.cs:133:71
                         lines.Add("");
                     }
 
-                    var parameterRows = new List<string?[]> { new[] { "Name", "Summary" } };
+                    var parameterRows = new List<string?[]> { new[] { "", "Summary" } };
                     parameterRows.AddRange(
                         type.GetFields(BindingFlags.Public | BindingFlags.Static)

[NoCoverage] Bitwise mutation
Core/Documentation/DocumentationCreator.cs:135:40
 
                     var parameterRows = new List<string?[]> { new[] { "Name", "Summary" } };
                     parameterRows.AddRange(
-                        type.GetFields(BindingFlags.Public | BindingFlags.Static)
+                        type.GetFields(BindingFlags.Public & BindingFlags.Static)
                             .Select(fieldInfo => new[] { fieldInfo.Name, fieldInfo.GetXmlDocsSummary() }));
 

[Survived] String mutation
Core/Documentation/DocumentationCreator.cs:153:36
                 return (s ?? string.Empty)
                     .Replace("|", @"\|")
                     .Replace("\r\n", " ")
-                    .Replace("\n", " ");
+                    .Replace("\n", "");
             }
         }
