[Killed] Linq method mutation (Max() to Min())
Core/Documentation/Prettifier.cs:18:26
 
             var columnWidthDictionary = data.GroupBy(x => x.columnNumber)
                 .ToDictionary(x => x.Key,
-                    x => x.Max(c => c.text.EnumerateRunes().Count()));
+                    x => x.Min(c => c.text.EnumerateRunes().Count()));
 
 

[Survived] Linq method mutation (OrderBy() to OrderByDescending())
Core/Documentation/Prettifier.cs:22:17
 
 
             foreach (var grouping in
-                data.GroupBy(d => d.rowNumber).OrderBy(x => x.Key))
+                                data.GroupBy(d => d.rowNumber).OrderByDescending(x => x.Key))
             {
                 var terms = new List<string>();

[Killed] Linq method mutation (OrderBy() to OrderByDescending())
Core/Documentation/Prettifier.cs:26:57
             {
                 var terms = new List<string>();
                 var i = 0;
-                foreach (var (_, columnNumber, text) in grouping.OrderBy(r => r.columnNumber))
+                foreach (var (_, columnNumber, text) in grouping.OrderByDescending(r => r.columnNumber))
                 {
                     while (i < columnNumber)

[Killed] Negate expression
Core/Documentation/Prettifier.cs:28:28
                 var i = 0;
                 foreach (var (_, columnNumber, text) in grouping.OrderBy(r => r.columnNumber))
                 {
-                    while (i < columnNumber)
+                    while (!(i < columnNumber))
                     {
                         terms.Add(new string(' ', columnWidthDictionary[i]));

[Killed] Equality mutation
Core/Documentation/Prettifier.cs:28:28
                 var i = 0;
                 foreach (var (_, columnNumber, text) in grouping.OrderBy(r => r.columnNumber))
                 {
-                    while (i < columnNumber)
+                    while (i <= columnNumber)
                     {
                         terms.Add(new string(' ', columnWidthDictionary[i]));

[NoCoverage] PostIncrementExpression to PostDecrementExpression mutation
Core/Documentation/Prettifier.cs:31:25
                     while (i < columnNumber)
                     {
                         terms.Add(new string(' ', columnWidthDictionary[i]));
-                        i++;
+                                                i--;
                     }
 

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Core/Documentation/Prettifier.cs:35:21
                     }
 
                     terms.Add(text.PadRight(columnWidthDictionary[columnNumber]));
-                    i++;
+                                        i--;
                 }
 

[Killed] Equality mutation
Core/Documentation/Prettifier.cs:47:21
                 var s = $"|{string.Join('|', terms)}|";
                 yield return s;
 
-                if (grouping.Key == 0) //create dashes row
+                if (grouping.Key != 0) //create dashes row
                 {
                     yield return @$"|{

[Killed] Negate expression
Core/Documentation/Prettifier.cs:47:21
                 var s = $"|{string.Join('|', terms)}|";
                 yield return s;
 
-                if (grouping.Key == 0) //create dashes row
+                if (!(grouping.Key == 0)) //create dashes row
                 {
                     yield return @$"|{

[Killed] String mutation
Core/Documentation/Prettifier.cs:49:34
 
                 if (grouping.Key == 0) //create dashes row
                 {
-                    yield return @$"|{
-                            string.Join('|', columnWidthDictionary
-                                .OrderBy(x => x.Key)
-                                .Select(x => ":" + new string('-', Math.Max(x.Value - 2, 1)) + ":"))
-                        }|";
+                    yield return $"";
                 }
             }

[Killed] Linq method mutation (OrderBy() to OrderByDescending())
Core/Documentation/Prettifier.cs:50:46
                 if (grouping.Key == 0) //create dashes row
                 {
                     yield return @$"|{
-                            string.Join('|', columnWidthDictionary
-                                .OrderBy(x => x.Key)
-                                .Select(x => ":" + new string('-', Math.Max(x.Value - 2, 1)) + ":"))
+                            string.Join('|', columnWidthDictionary
+                                .OrderByDescending(x => x.Key)
+                                .Select(x => ":" + new string('-', Math.Max(x.Value - 2, 1)) + ":"))
                         }|";
                 }

[Killed] Linq method mutation (Max() to Min())
Core/Documentation/Prettifier.cs:52:68
                     yield return @$"|{
                             string.Join('|', columnWidthDictionary
                                 .OrderBy(x => x.Key)
-                                .Select(x => ":" + new string('-', Math.Max(x.Value - 2, 1)) + ":"))
+                                .Select(x => ":" + new string('-', Math.Min(x.Value - 2, 1)) + ":"))
                         }|";
                 }

[Killed] Arithmetic mutation
Core/Documentation/Prettifier.cs:52:77
                     yield return @$"|{
                             string.Join('|', columnWidthDictionary
                                 .OrderBy(x => x.Key)
-                                .Select(x => ":" + new string('-', Math.Max(x.Value - 2, 1)) + ":"))
+                                .Select(x => ":" + new string('-', Math.Max(x.Value + 2, 1)) + ":"))
                         }|";
                 }

[NoCoverage] String mutation
Core/Documentation/Prettifier.cs:59:30
 
             static string Escape(string? s)
             {
-                return (s ?? string.Empty)
+                return (s ?? "Stryker was here!")
                     .Replace(@"\", @"\\")
                     .Replace(@"*", @"\*")

[Killed] String mutation
Core/Documentation/Prettifier.cs:61:30
             {
                 return (s ?? string.Empty)
                     .Replace(@"\", @"\\")
-                    .Replace(@"*", @"\*")
+                    .Replace("", @"\*")
                     .Replace("|", @"\|")
                     .Replace("\r\n", "<br>")

[Killed] String mutation
Core/Documentation/Prettifier.cs:64:30
                     .Replace(@"*", @"\*")
                     .Replace("|", @"\|")
                     .Replace("\r\n", "<br>")
-                    .Replace("\n", " ");
+                    .Replace("", " ");
             }
         }

[NoCoverage] String mutation
Core/Documentation/Prettifier.cs:72:50
         {
             var data = rows.SelectMany((row, rowNumber) =>
                 row.SelectMany((text, columnNumber) =>
-                    (text ?? string.Empty).Split("\n")
+                    (text ?? string.Empty).Split("")
                     .Select((line, lineNumber) => (rowNumber, lineNumber, columnNumber, line))
                 )).ToList();

[NoCoverage] Linq method mutation (Max() to Min())
Core/Documentation/Prettifier.cs:77:48
                 )).ToList();
 
             var columnWidthDictionary = data.GroupBy(x => x.columnNumber)
-                .ToDictionary(x => x.Key, x => x.Max(y => y.line.EnumerateRunes().Count()));
+                .ToDictionary(x => x.Key, x => x.Min(y => y.line.EnumerateRunes().Count()));
 
 

[NoCoverage] Linq method mutation (OrderBy() to OrderByDescending())
Core/Documentation/Prettifier.cs:81:17
 
 
             foreach (var grouping in
-                data.GroupBy(d => (d.rowNumber, d.lineNumber))
-
-                    .OrderBy(x => x.Key.rowNumber)
-                    .ThenBy(x => x.Key.lineNumber)
+                                data.GroupBy(d => (d.rowNumber, d.lineNumber))
+
+                    .OrderByDescending(x => x.Key.rowNumber)
+                    .ThenBy(x => x.Key.lineNumber)
+
                 )
             {

[NoCoverage] Linq method mutation (ThenBy() to ThenByDescending())
Core/Documentation/Prettifier.cs:81:17
 
 
             foreach (var grouping in
-                data.GroupBy(d => (d.rowNumber, d.lineNumber))
-
-                    .OrderBy(x => x.Key.rowNumber)
-                    .ThenBy(x => x.Key.lineNumber)
+                                data.GroupBy(d => (d.rowNumber, d.lineNumber))
+
+                    .OrderBy(x => x.Key.rowNumber)
+                    .ThenByDescending(x => x.Key.lineNumber)
+
                 )
             {

[NoCoverage] Linq method mutation (OrderBy() to OrderByDescending())
Core/Documentation/Prettifier.cs:90:60
 
                 var terms = new List<string>();
                 var i = 0;
-                foreach (var (_, _, columnNumber, line) in grouping.OrderBy(r => r.columnNumber))
+                foreach (var (_, _, columnNumber, line) in grouping.OrderByDescending(r => r.columnNumber))
                 {
                     while (i < columnNumber)

[NoCoverage] Equality mutation
Core/Documentation/Prettifier.cs:92:28
                 var i = 0;
                 foreach (var (_, _, columnNumber, line) in grouping.OrderBy(r => r.columnNumber))
                 {
-                    while (i < columnNumber)
+                    while (i > columnNumber)
                     {
                         terms.Add(new string(' ', columnWidthDictionary[i]));

[NoCoverage] PostIncrementExpression to PostDecrementExpression mutation
Core/Documentation/Prettifier.cs:99:21
                     }
 
                     terms.Add(line.PadRight(columnWidthDictionary[columnNumber]));
-                    i++;
+                                        i--;
                 }
 
