[Survived] Linq method mutation (OrderBy() to OrderByDescending())
Core/Documentation/StepWrapper.cs:23:34
             Factory = factory;
             DocumentationCategory = category;
 
-            RelevantProperties = factory.StepType.GetProperties()
-                .Select(property=> (property, attribute: property.GetCustomAttribute<StepPropertyBaseAttribute>()))
-                .Where(x=>x.attribute != null)
-                // ReSharper disable once ConstantConditionalAccessQualifier
-                .OrderBy(x=>x.attribute!.Order)
-                .ThenBy(x=>x.property.Name)
-
-                .Select(x=>x.property).ToList();
+            RelevantProperties = factory.StepType.GetProperties()
+                .Select(property=> (property, attribute: property.GetCustomAttribute<StepPropertyBaseAttribute>()))
+                .Where(x=>x.attribute != null)
+                // ReSharper disable once ConstantConditionalAccessQualifier
+                .OrderByDescending(x=>x.attribute!.Order)
+                .ThenBy(x=>x.property.Name)
+
+                .Select(x=>x.property).ToList();
 
 

[Survived] Linq method mutation (ThenBy() to ThenByDescending())
Core/Documentation/StepWrapper.cs:23:34
             Factory = factory;
             DocumentationCategory = category;
 
-            RelevantProperties = factory.StepType.GetProperties()
-                .Select(property=> (property, attribute: property.GetCustomAttribute<StepPropertyBaseAttribute>()))
-                .Where(x=>x.attribute != null)
-                // ReSharper disable once ConstantConditionalAccessQualifier
-                .OrderBy(x=>x.attribute!.Order)
-                .ThenBy(x=>x.property.Name)
-
-                .Select(x=>x.property).ToList();
+            RelevantProperties = factory.StepType.GetProperties()
+                .Select(property=> (property, attribute: property.GetCustomAttribute<StepPropertyBaseAttribute>()))
+                .Where(x=>x.attribute != null)
+                // ReSharper disable once ConstantConditionalAccessQualifier
+                .OrderBy(x=>x.attribute!.Order)
+                .ThenByDescending(x=>x.property.Name)
+
+                .Select(x=>x.property).ToList();
 
 

[Killed] Equality mutation
Core/Documentation/StepWrapper.cs:25:27
 
             RelevantProperties = factory.StepType.GetProperties()
                 .Select(property=> (property, attribute: property.GetCustomAttribute<StepPropertyBaseAttribute>()))
-                .Where(x=>x.attribute != null)
+                .Where(x=>x.attribute == null)
                 // ReSharper disable once ConstantConditionalAccessQualifier
                 .OrderBy(x=>x.attribute!.Order)

[Killed] Equality mutation
Core/Documentation/StepWrapper.cs:87:92
             public PropertyWrapper(PropertyInfo propertyInfo, string? defaultValueString)
             {
                 _propertyInfo = propertyInfo;
-                Required = _propertyInfo.GetCustomAttributes<RequiredAttribute>().Any() && defaultValueString == null;
+                Required = _propertyInfo.GetCustomAttributes<RequiredAttribute>().Any() && defaultValueString != null;
 
                 var explanation = propertyInfo.GetCustomAttribute<DefaultValueExplanationAttribute>()?.Explanation;

[Survived] Logical mutation
Core/Documentation/StepWrapper.cs:87:28
             public PropertyWrapper(PropertyInfo propertyInfo, string? defaultValueString)
             {
                 _propertyInfo = propertyInfo;
-                Required = _propertyInfo.GetCustomAttributes<RequiredAttribute>().Any() && defaultValueString == null;
+                Required = _propertyInfo.GetCustomAttributes<RequiredAttribute>().Any() || defaultValueString == null;
 
                 var explanation = propertyInfo.GetCustomAttribute<DefaultValueExplanationAttribute>()?.Explanation;

[Survived] Negate expression
Core/Documentation/StepWrapper.cs:94:27
                 var extraFields = new Dictionary<string, string>();
 
 
-                var dvs = explanation == null ? defaultValueString : $"{explanation}"; //TODO make italic somehow
+                var dvs = !(explanation == null ) ? defaultValueString : $"{explanation}"; //TODO make italic somehow
 
                 if(!string.IsNullOrWhiteSpace(dvs))

[Survived] Equality mutation
Core/Documentation/StepWrapper.cs:94:27
                 var extraFields = new Dictionary<string, string>();
 
 
-                var dvs = explanation == null ? defaultValueString : $"{explanation}"; //TODO make italic somehow
+                var dvs = explanation != null  ? defaultValueString : $"{explanation}"; //TODO make italic somehow
 
                 if(!string.IsNullOrWhiteSpace(dvs))

[Killed] Negate expression
Core/Documentation/StepWrapper.cs:96:20
 
                 var dvs = explanation == null ? defaultValueString : $"{explanation}"; //TODO make italic somehow
 
-                if(!string.IsNullOrWhiteSpace(dvs))
+                if(!(!string.IsNullOrWhiteSpace(dvs)))
                     extraFields.Add("Default Value", dvs);
 

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Core/Documentation/StepWrapper.cs:96:20
 
                 var dvs = explanation == null ? defaultValueString : $"{explanation}"; //TODO make italic somehow
 
-                if(!string.IsNullOrWhiteSpace(dvs))
+                if(string.IsNullOrWhiteSpace(dvs))
                     extraFields.Add("Default Value", dvs);
 

[NoCoverage] Logical mutation
Core/Documentation/StepWrapper.cs:103:25
                 {
                     var equalsIndex = x.Example.IndexOf('=');
 
-                    if (equalsIndex >= 0 && equalsIndex != x.Example.Length)
+                    if (equalsIndex >= 0 || equalsIndex != x.Example.Length)
                     {
                         var angleIndex = x.Example.IndexOf('<');

[NoCoverage] Equality mutation
Core/Documentation/StepWrapper.cs:103:45
                 {
                     var equalsIndex = x.Example.IndexOf('=');
 
-                    if (equalsIndex >= 0 && equalsIndex != x.Example.Length)
+                    if (equalsIndex >= 0 && equalsIndex == x.Example.Length)
                     {
                         var angleIndex = x.Example.IndexOf('<');

[NoCoverage] Equality mutation
Core/Documentation/StepWrapper.cs:106:29
                     if (equalsIndex >= 0 && equalsIndex != x.Example.Length)
                     {
                         var angleIndex = x.Example.IndexOf('<');
-                        if (angleIndex < 0 || angleIndex >= equalsIndex)
+                        if (angleIndex <= 0  || angleIndex >= equalsIndex)
                             return x.Example.Substring(equalsIndex + 1);
                     }

[NoCoverage] Logical mutation
Core/Documentation/StepWrapper.cs:106:29
                     if (equalsIndex >= 0 && equalsIndex != x.Example.Length)
                     {
                         var angleIndex = x.Example.IndexOf('<');
-                        if (angleIndex < 0 || angleIndex >= equalsIndex)
+                        if (angleIndex < 0 && angleIndex >= equalsIndex)
                             return x.Example.Substring(equalsIndex + 1);
                     }

[NoCoverage] Arithmetic mutation
Core/Documentation/StepWrapper.cs:107:56
                     {
                         var angleIndex = x.Example.IndexOf('<');
                         if (angleIndex < 0 || angleIndex >= equalsIndex)
-                            return x.Example.Substring(equalsIndex + 1);
+                            return x.Example.Substring(equalsIndex - 1);
                     }
 

[Killed] Negate expression
Core/Documentation/StepWrapper.cs:122:24
 
                 ExtraFields = extraFields;
 
-                Type = _propertyInfo.PropertyType.IsGenericType?
+                Type = !(_propertyInfo.PropertyType.IsGenericType)?
                     _propertyInfo.PropertyType.GetGenericArguments()[0] : _propertyInfo.PropertyType;
             }

[Killed] Negate expression
Core/Documentation/StepWrapper.cs:132:21
             {
                 var s = string.Join("\r\n", propertyInfo.GetCustomAttributes<T>().Select(getAttributeText));
 
-                if (!string.IsNullOrWhiteSpace(s))
+                if (!(!string.IsNullOrWhiteSpace(s)))
                 {
                     dictionary.Add(name, s);

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Core/Documentation/StepWrapper.cs:132:21
             {
                 var s = string.Join("\r\n", propertyInfo.GetCustomAttributes<T>().Select(getAttributeText));
 
-                if (!string.IsNullOrWhiteSpace(s))
+                if (string.IsNullOrWhiteSpace(s))
                 {
                     dictionary.Add(name, s);
