[Killed] Negate expression
Core/Documentation/TypeNameHelper.cs:12:17
 
         public static string GetMarkupTypeName(Type t)
         {
-            if (TypeAliases.TryGetValue(t, out var name))
+            if (!(TypeAliases.TryGetValue(t, out var name)))
                 return $"`{name}`";
 

[NoCoverage] Negate expression
Core/Documentation/TypeNameHelper.cs:15:17
             if (TypeAliases.TryGetValue(t, out var name))
                 return $"`{name}`";
 
-            if (t.IsEnum)
+            if (!(t.IsEnum))
                 return $"[{t.Name}](#{t.Name})";
 

[NoCoverage] Negate expression
Core/Documentation/TypeNameHelper.cs:18:17
             if (t.IsEnum)
                 return $"[{t.Name}](#{t.Name})";
 
-            if (!t.IsGenericType)
+            if (!(!t.IsGenericType))
                 return $"[{t.Name}](#{t.Name})";
 

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
Core/Documentation/TypeNameHelper.cs:18:17
             if (t.IsEnum)
                 return $"[{t.Name}](#{t.Name})";
 
-            if (!t.IsGenericType)
+            if (t.IsGenericType)
                 return $"[{t.Name}](#{t.Name})";
 

[NoCoverage] Equality mutation
Core/Documentation/TypeNameHelper.cs:21:17
             if (!t.IsGenericType)
                 return $"[{t.Name}](#{t.Name})";
 
-            if (t.GetGenericTypeDefinition() == typeof(Nullable<>))
+            if (t.GetGenericTypeDefinition() != typeof(Nullable<>))
             {
                 var underlyingType = Nullable.GetUnderlyingType(t);

[NoCoverage] Negate expression
Core/Documentation/TypeNameHelper.cs:21:17
             if (!t.IsGenericType)
                 return $"[{t.Name}](#{t.Name})";
 
-            if (t.GetGenericTypeDefinition() == typeof(Nullable<>))
+            if (!(t.GetGenericTypeDefinition() == typeof(Nullable<>)))
             {
                 var underlyingType = Nullable.GetUnderlyingType(t);

[NoCoverage] Equality mutation
Core/Documentation/TypeNameHelper.cs:24:21
             if (t.GetGenericTypeDefinition() == typeof(Nullable<>))
             {
                 var underlyingType = Nullable.GetUnderlyingType(t);
-                if (underlyingType == null) return t.Name;
+                if (underlyingType != null) return t.Name;
                 return GetMarkupTypeName(underlyingType) + "?";
             }

[NoCoverage] Negate expression
Core/Documentation/TypeNameHelper.cs:24:21
             if (t.GetGenericTypeDefinition() == typeof(Nullable<>))
             {
                 var underlyingType = Nullable.GetUnderlyingType(t);
-                if (underlyingType == null) return t.Name;
+                if (!(underlyingType == null)) return t.Name;
                 return GetMarkupTypeName(underlyingType) + "?";
             }

[NoCoverage] String mutation
Core/Documentation/TypeNameHelper.cs:30:45
 
             var typeName = t.Name.Split("`")[0];
 
-            var arguments = $"<{string.Join(",", t.GetGenericArguments().Select(GetMarkupTypeName))}>";
+            var arguments = $"<{string.Join("", t.GetGenericArguments().Select(GetMarkupTypeName))}>";
 
             return typeName + arguments;

[NoCoverage] String mutation
Core/Documentation/TypeNameHelper.cs:50:41
                 return GetHumanReadableTypeName(underlyingType) + "?";
             }
 
-            var typeName = t.Name.Split("`")[0];
+            var typeName = t.Name.Split("")[0];
 
             var arguments = $"<{string.Join(",", t.GetGenericArguments().Select(GetHumanReadableTypeName))}>";

[NoCoverage] String mutation
Core/Documentation/TypeNameHelper.cs:52:45
 
             var typeName = t.Name.Split("`")[0];
 
-            var arguments = $"<{string.Join(",", t.GetGenericArguments().Select(GetHumanReadableTypeName))}>";
+            var arguments = $"<{string.Join("", t.GetGenericArguments().Select(GetHumanReadableTypeName))}>";
 
             return typeName + arguments;

[Survived] String mutation
Core/Documentation/TypeNameHelper.cs:61:34
             new Dictionary<Type, string>()
             {
                 { typeof(byte), "byte" },
-                { typeof(sbyte), "sbyte" },
+                { typeof(sbyte), "" },
                 { typeof(short), "short" },
                 { typeof(ushort), "ushort" },

[Survived] String mutation
Core/Documentation/TypeNameHelper.cs:64:32
                 { typeof(sbyte), "sbyte" },
                 { typeof(short), "short" },
                 { typeof(ushort), "ushort" },
-                { typeof(int), "int" },
+                { typeof(int), "" },
                 { typeof(uint), "uint" },
                 { typeof(long), "long" },

[Survived] String mutation
Core/Documentation/TypeNameHelper.cs:68:34
                 { typeof(uint), "uint" },
                 { typeof(long), "long" },
                 { typeof(ulong), "ulong" },
-                { typeof(float), "float" },
+                { typeof(float), "" },
                 { typeof(double), "double" },
                 { typeof(decimal), "decimal" },

[Killed] String mutation
Core/Documentation/TypeNameHelper.cs:72:33
                 { typeof(double), "double" },
                 { typeof(decimal), "decimal" },
                 { typeof(object), "object" },
-                { typeof(bool), "bool" },
+                { typeof(bool), "" },
                 { typeof(char), "char" },
                 { typeof(string), "string" },

[Survived] String mutation
Core/Documentation/TypeNameHelper.cs:73:33
                 { typeof(decimal), "decimal" },
                 { typeof(object), "object" },
                 { typeof(bool), "bool" },
-                { typeof(char), "char" },
+                { typeof(char), "" },
                 { typeof(string), "string" },
                 { typeof(void), "void" }

[Survived] String mutation
Core/Documentation/TypeNameHelper.cs:74:35
                 { typeof(object), "object" },
                 { typeof(bool), "bool" },
                 { typeof(char), "char" },
-                { typeof(string), "string" },
+                { typeof(string), "" },
                 { typeof(void), "void" }
             };
