[NoCoverage] String mutation
Core/Internal/ErrorHelper.cs:12:29
         /// The error that should be returned when a parameter is missing.
         /// </summary>
         public static IRunErrors MissingParameterError(string parameterName, string stepName)
-            => new RunError($"Missing Parameter '{parameterName}'", stepName, null , ErrorCode.MissingParameter);
+            => new RunError($"", stepName, null , ErrorCode.MissingParameter);
     }
 }
