[NoCoverage] Equality mutation
Core/Internal/FreezableStepData.cs:48:51
         {
             return new
             {
-                Variables = Dictionary.Count(x => x.Value.MemberType == MemberType.VariableName),
+                Variables = Dictionary.Count(x => x.Value.MemberType != MemberType.VariableName),
                 Steps = Dictionary.Count(x => x.Value.MemberType == MemberType.Step),
                 StepLists = Dictionary.Count(x => x.Value.MemberType == MemberType.StepList)

[NoCoverage] Equality mutation
Core/Internal/FreezableStepData.cs:49:47
             return new
             {
                 Variables = Dictionary.Count(x => x.Value.MemberType == MemberType.VariableName),
-                Steps = Dictionary.Count(x => x.Value.MemberType == MemberType.Step),
+                Steps = Dictionary.Count(x => x.Value.MemberType != MemberType.Step),
                 StepLists = Dictionary.Count(x => x.Value.MemberType == MemberType.StepList)
             }.ToString()!;

[NoCoverage] Equality mutation
Core/Internal/FreezableStepData.cs:50:51
             {
                 Variables = Dictionary.Count(x => x.Value.MemberType == MemberType.VariableName),
                 Steps = Dictionary.Count(x => x.Value.MemberType == MemberType.Step),
-                StepLists = Dictionary.Count(x => x.Value.MemberType == MemberType.StepList)
+                StepLists = Dictionary.Count(x => x.Value.MemberType != MemberType.StepList)
             }.ToString()!;
         }

[Killed] Equality mutation
Core/Internal/FreezableStepData.cs:62:17
             return DictionariesEqual(Dictionary, other.Dictionary);
 
             static bool DictionariesEqual(IReadOnlyDictionary<string, StepMember> dict1, IReadOnlyDictionary<string, StepMember> dict2) =>
-                dict1.Count == dict2.Count &&
+                                dict1.Count != dict2.Count  &&
                 dict1.Keys.All(key => dict2.ContainsKey(key) && dict1[key].Equals(dict2[key]));
         }

[Survived] Logical mutation
Core/Internal/FreezableStepData.cs:62:17
             return DictionariesEqual(Dictionary, other.Dictionary);
 
             static bool DictionariesEqual(IReadOnlyDictionary<string, StepMember> dict1, IReadOnlyDictionary<string, StepMember> dict2) =>
-                dict1.Count == dict2.Count &&
-                dict1.Keys.All(key => dict2.ContainsKey(key) && dict1[key].Equals(dict2[key]));
+                                dict1.Count == dict2.Count ||
+                dict1.Keys.All(key => dict2.ContainsKey(key) && dict1[key].Equals(dict2[key]));
         }
 

[Survived] Linq method mutation (All() to Any())
Core/Internal/FreezableStepData.cs:63:17
 
             static bool DictionariesEqual(IReadOnlyDictionary<string, StepMember> dict1, IReadOnlyDictionary<string, StepMember> dict2) =>
                 dict1.Count == dict2.Count &&
-                dict1.Keys.All(key => dict2.ContainsKey(key) && dict1[key].Equals(dict2[key]));
+                                dict1.Keys.Any(key => dict2.ContainsKey(key) && dict1[key].Equals(dict2[key]));
         }
 

[Survived] Logical mutation
Core/Internal/FreezableStepData.cs:63:39
 
             static bool DictionariesEqual(IReadOnlyDictionary<string, StepMember> dict1, IReadOnlyDictionary<string, StepMember> dict2) =>
                 dict1.Count == dict2.Count &&
-                dict1.Keys.All(key => dict2.ContainsKey(key) && dict1[key].Equals(dict2[key]));
+                dict1.Keys.All(key => dict2.ContainsKey(key) || dict1[key].Equals(dict2[key]));
         }
 

[NoCoverage] Logical mutation
Core/Internal/FreezableStepData.cs:67:83
         }
 
         /// <inheritdoc />
-        public override bool Equals(object? obj) => ReferenceEquals(this, obj) || obj is FreezableStepData other && Equals(this, other);
+        public override bool Equals(object? obj) => ReferenceEquals(this, obj) || obj is FreezableStepData other || Equals(this, other);
 
         /// <inheritdoc />

[NoCoverage] Logical mutation
Core/Internal/FreezableStepData.cs:67:53
         }
 
         /// <inheritdoc />
-        public override bool Equals(object? obj) => ReferenceEquals(this, obj) || obj is FreezableStepData other && Equals(this, other);
+        public override bool Equals(object? obj) => ReferenceEquals(this, obj) && obj is FreezableStepData other && Equals(this, other);
 
         /// <inheritdoc />

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
Core/Internal/FreezableStepData.cs:80:94
         /// <summary>
         /// Not Equals Operator
         /// </summary>
-        public static bool operator !=(FreezableStepData? left, FreezableStepData? right) => !Equals(left, right);
+        public static bool operator !=(FreezableStepData? left, FreezableStepData? right) => Equals(left, right);
     }
 }
