[NoCoverage] Equality mutation
Core/Internal/GenericTypeReference.cs:48:57
             if (other is null) return false;
             if (ReferenceEquals(this, other)) return true;
 
-            return other is GenericTypeReference gtr && GenericType == gtr.GenericType &&
+            return other is GenericTypeReference gtr && GenericType != gtr.GenericType  &&
                    ChildTypes.SequenceEqual(gtr.ChildTypes);
         }
