[Survived] Linq method mutation (Single() to SingleOrDefault())
Core/Internal/MultipleTypeReference.cs:27:43
                     return new ActualTypeReference(typeof(object)); //TODO type reference any???
                     //return Result.Failure<ITypeReference>($"Could not infer type for {parentStep} as it has no children.");
                 case 1:
-                    return Result.Success(set.Single());
+                    return Result.Success(set.SingleOrDefault());
                 default:
                 {

[NoCoverage] Negate expression
Core/Internal/MultipleTypeReference.cs:30:25
                     return Result.Success(set.Single());
                 default:
                 {
-                    if (set.OfType<ActualTypeReference>().Count() > 1)
+                    if (!(set.OfType<ActualTypeReference>().Count() > 1))
                         return Result.Failure<ITypeReference>(
                             $"Could not infer type for {parentStep} as it's children have different types ({string.Join(", ", set.OfType<ActualTypeReference>().Select(x=>x.Type.Name))}).");

[NoCoverage] Equality mutation
Core/Internal/MultipleTypeReference.cs:30:25
                     return Result.Success(set.Single());
                 default:
                 {
-                    if (set.OfType<ActualTypeReference>().Count() > 1)
+                    if (set.OfType<ActualTypeReference>().Count() < 1)
                         return Result.Failure<ITypeReference>(
                             $"Could not infer type for {parentStep} as it's children have different types ({string.Join(", ", set.OfType<ActualTypeReference>().Select(x=>x.Type.Name))}).");

[NoCoverage] String mutation
Core/Internal/MultipleTypeReference.cs:32:121
                 {
                     if (set.OfType<ActualTypeReference>().Count() > 1)
                         return Result.Failure<ITypeReference>(
-                            $"Could not infer type for {parentStep} as it's children have different types ({string.Join(", ", set.OfType<ActualTypeReference>().Select(x=>x.Type.Name))}).");
+                            $"Could not infer type for {parentStep} as it's children have different types ({string.Join("", set.OfType<ActualTypeReference>().Select(x=>x.Type.Name))}).");
                     return new MultipleTypeReference(set);
                 }

[NoCoverage] Equality mutation
Core/Internal/MultipleTypeReference.cs:60:51
 
             return other switch
             {
-                ActualTypeReference actualType => AllReferences.Count == 1 && AllReferences.Contains(actualType),
+                ActualTypeReference actualType => AllReferences.Count != 1  && AllReferences.Contains(actualType),
                 MultipleTypeReference multipleTypeReference => AllReferences.SetEquals(multipleTypeReference
                     .AllReferences),

[NoCoverage] Logical mutation
Core/Internal/MultipleTypeReference.cs:60:51
 
             return other switch
             {
-                ActualTypeReference actualType => AllReferences.Count == 1 && AllReferences.Contains(actualType),
+                ActualTypeReference actualType => AllReferences.Count == 1 || AllReferences.Contains(actualType),
                 MultipleTypeReference multipleTypeReference => AllReferences.SetEquals(multipleTypeReference
                     .AllReferences),

[NoCoverage] Equality mutation
Core/Internal/MultipleTypeReference.cs:63:64
                 ActualTypeReference actualType => AllReferences.Count == 1 && AllReferences.Contains(actualType),
                 MultipleTypeReference multipleTypeReference => AllReferences.SetEquals(multipleTypeReference
                     .AllReferences),
-                VariableTypeReference variableTypeReference => AllReferences.Count == 1 && AllReferences.Contains(variableTypeReference),
+                VariableTypeReference variableTypeReference => AllReferences.Count != 1  && AllReferences.Contains(variableTypeReference),
                 GenericTypeReference genericTypeReference => AllReferences.Count == 1 && AllReferences.Contains(genericTypeReference),
                 _ => throw new ArgumentOutOfRangeException(nameof(other))

[NoCoverage] Logical mutation
Core/Internal/MultipleTypeReference.cs:63:64
                 ActualTypeReference actualType => AllReferences.Count == 1 && AllReferences.Contains(actualType),
                 MultipleTypeReference multipleTypeReference => AllReferences.SetEquals(multipleTypeReference
                     .AllReferences),
-                VariableTypeReference variableTypeReference => AllReferences.Count == 1 && AllReferences.Contains(variableTypeReference),
+                VariableTypeReference variableTypeReference => AllReferences.Count == 1 || AllReferences.Contains(variableTypeReference),
                 GenericTypeReference genericTypeReference => AllReferences.Count == 1 && AllReferences.Contains(genericTypeReference),
                 _ => throw new ArgumentOutOfRangeException(nameof(other))

[NoCoverage] Equality mutation
Core/Internal/MultipleTypeReference.cs:64:62
                 MultipleTypeReference multipleTypeReference => AllReferences.SetEquals(multipleTypeReference
                     .AllReferences),
                 VariableTypeReference variableTypeReference => AllReferences.Count == 1 && AllReferences.Contains(variableTypeReference),
-                GenericTypeReference genericTypeReference => AllReferences.Count == 1 && AllReferences.Contains(genericTypeReference),
+                GenericTypeReference genericTypeReference => AllReferences.Count != 1  && AllReferences.Contains(genericTypeReference),
                 _ => throw new ArgumentOutOfRangeException(nameof(other))
             };

[NoCoverage] Logical mutation
Core/Internal/MultipleTypeReference.cs:64:62
                 MultipleTypeReference multipleTypeReference => AllReferences.SetEquals(multipleTypeReference
                     .AllReferences),
                 VariableTypeReference variableTypeReference => AllReferences.Count == 1 && AllReferences.Contains(variableTypeReference),
-                GenericTypeReference genericTypeReference => AllReferences.Count == 1 && AllReferences.Contains(genericTypeReference),
+                GenericTypeReference genericTypeReference => AllReferences.Count == 1 || AllReferences.Contains(genericTypeReference),
                 _ => throw new ArgumentOutOfRangeException(nameof(other))
             };

[NoCoverage] Linq method mutation (FirstOrDefault() to First())
Core/Internal/MultipleTypeReference.cs:73:46
         public override bool Equals(object? obj) => ReferenceEquals(this, obj) || obj is ITypeReference other && Equals(other);
 
         /// <inheritdoc />
-        public override int GetHashCode() => AllReferences.FirstOrDefault().GetHashCode();
+        public override int GetHashCode() => AllReferences.First().GetHashCode();
 
         /// <inheritdoc />
