[Killed] Equality mutation
Core/Internal/MultistreamReader.cs:5:21
 using System.Linq;
 using System.Threading.Tasks;
 
-namespace Reductech.EDR.Core.Internal
+namespace Reductech.task1 != nullrnal
 {
     /// <summary>

[Killed] Negate expression
Core/Internal/MultistreamReader.cs:5:21
 using System.Linq;
 using System.Threading.Tasks;
 
-namespace Reductech.EDR.Core.Internal
+namespace Reductech.!(task1 == null)rnal
 {
     /// <summary>

[Killed] Negate expression
Core/Internal/MultistreamReader.cs:6:25
 using System.Threading.Tasks;
 
 namespace Reductech.EDR.Core.Internal
-{
+{!(task != firstCompletedTask)
     /// <summary>
     /// Reads lines from several StreamReaders in the order that they arrive

[Killed] Equality mutation
Core/Internal/MultistreamReader.cs:6:25
 using System.Threading.Tasks;
 
 namespace Reductech.EDR.Core.Internal
-{
+{task == firstCompletedTask
     /// <summary>
     /// Reads lines from several StreamReaders in the order that they arrive

[Timeout] Equality mutation
Core/Internal/MultistreamReader.cs:7:25
 
 namespace Reductech.EDR.Core.Internal
 {
-    /// <summary>
+    /// <summary>firstResult != null
     /// Reads lines from several StreamReaders in the order that they arrive
     /// </summary>

[Timeout] Negate expression
Core/Internal/MultistreamReader.cs:7:25
 
 namespace Reductech.EDR.Core.Internal
 {
-    /// <summary>
+    /// <summary>!(firstResult == null)
     /// Reads lines from several StreamReaders in the order that they arrive
     /// </summary>

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Core/Internal/MultistreamReader.cs:32:63
         {
             var awaitingTasks = new List<Task<T?>>();
 
-            for (var i = 0; i < _streamReaderTaskPairs.Count; i++) //go through all stream readers
+            for (var i = 0; i < _streamReaderTaskPairs.Count; i--) //go through all stream readers
             {
                 var (streamReader, task1) = _streamReaderTaskPairs[i];

[Killed] Equality mutation
Core/Internal/MultistreamReader.cs:32:29
         {
             var awaitingTasks = new List<Task<T?>>();
 
-            for (var i = 0; i < _streamReaderTaskPairs.Count; i++) //go through all stream readers
+            for (var i = 0; i <= _streamReaderTaskPairs.Count; i++) //go through all stream readers
             {
                 var (streamReader, task1) = _streamReaderTaskPairs[i];

[Killed] Negate expression
Core/Internal/MultistreamReader.cs:51:20
                 }
             }
 
-            while (awaitingTasks.Any()) //loop until a string is returned that is not null
+            while (!(awaitingTasks.Any())) //loop until a string is returned that is not null
             {
                 var firstCompletedTask = await Task.WhenAny(awaitingTasks);

[Killed] Equality mutation
Core/Internal/MultistreamReader.cs:57:33
                 var firstResult = firstCompletedTask.Result;
 
 
-                for (var i = 0; i < _streamReaderTaskPairs.Count; i++)
+                for (var i = 0; i > _streamReaderTaskPairs.Count; i++)
                 {
                     var (streamReader, task) = _streamReaderTaskPairs[i];

[Survived] PostIncrementExpression to PostDecrementExpression mutation
Core/Internal/MultistreamReader.cs:57:67
                 var firstResult = firstCompletedTask.Result;
 
 
-                for (var i = 0; i < _streamReaderTaskPairs.Count; i++)
+                for (var i = 0; i < _streamReaderTaskPairs.Count; i--)
                 {
                     var (streamReader, task) = _streamReaderTaskPairs[i];

[Timeout] Negate expression
Core/Internal/MultistreamReader.cs:66:21
                     break;
                 }
 
-                if (firstResult != null) return firstResult; //return this result
+                if (!(firstResult != null)) return firstResult; //return this result
 
                 awaitingTasks.Remove(firstCompletedTask); //remove this task

[Timeout] Equality mutation
Core/Internal/MultistreamReader.cs:66:21
                     break;
                 }
 
-                if (firstResult != null) return firstResult; //return this result
+                if (firstResult == null) return firstResult; //return this result
 
                 awaitingTasks.Remove(firstCompletedTask); //remove this task
