[NoCoverage] Equality mutation
Core/Internal/StepContext.cs:45:38
                         .Select(TryGetTypeFromReference)
                         .Combine()
                         .Map(x => x.Distinct())
-                        .Ensure(x => x.Count() == 1, $"Type has multiple actual types.")
+                        .Ensure(x => x.Count() != 1, $"Type has multiple actual types.")
                         .Map(x => x.Single());
 

[NoCoverage] Linq method mutation (Single() to SingleOrDefault())
Core/Internal/StepContext.cs:46:35
                         .Combine()
                         .Map(x => x.Distinct())
                         .Ensure(x => x.Count() == 1, $"Type has multiple actual types.")
-                        .Map(x => x.Single());
+                        .Map(x => x.SingleOrDefault());
 
                     return result;

[Killed] Negate expression
Core/Internal/StepContext.cs:93:29
                     var keys = remainingGroup.SelectMany(x=>x.typeReference.VariableTypeReferences).Select(x=>x.VariableName).Prepend(remainingGroup.Key).ToList();
 
                     var newSet = keys.Select(x =>
-                            groupingDictionary.TryGetValue(x, out var hs) ? hs : Enumerable.Empty<ActualTypeReference>())
+                            !(                            groupingDictionary.TryGetValue(x, out var hs) ) ? hs : Enumerable.Empty<ActualTypeReference>())
                         .Distinct()
                         .SelectMany(x => x)
