[Killed] Bitwise mutation
Core/Internal/StepFactory.cs:69:59
         /// </summary>
         public MemberType GetExpectedMemberType(string name)
         {
-            var propertyInfo = StepType.GetProperty(name, BindingFlags.IgnoreCase | BindingFlags.Public | BindingFlags.Instance);
+            var propertyInfo = StepType.GetProperty(name, BindingFlags.IgnoreCase & BindingFlags.Public  | BindingFlags.Instance);
 
             if (propertyInfo == null) return MemberType.NotAMember;

[Killed] Bitwise mutation
Core/Internal/StepFactory.cs:69:59
         /// </summary>
         public MemberType GetExpectedMemberType(string name)
         {
-            var propertyInfo = StepType.GetProperty(name, BindingFlags.IgnoreCase | BindingFlags.Public | BindingFlags.Instance);
+            var propertyInfo = StepType.GetProperty(name, BindingFlags.IgnoreCase | BindingFlags.Public & BindingFlags.Instance);
 
             if (propertyInfo == null) return MemberType.NotAMember;

[Killed] Equality mutation
Core/Internal/StepFactory.cs:71:17
         {
             var propertyInfo = StepType.GetProperty(name, BindingFlags.IgnoreCase | BindingFlags.Public | BindingFlags.Instance);
 
-            if (propertyInfo == null) return MemberType.NotAMember;
+            if (propertyInfo != null) return MemberType.NotAMember;
 
             if (propertyInfo.GetCustomAttribute<VariableNameAttribute>() != null) return MemberType.VariableName;

[Killed] Negate expression
Core/Internal/StepFactory.cs:71:17
         {
             var propertyInfo = StepType.GetProperty(name, BindingFlags.IgnoreCase | BindingFlags.Public | BindingFlags.Instance);
 
-            if (propertyInfo == null) return MemberType.NotAMember;
+            if (!(propertyInfo == null)) return MemberType.NotAMember;
 
             if (propertyInfo.GetCustomAttribute<VariableNameAttribute>() != null) return MemberType.VariableName;

[Killed] Equality mutation
Core/Internal/StepFactory.cs:73:17
 
             if (propertyInfo == null) return MemberType.NotAMember;
 
-            if (propertyInfo.GetCustomAttribute<VariableNameAttribute>() != null) return MemberType.VariableName;
+            if (propertyInfo.GetCustomAttribute<VariableNameAttribute>() == null) return MemberType.VariableName;
             if (propertyInfo.GetCustomAttribute<StepPropertyAttribute>() != null) return MemberType.Step;
             if (propertyInfo.GetCustomAttribute<StepListPropertyAttribute>() != null) return MemberType.StepList;

[Killed] Negate expression
Core/Internal/StepFactory.cs:73:17
 
             if (propertyInfo == null) return MemberType.NotAMember;
 
-            if (propertyInfo.GetCustomAttribute<VariableNameAttribute>() != null) return MemberType.VariableName;
+            if (!(propertyInfo.GetCustomAttribute<VariableNameAttribute>() != null)) return MemberType.VariableName;
             if (propertyInfo.GetCustomAttribute<StepPropertyAttribute>() != null) return MemberType.Step;
             if (propertyInfo.GetCustomAttribute<StepListPropertyAttribute>() != null) return MemberType.StepList;

[Killed] Equality mutation
Core/Internal/StepFactory.cs:74:17
             if (propertyInfo == null) return MemberType.NotAMember;
 
             if (propertyInfo.GetCustomAttribute<VariableNameAttribute>() != null) return MemberType.VariableName;
-            if (propertyInfo.GetCustomAttribute<StepPropertyAttribute>() != null) return MemberType.Step;
+            if (propertyInfo.GetCustomAttribute<StepPropertyAttribute>() == null) return MemberType.Step;
             if (propertyInfo.GetCustomAttribute<StepListPropertyAttribute>() != null) return MemberType.StepList;
 

[Killed] Negate expression
Core/Internal/StepFactory.cs:74:17
             if (propertyInfo == null) return MemberType.NotAMember;
 
             if (propertyInfo.GetCustomAttribute<VariableNameAttribute>() != null) return MemberType.VariableName;
-            if (propertyInfo.GetCustomAttribute<StepPropertyAttribute>() != null) return MemberType.Step;
+            if (!(propertyInfo.GetCustomAttribute<StepPropertyAttribute>() != null)) return MemberType.Step;
             if (propertyInfo.GetCustomAttribute<StepListPropertyAttribute>() != null) return MemberType.StepList;
 

[Killed] Equality mutation
Core/Internal/StepFactory.cs:75:17
 
             if (propertyInfo.GetCustomAttribute<VariableNameAttribute>() != null) return MemberType.VariableName;
             if (propertyInfo.GetCustomAttribute<StepPropertyAttribute>() != null) return MemberType.Step;
-            if (propertyInfo.GetCustomAttribute<StepListPropertyAttribute>() != null) return MemberType.StepList;
+            if (propertyInfo.GetCustomAttribute<StepListPropertyAttribute>() == null) return MemberType.StepList;
 
             return MemberType.NotAMember;

[Killed] Negate expression
Core/Internal/StepFactory.cs:75:17
 
             if (propertyInfo.GetCustomAttribute<VariableNameAttribute>() != null) return MemberType.VariableName;
             if (propertyInfo.GetCustomAttribute<StepPropertyAttribute>() != null) return MemberType.Step;
-            if (propertyInfo.GetCustomAttribute<StepListPropertyAttribute>() != null) return MemberType.StepList;
+            if (!(propertyInfo.GetCustomAttribute<StepListPropertyAttribute>() != null)) return MemberType.StepList;
 
             return MemberType.NotAMember;

[Killed] Negate expression
Core/Internal/StepFactory.cs:87:17
         {
             var instanceResult = TryCreateInstance(stepContext, freezableStepData);
 
-            if (instanceResult.IsFailure)
+            if (!(instanceResult.IsFailure))
                 return instanceResult.ConvertFailure<IStep>();
 

[Killed] Equality mutation
Core/Internal/StepFactory.cs:99:29
 
             var variableNameProperties1 = instanceType
                 .GetProperties()
-                .Where(x => x.PropertyType == typeof(VariableName))
+                .Where(x => x.PropertyType != typeof(VariableName))
                 .Where(x => x.GetCustomAttribute<VariableNameAttribute>() != null);
 

[Killed] Equality mutation
Core/Internal/StepFactory.cs:100:29
             var variableNameProperties1 = instanceType
                 .GetProperties()
                 .Where(x => x.PropertyType == typeof(VariableName))
-                .Where(x => x.GetCustomAttribute<VariableNameAttribute>() != null);
+                .Where(x => x.GetCustomAttribute<VariableNameAttribute>() == null);
 
 

[Killed] Equality mutation
Core/Internal/StepFactory.cs:104:29
 
 
             var simpleProperties1 = instanceType.GetProperties()
-                .Where(x => x.GetCustomAttribute<StepPropertyAttribute>() != null);
+                .Where(x => x.GetCustomAttribute<StepPropertyAttribute>() == null);
 
             var listProperties1 = instanceType.GetProperties()

[Killed] Equality mutation
Core/Internal/StepFactory.cs:107:29
                 .Where(x => x.GetCustomAttribute<StepPropertyAttribute>() != null);
 
             var listProperties1 = instanceType.GetProperties()
-                .Where(x => x.GetCustomAttribute<StepListPropertyAttribute>() != null);
+                .Where(x => x.GetCustomAttribute<StepListPropertyAttribute>() == null);
 
             var remainingProperties =

[Killed] Negate expression
Core/Internal/StepFactory.cs:119:21
             foreach (var (propertyName, stepMember) in freezableStepData.Dictionary)
             {
 #pragma warning disable 8714
-                if (remainingProperties.Remove(propertyName, out var pair))
+                if (!(remainingProperties.Remove(propertyName, out var pair)))
 #pragma warning restore 8714
                 {

[Killed] Negate expression
Core/Internal/StepFactory.cs:123:24
 #pragma warning restore 8714
                 {
                     var convertResult = stepMember.TryConvert(pair.memberType);
-                    if(convertResult.IsFailure)
+                    if(!(convertResult.IsFailure))
                         errors.Add(convertResult.Error);
                     else

[Killed] Negate expression
Core/Internal/StepFactory.cs:150:25
                 static Result TrySetVariableName(PropertyInfo propertyInfo, IStep parentStep, StepMember member)
                 {
                     var r1 = member.AsVariableName(propertyInfo.Name);
-                    if (r1.IsFailure) return r1;
+                    if (!(r1.IsFailure)) return r1;
 
                     propertyInfo.SetValue(parentStep, r1.Value);

[Killed] Negate expression
Core/Internal/StepFactory.cs:159:25
                 static Result TrySetStep(PropertyInfo propertyInfo, IStep parentStep, StepMember member, StepContext context)
                 {
                     var argumentFreezeResult = member.AsArgument(propertyInfo.Name).Bind(x=>x.TryFreeze(context));
-                    if (argumentFreezeResult.IsFailure)
+                    if (!(argumentFreezeResult.IsFailure))
                         return argumentFreezeResult;
                     if (!propertyInfo.PropertyType.IsInstanceOfType(argumentFreezeResult.Value))

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Core/Internal/StepFactory.cs:161:25
                     var argumentFreezeResult = member.AsArgument(propertyInfo.Name).Bind(x=>x.TryFreeze(context));
                     if (argumentFreezeResult.IsFailure)
                         return argumentFreezeResult;
-                    if (!propertyInfo.PropertyType.IsInstanceOfType(argumentFreezeResult.Value))
+                    if (propertyInfo.PropertyType.IsInstanceOfType(argumentFreezeResult.Value))
                         return Result.Failure($"'{propertyInfo.Name}' cannot take the value '{argumentFreezeResult.Value}'");
 

[Killed] Negate expression
Core/Internal/StepFactory.cs:161:25
                     var argumentFreezeResult = member.AsArgument(propertyInfo.Name).Bind(x=>x.TryFreeze(context));
                     if (argumentFreezeResult.IsFailure)
                         return argumentFreezeResult;
-                    if (!propertyInfo.PropertyType.IsInstanceOfType(argumentFreezeResult.Value))
+                    if (!(!propertyInfo.PropertyType.IsInstanceOfType(argumentFreezeResult.Value)))
                         return Result.Failure($"'{propertyInfo.Name}' cannot take the value '{argumentFreezeResult.Value}'");
 

[Killed] Negate expression
Core/Internal/StepFactory.cs:175:25
                             .AsListArgument(propertyInfo.Name)
                             .Bind(l => l.Select(x => x.TryFreeze(context)).Combine()
                                 .Map(x => x.ToImmutableArray()));
-                    if (freezeResult.IsFailure)
+                    if (!(freezeResult.IsFailure))
                         return freezeResult;
 

[Survived] Linq method mutation (Single() to SingleOrDefault())
Core/Internal/StepFactory.cs:178:39
                     if (freezeResult.IsFailure)
                         return freezeResult;
 
-                    var genericType = propertyInfo.PropertyType.GenericTypeArguments.Single();
+                    var genericType = propertyInfo.PropertyType.GenericTypeArguments.SingleOrDefault();
                     var listType = typeof(List<>).MakeGenericType(genericType);
 

[Killed] Negate expression
Core/Internal/StepFactory.cs:184:29
                     var list = Activator.CreateInstance(listType);
 
                     foreach (var step1 in freezeResult.Value)
-                        if (genericType.IsInstanceOfType(step1))
+                        if (!(genericType.IsInstanceOfType(step1)))
                         {
                             var addMethod = listType.GetMethod(nameof(List<object>.Add))!;

[NoCoverage] Equality mutation
Core/Internal/StepFactory.cs:200:36
             }
 
             errors.AddRange(remainingProperties.Values
-                .Where(property => property.propertyInfo.GetCustomAttribute<RequiredAttribute>() != null)
+                .Where(property => property.propertyInfo.GetCustomAttribute<RequiredAttribute>() == null)
                 .Select(property => $"The property '{property.propertyInfo.Name}' was not set on type '{GetType().Name}'.")
             );

[NoCoverage] String mutation
Core/Internal/StepFactory.cs:201:37
 
             errors.AddRange(remainingProperties.Values
                 .Where(property => property.propertyInfo.GetCustomAttribute<RequiredAttribute>() != null)
-                .Select(property => $"The property '{property.propertyInfo.Name}' was not set on type '{GetType().Name}'.")
+                .Select(property => $"")
             );
 

[NoCoverage] String mutation
Core/Internal/StepFactory.cs:206:58
 
 
             if (errors.Any())
-                return Result.Failure<IStep>(string.Join("\r\n", errors));
+                return Result.Failure<IStep>(string.Join("", errors));
 
             return Result.Success<IStep>(step);

[Killed] Negate expression
Core/Internal/StepFactory.cs:234:17
         protected static string FormatTypeName(Type type)
         {
             string friendlyName = type.Name;
-            if (type.IsGenericType)
+            if (!(type.IsGenericType))
             {
                 var iBacktick = friendlyName.IndexOf('`');

[Killed] Negate expression
Core/Internal/StepFactory.cs:237:21
             if (type.IsGenericType)
             {
                 var iBacktick = friendlyName.IndexOf('`');
-                if (iBacktick > 0) friendlyName = friendlyName.Remove(iBacktick);
+                if (!(iBacktick > 0)) friendlyName = friendlyName.Remove(iBacktick);
             }
 

[Killed] Equality mutation
Core/Internal/StepFactory.cs:237:21
             if (type.IsGenericType)
             {
                 var iBacktick = friendlyName.IndexOf('`');
-                if (iBacktick > 0) friendlyName = friendlyName.Remove(iBacktick);
+                if (iBacktick < 0) friendlyName = friendlyName.Remove(iBacktick);
             }
 
