[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Core/Internal/StepFactoryStore.cs:33:29
                         .Distinct()
                         .SelectMany(a=>a!.GetTypes())
                         .Distinct()
-                .Where(x => !x.IsAbstract)
+                .Where(x => x.IsAbstract)
                 .Where(x => typeof(StepFactory).IsAssignableFrom(x))
                 .Select(x => x.GetProperty("Instance", BindingFlags.Public | BindingFlags.Static)!.GetValue(null))

[Killed] Bitwise mutation
Core/Internal/StepFactoryStore.cs:35:56
                         .Distinct()
                 .Where(x => !x.IsAbstract)
                 .Where(x => typeof(StepFactory).IsAssignableFrom(x))
-                .Select(x => x.GetProperty("Instance", BindingFlags.Public | BindingFlags.Static)!.GetValue(null))
+                .Select(x => x.GetProperty("Instance", BindingFlags.Public & BindingFlags.Static)!.GetValue(null))
                 .Cast<StepFactory>().ToList();
 
