[Killed] Negate expression
Core/Internal/StepMember.cs:38:21
         {
             get
             {
-                if (Option.Choice1.HasValue) return MemberType.VariableName;
+                if (!(Option.Choice1.HasValue)) return MemberType.VariableName;
                 if (Option.Choice2.HasValue) return MemberType.Step;
                 if (Option.Choice3.HasValue) return MemberType.StepList;

[Killed] Negate expression
Core/Internal/StepMember.cs:39:21
             get
             {
                 if (Option.Choice1.HasValue) return MemberType.VariableName;
-                if (Option.Choice2.HasValue) return MemberType.Step;
+                if (!(Option.Choice2.HasValue)) return MemberType.Step;
                 if (Option.Choice3.HasValue) return MemberType.StepList;
 

[Killed] Negate expression
Core/Internal/StepMember.cs:40:21
             {
                 if (Option.Choice1.HasValue) return MemberType.VariableName;
                 if (Option.Choice2.HasValue) return MemberType.Step;
-                if (Option.Choice3.HasValue) return MemberType.StepList;
+                if (!(Option.Choice3.HasValue)) return MemberType.StepList;
 
                 return MemberType.NotAMember;

[Survived] String mutation
Core/Internal/StepMember.cs:66:98
         /// <summary>
         /// Gets the stepMember if it is an argument.
         /// </summary>
-        public Result<IFreezableStep> AsArgument(string propertyName) => Option.Choice2.ToResult($"{propertyName} was a {MemberType}, not an argument");
+        public Result<IFreezableStep> AsArgument(string propertyName) => Option.Choice2.ToResult($"");
 
         /// <summary>

[Killed] Equality mutation
Core/Internal/StepMember.cs:78:17
         /// </summary>
         public Result<StepMember> TryConvert(MemberType convertType)
         {
-            if (MemberType == convertType) return this;
+            if (MemberType != convertType) return this;
 
             if (MemberType == MemberType.StepList && convertType == MemberType.Step)

[Killed] Negate expression
Core/Internal/StepMember.cs:78:17
         /// </summary>
         public Result<StepMember> TryConvert(MemberType convertType)
         {
-            if (MemberType == convertType) return this;
+            if (!(MemberType == convertType)) return this;
 
             if (MemberType == MemberType.StepList && convertType == MemberType.Step)

[Killed] Equality mutation
Core/Internal/StepMember.cs:80:17
         {
             if (MemberType == convertType) return this;
 
-            if (MemberType == MemberType.StepList && convertType == MemberType.Step)
+            if (MemberType != MemberType.StepList  && convertType == MemberType.Step)
             {
                 var sequence = SequenceStepFactory.CreateFreezable(Option.Choice3.Value, null);

[Killed] Logical mutation
Core/Internal/StepMember.cs:80:17
         {
             if (MemberType == convertType) return this;
 
-            if (MemberType == MemberType.StepList && convertType == MemberType.Step)
+            if (MemberType == MemberType.StepList || convertType == MemberType.Step)
             {
                 var sequence = SequenceStepFactory.CreateFreezable(Option.Choice3.Value, null);

[Killed] Negate expression
Core/Internal/StepMember.cs:86:17
                 return new StepMember(sequence);
             }
 
-            if (MemberType == MemberType.VariableName && convertType == MemberType.Step)
+            if (!(MemberType == MemberType.VariableName && convertType == MemberType.Step))
             {
                 var getVariableStep = GetVariableStepFactory.CreateFreezable(Option.Choice1.Value);

[Killed] Equality mutation
Core/Internal/StepMember.cs:86:17
                 return new StepMember(sequence);
             }
 
-            if (MemberType == MemberType.VariableName && convertType == MemberType.Step)
+            if (MemberType != MemberType.VariableName  && convertType == MemberType.Step)
             {
                 var getVariableStep = GetVariableStepFactory.CreateFreezable(Option.Choice1.Value);

[NoCoverage] Boolean mutation
Core/Internal/StepMember.cs:130:28
                     return a2 is null;
 
                 if (a2 is null)
-                    return false;
+                    return true;
 
                 return a1.SequenceEqual(a2);

[NoCoverage] Logical mutation
Core/Internal/StepMember.cs:139:83
 
 
         /// <inheritdoc />
-        public override bool Equals(object? obj) => ReferenceEquals(this, obj) || obj is StepMember other && Equals(other);
+        public override bool Equals(object? obj) => ReferenceEquals(this, obj) || obj is StepMember other || Equals(other);
 
         /// <inheritdoc />

[NoCoverage] Logical mutation
Core/Internal/StepMember.cs:139:53
 
 
         /// <inheritdoc />
-        public override bool Equals(object? obj) => ReferenceEquals(this, obj) || obj is StepMember other && Equals(other);
+        public override bool Equals(object? obj) => ReferenceEquals(this, obj) && obj is StepMember other && Equals(other);
 
         /// <inheritdoc />

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
Core/Internal/StepMember.cs:152:80
         /// <summary>
         /// Not Equals operator
         /// </summary>
-        public static bool operator !=(StepMember? left, StepMember? right) => !Equals(left, right);
+        public static bool operator !=(StepMember? left, StepMember? right) => Equals(left, right);
     }
 }
