[Killed] String mutation
Core/Internal/StepNameBuilderFromTemplate.cs:41:45
 
             string GetReplacement(Match m)
             {
-                var variableName = m.Groups["ArgumentName"].Value;
+                var variableName = m.Groups[""].Value;
 
                 var p = freezableStepData.Dictionary.TryFindOrFail(variableName, null)

[Survived] Regex character class shorthand negation mutation
Core/Internal/StepNameBuilderFromTemplate.cs:54:69
 
         }
 
-        private static readonly Regex NameVariableRegex = new Regex(@"\[(?<ArgumentName>[\w_][\w\d_]*)\]", RegexOptions.Compiled);
+        private static readonly Regex NameVariableRegex = new Regex("\\[(?<ArgumentName>[\\W_][\\w\\d_]*)\\]", RegexOptions.Compiled);
     }
 }

[Survived] Regex character class shorthand negation mutation
Core/Internal/StepNameBuilderFromTemplate.cs:54:69
 
         }
 
-        private static readonly Regex NameVariableRegex = new Regex(@"\[(?<ArgumentName>[\w_][\w\d_]*)\]", RegexOptions.Compiled);
+        private static readonly Regex NameVariableRegex = new Regex("\\[(?<ArgumentName>[\\w_][\\w\\D_]*)\\]", RegexOptions.Compiled);
     }
 }
