[NoCoverage] Negate expression
Core/Internal/StreamReaderWithSource.cs:23:17
         {
             var line = await _underlying.ReadLineAsync();
 
-            if (line == null)
+            if (!(line == null))
                 return null;
 

[NoCoverage] Equality mutation
Core/Internal/StreamReaderWithSource.cs:23:17
         {
             var line = await _underlying.ReadLineAsync();
 
-            if (line == null)
+            if (line != null)
                 return null;
 
