[Killed] Equality mutation
Core/Internal/VariableName.cs:21:51
         public string Name { get;  }
 
         /// <inheritdoc />
-        public bool Equals(VariableName other) => Name == other.Name;
+        public bool Equals(VariableName other) => Name != other.Name;
 
         /// <inheritdoc />

[NoCoverage] Logical mutation
Core/Internal/VariableName.cs:24:53
         public bool Equals(VariableName other) => Name == other.Name;
 
         /// <inheritdoc />
-        public override bool Equals(object? obj) => obj is VariableName other && Equals(other);
+        public override bool Equals(object? obj) => obj is VariableName other || Equals(other);
 
         /// <inheritdoc />

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
Core/Internal/VariableName.cs:37:82
         /// <summary>
         /// Not Equals Operator
         /// </summary>
-        public static bool operator !=(VariableName left, VariableName right) => !left.Equals(right);
+        public static bool operator !=(VariableName left, VariableName right) => left.Equals(right);
 
         /// <summary>
