[NoCoverage] Boolean mutation
Core/Internal/VariableTypeReference.cs:31:42
 
             return other switch
             {
-                ActualTypeReference _ => false,
+                ActualTypeReference _ => true,
                 MultipleTypeReference multipleTypeReference => multipleTypeReference.AllReferences.Count == 1 &&
                                                                multipleTypeReference.AllReferences.Contains(this),

[NoCoverage] Logical mutation
Core/Internal/VariableTypeReference.cs:32:64
             return other switch
             {
                 ActualTypeReference _ => false,
-                MultipleTypeReference multipleTypeReference => multipleTypeReference.AllReferences.Count == 1 &&
-                                                               multipleTypeReference.AllReferences.Contains(this),
+                MultipleTypeReference multipleTypeReference => multipleTypeReference.AllReferences.Count == 1 ||
+                                                               multipleTypeReference.AllReferences.Contains(this),
                 VariableTypeReference typeReference => VariableName == typeReference.VariableName,
                 GenericTypeReference _ => false,

[NoCoverage] Equality mutation
Core/Internal/VariableTypeReference.cs:32:64
             return other switch
             {
                 ActualTypeReference _ => false,
-                MultipleTypeReference multipleTypeReference => multipleTypeReference.AllReferences.Count == 1 &&
+                MultipleTypeReference multipleTypeReference => multipleTypeReference.AllReferences.Count != 1  &&
                                                                multipleTypeReference.AllReferences.Contains(this),
                 VariableTypeReference typeReference => VariableName == typeReference.VariableName,

[NoCoverage] Equality mutation
Core/Internal/VariableTypeReference.cs:34:56
                 ActualTypeReference _ => false,
                 MultipleTypeReference multipleTypeReference => multipleTypeReference.AllReferences.Count == 1 &&
                                                                multipleTypeReference.AllReferences.Contains(this),
-                VariableTypeReference typeReference => VariableName == typeReference.VariableName,
+                VariableTypeReference typeReference => VariableName != typeReference.VariableName,
                 GenericTypeReference _ => false,
                 _ => throw new ArgumentOutOfRangeException(nameof(other))

[NoCoverage] Boolean mutation
Core/Internal/VariableTypeReference.cs:35:43
                 MultipleTypeReference multipleTypeReference => multipleTypeReference.AllReferences.Count == 1 &&
                                                                multipleTypeReference.AllReferences.Contains(this),
                 VariableTypeReference typeReference => VariableName == typeReference.VariableName,
-                GenericTypeReference _ => false,
+                GenericTypeReference _ => true,
                 _ => throw new ArgumentOutOfRangeException(nameof(other))
             };
