[Killed] Boolean mutation
Core/Serialization/AnyPrimitiveComponent.cs:40:89
         private static Result<string> TrySerialize(IFreezableStep step)
         {
             if (step is ConstantFreezableStep constantFreezableProcess)
-                return SerializationMethods.SerializeConstant(constantFreezableProcess, true);
+                return SerializationMethods.SerializeConstant(constantFreezableProcess, false);
             if (step is CompoundFreezableStep compound && compound.StepConfiguration == null)
                 return compound.StepFactory.Serializer.TrySerialize(compound.FreezableStepData);

[Killed] Equality mutation
Core/Serialization/AnyPrimitiveComponent.cs:41:59
         {
             if (step is ConstantFreezableStep constantFreezableProcess)
                 return SerializationMethods.SerializeConstant(constantFreezableProcess, true);
-            if (step is CompoundFreezableStep compound && compound.StepConfiguration == null)
+            if (step is CompoundFreezableStep compound && compound.StepConfiguration != null)
                 return compound.StepFactory.Serializer.TrySerialize(compound.FreezableStepData);
 
