[Killed] Equality mutation
Core/Serialization/BooleanComponent.cs:36:59
         {
             if (step is ConstantFreezableStep constantFreezableProcess && constantFreezableProcess.Value is bool b)
                 return b.ToString();
-            if (step is CompoundFreezableStep compound && compound.StepConfiguration == null)
+            if (step is CompoundFreezableStep compound && compound.StepConfiguration != null)
                 return compound.StepFactory.Serializer.TrySerialize(compound.FreezableStepData);
 
