[NoCoverage] Equality mutation
Core/Serialization/EnumDisplayComponent.cs:41:59
             if (step is ConstantFreezableStep constant && constant.Value is T t)
                 return t.GetDisplayName();
 
-            if (step is CompoundFreezableStep compound && compound.StepConfiguration == null)
+            if (step is CompoundFreezableStep compound && compound.StepConfiguration != null)
             {
                 var cSerializeResult = compound.StepFactory.Serializer.TrySerialize(compound.FreezableStepData);
