[Killed] Equality mutation
Core/Serialization/FreezableStepDeserializer.cs:25:17
         /// <inheritdoc />
         public override Result<IFreezableStep, YamlException> TryDeserialize(IParser parser, Func<IParser, Type, object?> nestedObjectDeserializer)
         {
-            if (parser.Current == null)
+            if (parser.Current != null)
                 return new YamlException("Reader is empty");
 

[Killed] Negate expression
Core/Serialization/FreezableStepDeserializer.cs:25:17
         /// <inheritdoc />
         public override Result<IFreezableStep, YamlException> TryDeserialize(IParser parser, Func<IParser, Type, object?> nestedObjectDeserializer)
         {
-            if (parser.Current == null)
+            if (!(parser.Current == null))
                 return new YamlException("Reader is empty");
 

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Core/Serialization/FreezableStepDeserializer.cs:37:20
             Configuration? configuration = null;
 
             parser.Consume<MappingStart>();
-            while (!parser.TryConsume<MappingEnd>(out _))
+            while (parser.TryConsume<MappingEnd>(out _))
             {
                 //TODO handle promises

[Killed] Negate expression
Core/Serialization/FreezableStepDeserializer.cs:37:20
             Configuration? configuration = null;
 
             parser.Consume<MappingStart>();
-            while (!parser.TryConsume<MappingEnd>(out _))
+            while (!(!parser.TryConsume<MappingEnd>(out _)))
             {
                 //TODO handle promises

[Killed] Negate expression
Core/Serialization/FreezableStepDeserializer.cs:43:21
 
                 var keyResult = TryDeserializeNested<string>(nestedObjectDeserializer, parser);
 
-                if (keyResult.IsFailure)
+                if (!(keyResult.IsFailure))
                     return keyResult.ConvertFailure<IFreezableStep>();
 

[Killed] Negate expression
Core/Serialization/FreezableStepDeserializer.cs:46:21
                 if (keyResult.IsFailure)
                     return keyResult.ConvertFailure<IFreezableStep>();
 
-                if (keyResult.Value.Equals(YamlMethods.TypeString, StringComparison.OrdinalIgnoreCase))
+                if (!(keyResult.Value.Equals(YamlMethods.TypeString, StringComparison.OrdinalIgnoreCase)))
                 {
                     if (factory != null)

[Killed] Equality mutation
Core/Serialization/FreezableStepDeserializer.cs:48:25
 
                 if (keyResult.Value.Equals(YamlMethods.TypeString, StringComparison.OrdinalIgnoreCase))
                 {
-                    if (factory != null)
+                    if (factory == null)
                         return new YamlException(markStart, markEnd, $"Duplicate property '{keyResult.Value}'");
 

[Killed] Negate expression
Core/Serialization/FreezableStepDeserializer.cs:48:25
 
                 if (keyResult.Value.Equals(YamlMethods.TypeString, StringComparison.OrdinalIgnoreCase))
                 {
-                    if (factory != null)
+                    if (!(factory != null))
                         return new YamlException(markStart, markEnd, $"Duplicate property '{keyResult.Value}'");
 

[Killed] Negate expression
Core/Serialization/FreezableStepDeserializer.cs:57:25
                             .MapFailure(e => new YamlException(markStart, markEnd, e))
                         );
 
-                    if (typeNameResult.IsFailure)
+                    if (!(typeNameResult.IsFailure))
                         return typeNameResult.ConvertFailure<IFreezableStep>();
 

[Killed] Negate expression
Core/Serialization/FreezableStepDeserializer.cs:62:26
 
                     factory = typeNameResult.Value;
                 }
-                else if (keyResult.Value.Equals(YamlMethods.ConfigString, StringComparison.OrdinalIgnoreCase))
+                else if (!(keyResult.Value.Equals(YamlMethods.ConfigString, StringComparison.OrdinalIgnoreCase)))
                 {
                     if (configuration != null)

[Killed] Equality mutation
Core/Serialization/FreezableStepDeserializer.cs:64:25
                 }
                 else if (keyResult.Value.Equals(YamlMethods.ConfigString, StringComparison.OrdinalIgnoreCase))
                 {
-                    if (configuration != null)
+                    if (configuration == null)
                         return new YamlException(markStart, markEnd, $"Duplicate property '{keyResult.Value}'");
 

[Killed] Negate expression
Core/Serialization/FreezableStepDeserializer.cs:64:25
                 }
                 else if (keyResult.Value.Equals(YamlMethods.ConfigString, StringComparison.OrdinalIgnoreCase))
                 {
-                    if (configuration != null)
+                    if (!(configuration != null))
                         return new YamlException(markStart, markEnd, $"Duplicate property '{keyResult.Value}'");
 

[Killed] Negate expression
Core/Serialization/FreezableStepDeserializer.cs:69:25
 
                     var configResult = TryDeserializeNested<Configuration>(nestedObjectDeserializer, parser);
 
-                    if (configResult.IsFailure)
+                    if (!(configResult.IsFailure))
                         return configResult.ConvertFailure<IFreezableStep>();
 

[Killed] Negate expression
Core/Serialization/FreezableStepDeserializer.cs:76:25
                 }
                 else
                 {
-                    if (dictionary.ContainsKey(keyResult.Value))
+                    if (!(dictionary.ContainsKey(keyResult.Value)))
                         return new YamlException(markStart, markEnd, $"Duplicate property '{keyResult.Value}'");
 

[Killed] Negate expression
Core/Serialization/FreezableStepDeserializer.cs:82:25
 
                     var memberResult = TryDeserializeNested<StepMember>(nestedObjectDeserializer, parser);
 
-                    if (memberResult.IsFailure)
+                    if (!(memberResult.IsFailure))
                         return memberResult.ConvertFailure<IFreezableStep>();
 

[Killed] Equality mutation
Core/Serialization/FreezableStepDeserializer.cs:90:17
             }
 
 
-            if (factory == null)
+            if (factory != null)
                 return new YamlException(markStart, markEnd, $"The '{YamlMethods.TypeString}' property must be set.");
 

[Killed] Negate expression
Core/Serialization/FreezableStepDeserializer.cs:90:17
             }
 
 
-            if (factory == null)
+            if (!(factory == null))
                 return new YamlException(markStart, markEnd, $"The '{YamlMethods.TypeString}' property must be set.");
 
