[Killed] Boolean mutation
Core/Serialization/FunctionSerializer.cs:33:25
             sb.Append(Name);
             sb.Append("(");
 
-            var first = true;
+            var first = false;
 
 

[Survived] Linq method mutation (OrderBy() to OrderByDescending())
Core/Serialization/FunctionSerializer.cs:37:17
 
 
             foreach (var (propertyName, value) in
-                data.Dictionary.OrderBy(x=>x.Key))
+                                data.Dictionary.OrderByDescending(x=>x.Key))
             {
                 if (first)

[Killed] Negate expression
Core/Serialization/FunctionSerializer.cs:39:21
             foreach (var (propertyName, value) in
                 data.Dictionary.OrderBy(x=>x.Key))
             {
-                if (first)
+                if (!(first))
                     first = false;
                 else

[Killed] Boolean mutation
Core/Serialization/FunctionSerializer.cs:40:29
                 data.Dictionary.OrderBy(x=>x.Key))
             {
                 if (first)
-                    first = false;
+                    first = true;
                 else
                     sb.Append(", ");

[Killed] String mutation
Core/Serialization/FunctionSerializer.cs:42:31
                 if (first)
                     first = false;
                 else
-                    sb.Append(", ");
+                    sb.Append("");
 
                 sb.Append(propertyName);

[Killed] String mutation
Core/Serialization/FunctionSerializer.cs:45:27
                     sb.Append(", ");
 
                 sb.Append(propertyName);
-                sb.Append(" = ");
+                sb.Append("");
 
 

[Killed] Negate expression
Core/Serialization/FunctionSerializer.cs:54:21
                         SerializeProcess,
                         SerializeList);
 
-                if (valueSerializeResult.IsFailure)
+                if (!(valueSerializeResult.IsFailure))
                     return valueSerializeResult;
 

[Killed] String mutation
Core/Serialization/FunctionSerializer.cs:59:23
 
                 sb.Append(valueSerializeResult.Value);
             }
-            sb.Append(")");
+            sb.Append("");
 
             return sb.ToString();

[Killed] Boolean mutation
Core/Serialization/FunctionSerializer.cs:68:104
             {
                 return freezableProcess switch
                 {
-                    ConstantFreezableStep constant => SerializationMethods.SerializeConstant(constant, true),
+                    ConstantFreezableStep constant => SerializationMethods.SerializeConstant(constant, false),
                     CompoundFreezableStep compoundFreezableProcess => compoundFreezableProcess.StepFactory
                         .Serializer.TrySerialize(compoundFreezableProcess.FreezableStepData),

[Killed] Negate expression
Core/Serialization/FunctionSerializer.cs:78:21
             static Result<string> SerializeList(IReadOnlyList<IFreezableStep> list)
             {
                 var elementResult = list.Select(SerializeProcess).Combine();
-                if (elementResult.IsFailure)
+                if (!(elementResult.IsFailure))
                     return elementResult.ConvertFailure<string>();
 

[Killed] String mutation
Core/Serialization/FunctionSerializer.cs:85:28
 
                 sb2.Append("[");
                 sb2.AppendJoin(", ", elementResult.Value);
-                sb2.Append("]");
+                sb2.Append("");
 
                 return sb2.ToString();
