[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Core/Serialization/GeneralDeserializer.cs:20:21
         {
             foreach (var typedYamlDeserializer in Deserializers)
             {
-                if (!expectedType.IsAssignableFrom(typedYamlDeserializer.Type)) continue;
+                if (expectedType.IsAssignableFrom(typedYamlDeserializer.Type)) continue;
 
                 var (isSuccess, _, o, yamlException) = typedYamlDeserializer.TryDeserializeObject(reader, nestedObjectDeserializer);

[Killed] Negate expression
Core/Serialization/GeneralDeserializer.cs:20:21
         {
             foreach (var typedYamlDeserializer in Deserializers)
             {
-                if (!expectedType.IsAssignableFrom(typedYamlDeserializer.Type)) continue;
+                if (!(!expectedType.IsAssignableFrom(typedYamlDeserializer.Type))) continue;
 
                 var (isSuccess, _, o, yamlException) = typedYamlDeserializer.TryDeserializeObject(reader, nestedObjectDeserializer);

[Killed] Negate expression
Core/Serialization/GeneralDeserializer.cs:24:21
 
                 var (isSuccess, _, o, yamlException) = typedYamlDeserializer.TryDeserializeObject(reader, nestedObjectDeserializer);
 
-                if (isSuccess)
+                if (!(isSuccess))
                 {
                     value = o;

[Killed] Boolean mutation
Core/Serialization/GeneralDeserializer.cs:27:28
                 if (isSuccess)
                 {
                     value = o;
-                    return true;
+                    return false;
                 }
 

[Killed] Boolean mutation
Core/Serialization/GeneralDeserializer.cs:34:20
             }
 
             value = null;
-            return false;
+            return true;
         }
     }
