[Killed] Equality mutation
Core/Serialization/IntegerComponent.cs:37:59
         {
             if (step is ConstantFreezableStep constantFreezableProcess && constantFreezableProcess.Value is int i)
                 return i.ToString();
-            if (step is CompoundFreezableStep compound && compound.StepConfiguration == null)
+            if (step is CompoundFreezableStep compound && compound.StepConfiguration != null)
                 return compound.StepFactory.Serializer.TrySerialize(compound.FreezableStepData);
 
