[Killed] Negate expression
Core/Serialization/SerializationMethods.cs:15:17
         /// </summary>
         public static string SerializeConstant(ConstantFreezableStep cfp, bool quoteString)
         {
-            if (cfp.Value.GetType().IsEnum)
+            if (!(cfp.Value.GetType().IsEnum))
                 return cfp.Value.GetType().Name + "." + cfp.Value;
             if (cfp.Value is string s)

[Killed] Negate expression
Core/Serialization/SerializationMethods.cs:18:24
             if (cfp.Value.GetType().IsEnum)
                 return cfp.Value.GetType().Name + "." + cfp.Value;
             if (cfp.Value is string s)
-                return quoteString? $"'{s}'" : s;
+                return !(quoteString)? $"'{s}'" : s;
             return cfp.Value.ToString() ?? "";
         }
