[Killed] Negate expression
Core/Serialization/StepMemberDeserializer.cs:29:16
         /// <inheritdoc />
         public override Result<StepMember, YamlException> TryDeserialize(IParser reader, Func<IParser, Type, object?> nestedObjectDeserializer)
         {
-            if(reader.Current == null)
+            if(!(reader.Current == null))
                 return new YamlException("Reader is empty");
 

[Killed] Equality mutation
Core/Serialization/StepMemberDeserializer.cs:29:16
         /// <inheritdoc />
         public override Result<StepMember, YamlException> TryDeserialize(IParser reader, Func<IParser, Type, object?> nestedObjectDeserializer)
         {
-            if(reader.Current == null)
+            if(reader.Current != null)
                 return new YamlException("Reader is empty");
 

[Killed] Negate expression
Core/Serialization/StepMemberDeserializer.cs:62:25
                 case Scalar scalar:
                 {
 
-                    if (scalar.IsQuotedImplicit)
+                    if (!(scalar.IsQuotedImplicit))
                     {
                         var member = new StepMember(new ConstantFreezableStep(scalar.Value));

[Killed] Negate expression
Core/Serialization/StepMemberDeserializer.cs:73:25
                     var r = StepMemberParser.TryParse(scalar.Value)
                         .MapFailure(e=> new YamlException(reader.Current.Start, reader.Current.End, e));
 
-                    if (r.IsSuccess)
+                    if (!(r.IsSuccess))
                     {
                         reader.MoveNext();
