[Killed] Bitwise mutation
Core/Serialization/StepMemberParser.cs:78:48
             .Match(Character.EqualTo(','), ProcessToken.Delimiter)
 
             //VariableName must be before comparator
-            .Match(Span.Regex("<[a-z0-9-_]+>", RegexOptions.Compiled | RegexOptions.IgnoreCase), ProcessToken.VariableName)
+            .Match(Span.Regex("<[a-z0-9-_]+>", RegexOptions.Compiled & RegexOptions.IgnoreCase), ProcessToken.VariableName)
 
             .Match(GetSpan(MathOperator.None), ProcessToken.MathOperator, true)

[Survived] Boolean mutation
Core/Serialization/StepMemberParser.cs:80:75
             //VariableName must be before comparator
             .Match(Span.Regex("<[a-z0-9-_]+>", RegexOptions.Compiled | RegexOptions.IgnoreCase), ProcessToken.VariableName)
 
-            .Match(GetSpan(MathOperator.None), ProcessToken.MathOperator, true)
+            .Match(GetSpan(MathOperator.None), ProcessToken.MathOperator, false)
             .Match(GetSpan(BooleanOperator.None), ProcessToken.BooleanOperator, true)
             .Match(GetSpan(CompareOperator.None), ProcessToken.Comparator, true)

[Killed] Boolean mutation
Core/Serialization/StepMemberParser.cs:81:81
             .Match(Span.Regex("<[a-z0-9-_]+>", RegexOptions.Compiled | RegexOptions.IgnoreCase), ProcessToken.VariableName)
 
             .Match(GetSpan(MathOperator.None), ProcessToken.MathOperator, true)
-            .Match(GetSpan(BooleanOperator.None), ProcessToken.BooleanOperator, true)
+            .Match(GetSpan(BooleanOperator.None), ProcessToken.BooleanOperator, false)
             .Match(GetSpan(CompareOperator.None), ProcessToken.Comparator, true)
 

[Survived] Boolean mutation
Core/Serialization/StepMemberParser.cs:82:76
 
             .Match(GetSpan(MathOperator.None), ProcessToken.MathOperator, true)
             .Match(GetSpan(BooleanOperator.None), ProcessToken.BooleanOperator, true)
-            .Match(GetSpan(CompareOperator.None), ProcessToken.Comparator, true)
+            .Match(GetSpan(CompareOperator.None), ProcessToken.Comparator, false)
 
 

[Survived] Boolean mutation
Core/Serialization/StepMemberParser.cs:89:110
             .Match(QuotedString.SqlStyle, ProcessToken.StringLiteral)
             .Match(QuotedString.CStyle, ProcessToken.StringLiteral)
 
-            .Match(Span.EqualToIgnoreCase("true").Or(Span.EqualToIgnoreCase("false")), ProcessToken.Boolean, true)
+            .Match(Span.EqualToIgnoreCase("true").Or(Span.EqualToIgnoreCase("false")), ProcessToken.Boolean, false)
             .Match(Span.EqualToIgnoreCase("not"), ProcessToken.NotOperator, true)
             .Match(Span.Regex(@"[0-9]+", RegexOptions.Compiled), ProcessToken.Number)

[Survived] Boolean mutation
Core/Serialization/StepMemberParser.cs:90:77
             .Match(QuotedString.CStyle, ProcessToken.StringLiteral)
 
             .Match(Span.EqualToIgnoreCase("true").Or(Span.EqualToIgnoreCase("false")), ProcessToken.Boolean, true)
-            .Match(Span.EqualToIgnoreCase("not"), ProcessToken.NotOperator, true)
+            .Match(Span.EqualToIgnoreCase("not"), ProcessToken.NotOperator, false)
             .Match(Span.Regex(@"[0-9]+", RegexOptions.Compiled), ProcessToken.Number)
             .Match(Span.Regex(@"[a-z0-9-_]+\.[a-z0-9-_]+", RegexOptions.Compiled | RegexOptions.IgnoreCase), ProcessToken.Enum, true)

[Killed] Bitwise mutation
Core/Serialization/StepMemberParser.cs:92:60
             .Match(Span.EqualToIgnoreCase("true").Or(Span.EqualToIgnoreCase("false")), ProcessToken.Boolean, true)
             .Match(Span.EqualToIgnoreCase("not"), ProcessToken.NotOperator, true)
             .Match(Span.Regex(@"[0-9]+", RegexOptions.Compiled), ProcessToken.Number)
-            .Match(Span.Regex(@"[a-z0-9-_]+\.[a-z0-9-_]+", RegexOptions.Compiled | RegexOptions.IgnoreCase), ProcessToken.Enum, true)
+            .Match(Span.Regex(@"[a-z0-9-_]+\.[a-z0-9-_]+", RegexOptions.Compiled & RegexOptions.IgnoreCase), ProcessToken.Enum, true)
 
             .Match(Span.Regex("[a-z0-9-_]+", RegexOptions.Compiled | RegexOptions.IgnoreCase), ProcessToken.FuncOrArgumentName, true)

[Survived] Boolean mutation
Core/Serialization/StepMemberParser.cs:92:129
             .Match(Span.EqualToIgnoreCase("true").Or(Span.EqualToIgnoreCase("false")), ProcessToken.Boolean, true)
             .Match(Span.EqualToIgnoreCase("not"), ProcessToken.NotOperator, true)
             .Match(Span.Regex(@"[0-9]+", RegexOptions.Compiled), ProcessToken.Number)
-            .Match(Span.Regex(@"[a-z0-9-_]+\.[a-z0-9-_]+", RegexOptions.Compiled | RegexOptions.IgnoreCase), ProcessToken.Enum, true)
+            .Match(Span.Regex(@"[a-z0-9-_]+\.[a-z0-9-_]+", RegexOptions.Compiled | RegexOptions.IgnoreCase), ProcessToken.Enum, false)
 
             .Match(Span.Regex("[a-z0-9-_]+", RegexOptions.Compiled | RegexOptions.IgnoreCase), ProcessToken.FuncOrArgumentName, true)

[Killed] Boolean mutation
Core/Serialization/StepMemberParser.cs:94:129
             .Match(Span.Regex(@"[0-9]+", RegexOptions.Compiled), ProcessToken.Number)
             .Match(Span.Regex(@"[a-z0-9-_]+\.[a-z0-9-_]+", RegexOptions.Compiled | RegexOptions.IgnoreCase), ProcessToken.Enum, true)
 
-            .Match(Span.Regex("[a-z0-9-_]+", RegexOptions.Compiled | RegexOptions.IgnoreCase), ProcessToken.FuncOrArgumentName, true)
+            .Match(Span.Regex("[a-z0-9-_]+", RegexOptions.Compiled | RegexOptions.IgnoreCase), ProcessToken.FuncOrArgumentName, false)
             .Build(); //TODO add wildcard
 

[Killed] Bitwise mutation
Core/Serialization/StepMemberParser.cs:94:46
             .Match(Span.Regex(@"[0-9]+", RegexOptions.Compiled), ProcessToken.Number)
             .Match(Span.Regex(@"[a-z0-9-_]+\.[a-z0-9-_]+", RegexOptions.Compiled | RegexOptions.IgnoreCase), ProcessToken.Enum, true)
 
-            .Match(Span.Regex("[a-z0-9-_]+", RegexOptions.Compiled | RegexOptions.IgnoreCase), ProcessToken.FuncOrArgumentName, true)
+            .Match(Span.Regex("[a-z0-9-_]+", RegexOptions.Compiled & RegexOptions.IgnoreCase), ProcessToken.FuncOrArgumentName, true)
             .Build(); //TODO add wildcard
 

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Core/Serialization/StepMemberParser.cs:108:17
         {
             var tokensResult = Tokenizer.TryTokenize(s);
 
-            if (!tokensResult.HasValue)
+            if (tokensResult.HasValue)
                 return Result.Failure<StepMember>(tokensResult.FormatErrorMessageFragment());
 

[Killed] Negate expression
Core/Serialization/StepMemberParser.cs:108:17
         {
             var tokensResult = Tokenizer.TryTokenize(s);
 
-            if (!tokensResult.HasValue)
+            if (!(!tokensResult.HasValue))
                 return Result.Failure<StepMember>(tokensResult.FormatErrorMessageFragment());
 

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Core/Serialization/StepMemberParser.cs:111:17
             if (!tokensResult.HasValue)
                 return Result.Failure<StepMember>(tokensResult.FormatErrorMessageFragment());
 
-            if (!tokensResult.Remainder.IsAtEnd)
+            if (tokensResult.Remainder.IsAtEnd)
                 return Result.Failure<StepMember>(tokensResult.FormatErrorMessageFragment());
 

[Killed] Negate expression
Core/Serialization/StepMemberParser.cs:111:17
             if (!tokensResult.HasValue)
                 return Result.Failure<StepMember>(tokensResult.FormatErrorMessageFragment());
 
-            if (!tokensResult.Remainder.IsAtEnd)
+            if (!(!tokensResult.Remainder.IsAtEnd))
                 return Result.Failure<StepMember>(tokensResult.FormatErrorMessageFragment());
 

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Core/Serialization/StepMemberParser.cs:116:16
 
             var parseResult = Parser.TryParse(tokensResult.Value);
 
-            if(!parseResult.HasValue)
+            if(parseResult.HasValue)
                 return Result.Failure<StepMember>(parseResult.FormatErrorMessageFragment());
 

[Killed] Negate expression
Core/Serialization/StepMemberParser.cs:116:16
 
             var parseResult = Parser.TryParse(tokensResult.Value);
 
-            if(!parseResult.HasValue)
+            if(!(!parseResult.HasValue))
                 return Result.Failure<StepMember>(parseResult.FormatErrorMessageFragment());
 

[Killed] Negate expression
Core/Serialization/StepMemberParser.cs:119:16
             if(!parseResult.HasValue)
                 return Result.Failure<StepMember>(parseResult.FormatErrorMessageFragment());
 
-            if(!parseResult.Remainder.IsAtEnd)
+            if(!(!parseResult.Remainder.IsAtEnd))
                 return Result.Failure<StepMember>(parseResult.FormatErrorMessageFragment());
 

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Core/Serialization/StepMemberParser.cs:119:16
             if(!parseResult.HasValue)
                 return Result.Failure<StepMember>(parseResult.FormatErrorMessageFragment());
 
-            if(!parseResult.Remainder.IsAtEnd)
+            if(parseResult.Remainder.IsAtEnd)
                 return Result.Failure<StepMember>(parseResult.FormatErrorMessageFragment());
 

[Killed] Collection initializer mutation
Core/Serialization/StepMemberParser.cs:176:47
                     from f1 in Parse.Ref(()=> singleTerm.Value)
                     from _2 in Token.EqualTo(ProcessToken.CloseBracket)
                     select new CompoundFreezableStep(NotStepFactory.Instance,
-                        new FreezableStepData(new Dictionary<string, StepMember>
-                        {
-                            {nameof(Not.Boolean), new StepMember(f1)}
-                        }), null) as IFreezableStep).Try();
+                        new FreezableStepData(new Dictionary<string, StepMember>
+{}), null) as IFreezableStep).Try();
 
             TokenListParser<ProcessToken, IFreezableStep> mathOperation =

[Killed] Collection initializer mutation
Core/Serialization/StepMemberParser.cs:187:44
                  from o in Token.EqualTo(ProcessToken.MathOperator)
                  from f2 in Parse.Ref(()=> singleTerm.Value)
                  select new CompoundFreezableStep(ApplyMathOperatorStepFactory.Instance,
-                     new FreezableStepData(new Dictionary<string, StepMember>()
-                     {
-                        {nameof(ApplyMathOperator.Left), new StepMember(f1)},
-                        {nameof(ApplyMathOperator.Operator),
-                            new StepMember(new ConstantFreezableStep(Extensions.TryParseValue<MathOperator>(o.ToStringValue()).Value))}
-                        ,
-                        {nameof(ApplyMathOperator.Right), new StepMember(f2)}
-                     }), null) as IFreezableStep).Try();
+                     new FreezableStepData(new Dictionary<string, StepMember>()
+{}), null) as IFreezableStep).Try();
 
 

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Core/Serialization/StepMemberParser.cs:296:17
 
         {
-            if (!factoryStore.Dictionary.TryGetValue(funcName, out var runnableStepFactory))
+            if (factoryStore.Dictionary.TryGetValue(funcName, out var runnableStepFactory))
                 return Result.Failure<IFreezableStep>($"Could not find step '{funcName}'");
 

[Killed] Negate expression
Core/Serialization/StepMemberParser.cs:296:17
 
         {
-            if (!factoryStore.Dictionary.TryGetValue(funcName, out var runnableStepFactory))
+            if (!(!factoryStore.Dictionary.TryGetValue(funcName, out var runnableStepFactory)))
                 return Result.Failure<IFreezableStep>($"Could not find step '{funcName}'");
 

[Killed] Negate expression
Core/Serialization/StepMemberParser.cs:308:21
 
                 var convertResult = stepMember.TryConvert(memberType);
 
-                if (convertResult.IsFailure)
+                if (!(convertResult.IsFailure))
                     return convertResult.ConvertFailure<IFreezableStep>();
 

[Killed] Regex quantifier removal mutation
Core/Serialization/StepMemberParser.cs:344:23
 
 
         private static readonly Regex EnumRegex =
-            new Regex(@"\A(?<enum>[a-z0-9-_]+)\.(?<value>[a-z0-9-_]+)\Z",
+            new Regex("\\A(?<enum>[a-z0-9-_])\\.(?<value>[a-z0-9-_]+)\\Z",
                 RegexOptions.IgnoreCase | RegexOptions.Compiled);
 

[Killed] Regex character class negation mutation
Core/Serialization/StepMemberParser.cs:344:23
 
 
         private static readonly Regex EnumRegex =
-            new Regex(@"\A(?<enum>[a-z0-9-_]+)\.(?<value>[a-z0-9-_]+)\Z",
+            new Regex("\\A(?<enum>[a-z0-9-_]+)\\.(?<value>[^a-z0-9-_]+)\\Z",
                 RegexOptions.IgnoreCase | RegexOptions.Compiled);
 

[Killed] Bitwise mutation
Core/Serialization/StepMemberParser.cs:345:17
 
         private static readonly Regex EnumRegex =
             new Regex(@"\A(?<enum>[a-z0-9-_]+)\.(?<value>[a-z0-9-_]+)\Z",
-                RegexOptions.IgnoreCase | RegexOptions.Compiled);
+                                RegexOptions.IgnoreCase & RegexOptions.Compiled);
 
 

[Killed] Negate expression
Core/Serialization/StepMemberParser.cs:363:17
         private static CSharpFunctionalExtensions.Result<IFreezableStep> TryGetEnumValue(string enumName, string value,
             StepFactoryStore stepFactoryStore)
         {
-            if (stepFactoryStore.EnumTypesDictionary.TryGetValue(enumName, out var type))
+            if (!(stepFactoryStore.EnumTypesDictionary.TryGetValue(enumName, out var type)))
                 if (Enum.TryParse(type, value, true, out var enumValue))
                     return new ConstantFreezableStep(enumValue!);

[Killed] Negate expression
Core/Serialization/StepMemberParser.cs:364:21
             StepFactoryStore stepFactoryStore)
         {
             if (stepFactoryStore.EnumTypesDictionary.TryGetValue(enumName, out var type))
-                if (Enum.TryParse(type, value, true, out var enumValue))
+                if (!(Enum.TryParse(type, value, true, out var enumValue)))
                     return new ConstantFreezableStep(enumValue!);
             return Result.Failure<IFreezableStep>("Could not parse enum");

[Survived] Boolean mutation
Core/Serialization/StepMemberParser.cs:364:48
             StepFactoryStore stepFactoryStore)
         {
             if (stepFactoryStore.EnumTypesDictionary.TryGetValue(enumName, out var type))
-                if (Enum.TryParse(type, value, true, out var enumValue))
+                if (Enum.TryParse(type, value, false, out var enumValue))
                     return new ConstantFreezableStep(enumValue!);
             return Result.Failure<IFreezableStep>("Could not parse enum");

[Survived] Linq method mutation (OrderByDescending() to OrderBy())
Core/Serialization/StepMemberParser.cs:370:13
         }
 
         private static TextParser<TextSpan> GetSpan<T>(params T[] excludedValues) where T : Enum =>
-            Extensions.GetEnumValues<T>()
-                .Except(excludedValues)
-                .SelectMany(x => new []{x.ToString(), x.GetDisplayName()})
-                .OrderByDescending(x=>x.Length)
-                .Select(x=> Span.EqualToIgnoreCase(x).Try())
-                .Aggregate((a, b) => a.Or(b));
+                        Extensions.GetEnumValues<T>()
+                .Except(excludedValues)
+                .SelectMany(x => new []{x.ToString(), x.GetDisplayName()})
+                .OrderBy(x=>x.Length)
+                .Select(x=> Span.EqualToIgnoreCase(x).Try())
+                .Aggregate((a, b) => a.Or(b));
     }
 }
