[Killed] Negate expression
Core/Serialization/StepSerializer.cs:33:21
             foreach (var serializerBlock in Components.Select(x => x.SerializerBlock).WhereNotNull())
             {
                 var r = serializerBlock.TryGetText(data);
-                if (r.IsFailure)
+                if (!(r.IsFailure))
                     return r;
                 sb.Append(r.Value);

[Killed] Negate expression
Core/Serialization/StepSerializer.cs:38:17
                 sb.Append(r.Value);
             }
 
-            if (sb.Length == 0)
+            if (!(sb.Length == 0))
                 return Result.Failure<string>("Serialized string was empty");
 

[Killed] Equality mutation
Core/Serialization/StepSerializer.cs:38:17
                 sb.Append(r.Value);
             }
 
-            if (sb.Length == 0)
+            if (sb.Length != 0)
                 return Result.Failure<string>("Serialized string was empty");
 
