[Killed] String mutation
Core/Serialization/VariableNameComponent.cs:29:68
         /// <summary>
         /// Serialize a variable name.
         /// </summary>
-        public static Result<string> Serialize(VariableName vn) => $"<{vn.Name}>";
+        public static Result<string> Serialize(VariableName vn) => $"";
 
 
