[Killed] Equality mutation
Core/Serialization/VersionTypeConverter.cs:22:43
         public static IYamlTypeConverter Instance { get; } = new VersionTypeConverter();
 
         /// <inheritdoc />
-        public bool Accepts(Type type) => type == typeof(Version);
+        public bool Accepts(Type type) => type != typeof(Version);
 
         /// <inheritdoc />

[Killed] Equality mutation
Core/Serialization/VersionTypeConverter.cs:27:17
         /// <inheritdoc />
         public object? ReadYaml(IParser parser, Type type)
         {
-            if (type != typeof(Version) || !parser.TryConsume<Scalar>(out var scalar)) return null;
+            if (type == typeof(Version)  || !parser.TryConsume<Scalar>(out var scalar)) return null;
 
             var version = new Version(scalar.Value);

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Core/Serialization/VersionTypeConverter.cs:27:44
         /// <inheritdoc />
         public object? ReadYaml(IParser parser, Type type)
         {
-            if (type != typeof(Version) || !parser.TryConsume<Scalar>(out var scalar)) return null;
+            if (type != typeof(Version) || parser.TryConsume<Scalar>(out var scalar)) return null;
 
             var version = new Version(scalar.Value);
