[Killed] Boolean mutation
Core/Serialization/YamlMethods.cs:24:45
         /// </summary>
         public static string SerializeToYaml(this IFreezableStep step)
         {
-            var obj = SimplifyProcess(step, true);
+            var obj = SimplifyProcess(step, false);
 
             var builder = new SerializerBuilder().WithTypeConverter(VersionTypeConverter.Instance);

[Killed] Array initializer mutation
Core/Serialization/YamlMethods.cs:45:60
         {
             var parser = new StepMemberParser(stepFactoryStore);
 
-            var nodeDeserializer = new GeneralDeserializer(new ITypedYamlDeserializer []
-            {
-                new StepMemberDeserializer(parser),
-                new FreezableStepDeserializer(parser)
-            });
+            var nodeDeserializer = new GeneralDeserializer(new ITypedYamlDeserializer []
+{});
 
             var builder =

[Survived] String mutation
Core/Serialization/YamlMethods.cs:73:43
 
             return Result.Success(stepMember)
                 .Bind(x=>x.TryConvert(MemberType.Step)
-                    .Bind(y=>y.AsArgument("Step")));
+                    .Bind(y=>y.AsArgument("")));
 
         }

[Killed] Boolean mutation
Core/Serialization/YamlMethods.cs:85:72
             switch (step)
             {
                 case ConstantFreezableStep cfp:
-                    return SerializationMethods.SerializeConstant(cfp, false);
+                    return SerializationMethods.SerializeConstant(cfp, true);
                 case CompoundFreezableStep compoundFreezableProcess:
                 {

[Killed] Equality mutation
Core/Serialization/YamlMethods.cs:88:39
                     return SerializationMethods.SerializeConstant(cfp, false);
                 case CompoundFreezableStep compoundFreezableProcess:
                 {
-                    if (isTopLevel && compoundFreezableProcess.StepFactory == SequenceStepFactory.Instance &&
+                    if (isTopLevel && compoundFreezableProcess.StepFactory != SequenceStepFactory.Instance  &&
                         compoundFreezableProcess.FreezableStepData.Dictionary.TryGetValue(nameof(Sequence.Steps), out var stepMember))
                         return ToSimpleObject(stepMember);

[Survived] Logical mutation
Core/Serialization/YamlMethods.cs:88:25
                     return SerializationMethods.SerializeConstant(cfp, false);
                 case CompoundFreezableStep compoundFreezableProcess:
                 {
-                    if (isTopLevel && compoundFreezableProcess.StepFactory == SequenceStepFactory.Instance &&
+                    if (isTopLevel || compoundFreezableProcess.StepFactory == SequenceStepFactory.Instance  &&
                         compoundFreezableProcess.FreezableStepData.Dictionary.TryGetValue(nameof(Sequence.Steps), out var stepMember))
                         return ToSimpleObject(stepMember);

[Killed] Negate expression
Core/Serialization/YamlMethods.cs:92:25
                         compoundFreezableProcess.FreezableStepData.Dictionary.TryGetValue(nameof(Sequence.Steps), out var stepMember))
                         return ToSimpleObject(stepMember);
 
-                    if (compoundFreezableProcess.StepConfiguration == null)//Don't use custom serialization if you have configuration
+                    if (!(compoundFreezableProcess.StepConfiguration == null))//Don't use custom serialization if you have configuration
                     {
                             var sr = compoundFreezableProcess.StepFactory.Serializer

[Killed] Equality mutation
Core/Serialization/YamlMethods.cs:92:25
                         compoundFreezableProcess.FreezableStepData.Dictionary.TryGetValue(nameof(Sequence.Steps), out var stepMember))
                         return ToSimpleObject(stepMember);
 
-                    if (compoundFreezableProcess.StepConfiguration == null)//Don't use custom serialization if you have configuration
+                    if (compoundFreezableProcess.StepConfiguration != null)//Don't use custom serialization if you have configuration
                     {
                             var sr = compoundFreezableProcess.StepFactory.Serializer

[Killed] Negate expression
Core/Serialization/YamlMethods.cs:96:33
                     {
                             var sr = compoundFreezableProcess.StepFactory.Serializer
                                     .TrySerialize(compoundFreezableProcess.FreezableStepData);
-                            if (sr.IsSuccess) //Serialization will not always succeed.
+                            if (!(sr.IsSuccess)) //Serialization will not always succeed.
                                 return sr.Value;
 

[Killed] Equality mutation
Core/Serialization/YamlMethods.cs:104:25
                     IDictionary<string, object> expandoObject = new ExpandoObject();
                     expandoObject[TypeString] = compoundFreezableProcess.StepFactory.TypeName;
 
-                    if (compoundFreezableProcess.StepConfiguration != null)
+                    if (compoundFreezableProcess.StepConfiguration == null)
                         expandoObject[ConfigString] = compoundFreezableProcess.StepConfiguration;
 

[Killed] Negate expression
Core/Serialization/YamlMethods.cs:104:25
                     IDictionary<string, object> expandoObject = new ExpandoObject();
                     expandoObject[TypeString] = compoundFreezableProcess.StepFactory.TypeName;
 
-                    if (compoundFreezableProcess.StepConfiguration != null)
+                    if (!(compoundFreezableProcess.StepConfiguration != null))
                         expandoObject[ConfigString] = compoundFreezableProcess.StepConfiguration;
 

[Survived] Boolean mutation
Core/Serialization/YamlMethods.cs:121:40
 
         private static object ToSimpleObject(StepMember member) =>
             member.Join(x=> VariableNameComponent.Serialize(x).Value,
-                x=> SimplifyProcess(x, false),
+                x=> SimplifyProcess(x, true),
                 l=>l.Select(x=>SimplifyProcess(x, false)).ToList());
     }

[Survived] Boolean mutation
Core/Serialization/YamlMethods.cs:122:51
         private static object ToSimpleObject(StepMember member) =>
             member.Join(x=> VariableNameComponent.Serialize(x).Value,
                 x=> SimplifyProcess(x, false),
-                l=>l.Select(x=>SimplifyProcess(x, false)).ToList());
+                l=>l.Select(x=>SimplifyProcess(x, true)).ToList());
     }
 }
