[NoCoverage] Equality mutation
Core/Serialization/YamlRunner.cs:72:17
             }
 #pragma warning restore CA1031 // Do not catch general exception types
 
-            if (errorMessage != null)
+            if (errorMessage == null)
                 return Result.Failure<string>(errorMessage);
             else if (!string.IsNullOrWhiteSpace(text))

[NoCoverage] Negate expression
Core/Serialization/YamlRunner.cs:72:17
             }
 #pragma warning restore CA1031 // Do not catch general exception types
 
-            if (errorMessage != null)
+            if (!(errorMessage != null))
                 return Result.Failure<string>(errorMessage);
             else if (!string.IsNullOrWhiteSpace(text))

[NoCoverage] Negate expression
Core/Serialization/YamlRunner.cs:74:22
 
             if (errorMessage != null)
                 return Result.Failure<string>(errorMessage);
-            else if (!string.IsNullOrWhiteSpace(text))
+            else if (!(!string.IsNullOrWhiteSpace(text)))
                 return RunSequenceFromYamlString(text);
             else

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
Core/Serialization/YamlRunner.cs:74:22
 
             if (errorMessage != null)
                 return Result.Failure<string>(errorMessage);
-            else if (!string.IsNullOrWhiteSpace(text))
+            else if (string.IsNullOrWhiteSpace(text))
                 return RunSequenceFromYamlString(text);
             else
