[NoCoverage] Negate expression
Core/Util/Extensions.cs:25:17
         {
             var type = value.GetType();
             var name = Enum.GetName(type, value);
-            if (name == null) return value.ToString();
+            if (!(name == null)) return value.ToString();
             var field = type.GetField(name);
             if (field == null) return value.ToString();

[NoCoverage] Equality mutation
Core/Util/Extensions.cs:25:17
         {
             var type = value.GetType();
             var name = Enum.GetName(type, value);
-            if (name == null) return value.ToString();
+            if (name != null) return value.ToString();
             var field = type.GetField(name);
             if (field == null) return value.ToString();

[NoCoverage] Negate expression
Core/Util/Extensions.cs:27:17
             var name = Enum.GetName(type, value);
             if (name == null) return value.ToString();
             var field = type.GetField(name);
-            if (field == null) return value.ToString();
+            if (!(field == null)) return value.ToString();
             var attr =
                 Attribute.GetCustomAttribute(field, typeof(DescriptionAttribute));

[NoCoverage] Equality mutation
Core/Util/Extensions.cs:27:17
             var name = Enum.GetName(type, value);
             if (name == null) return value.ToString();
             var field = type.GetField(name);
-            if (field == null) return value.ToString();
+            if (field != null) return value.ToString();
             var attr =
                 Attribute.GetCustomAttribute(field, typeof(DescriptionAttribute));

[NoCoverage] Equality mutation
Core/Util/Extensions.cs:42:17
         /// </summary>
         public static string GetFullMessage(this Exception exception)
         {
-            if (exception.InnerException == null)
+            if (exception.InnerException != null)
                 return exception.Message;
 

[NoCoverage] Negate expression
Core/Util/Extensions.cs:42:17
         /// </summary>
         public static string GetFullMessage(this Exception exception)
         {
-            if (exception.InnerException == null)
+            if (!(exception.InnerException == null))
                 return exception.Message;
 

[Survived] Linq method mutation (First() to FirstOrDefault())
Core/Util/Extensions.cs:58:20
         /// </summary>
         public static string GetDisplayName(this Enum enumValue)
         {
-            return enumValue.GetType()
-                            .GetMember(enumValue.ToString())?
-                            .First(x=>x.MemberType == MemberTypes.Field)?
-                            .GetCustomAttribute<DisplayAttribute>()?
-                            .GetName()?? enumValue.ToString();
+            return enumValue.GetType()
+                            .GetMember(enumValue.ToString())?
+                            .FirstOrDefault(x=>x.MemberType == MemberTypes.Field)?
+                            .GetCustomAttribute<DisplayAttribute>()?
+                            .GetName()?? enumValue.ToString();
         }
 

[Killed] Equality mutation
Core/Util/Extensions.cs:60:39
         {
             return enumValue.GetType()
                             .GetMember(enumValue.ToString())?
-                            .First(x=>x.MemberType == MemberTypes.Field)?
+                            .First(x=>x.MemberType != MemberTypes.Field)?
                             .GetCustomAttribute<DisplayAttribute>()?
                             .GetName()?? enumValue.ToString();

[Survived] Boolean mutation
Core/Util/Extensions.cs:70:45
         /// </summary>
         public static Maybe<T> TryParseValue<T>(string s) where T : Enum
         {
-            if (Enum.TryParse(typeof(T), s, true, out var r) && r is T t)
+            if (Enum.TryParse(typeof(T), s, false, out var r) && r is T t)
                 return CSharpFunctionalExtensions.Maybe<T>.From(t);
 

[Killed] Negate expression
Core/Util/Extensions.cs:75:20
 
             foreach (var value in Enum.GetValues(typeof(T)).Cast<T>())
             {
-                if(value.ToString().Equals(s, StringComparison.OrdinalIgnoreCase))
+                if(!(value.ToString().Equals(s, StringComparison.OrdinalIgnoreCase)))
                     return CSharpFunctionalExtensions.Maybe<T>.From(value);
 

[Killed] Negate expression
Core/Util/Extensions.cs:80:20
 
                 var displayName = value.GetDisplayName();
 
-                if(displayName.Equals(s, StringComparison.OrdinalIgnoreCase))
+                if(!(displayName.Equals(s, StringComparison.OrdinalIgnoreCase)))
                     return CSharpFunctionalExtensions.Maybe<T>.From(value);
             }

[NoCoverage] Negate expression
Core/Util/Extensions.cs:103:74
         /// <summary>
         /// Returns this nullable value as a maybe.
         /// </summary>
-        public static Maybe<T> Maybe<T>(this T? str) where T : struct => str.HasValue ? CSharpFunctionalExtensions.Maybe<T>.From(str.Value) : CSharpFunctionalExtensions.Maybe<T>.None;
+        public static Maybe<T> Maybe<T>(this T? str) where T : struct => !(str.HasValue ) ? CSharpFunctionalExtensions.Maybe<T>.From(str.Value) : CSharpFunctionalExtensions.Maybe<T>.None;
 
         /// <summary>

[Killed] Equality mutation
Core/Util/Extensions.cs:119:128
         /// <summary>
         /// Returns the elements of the sequence which are not null.
         /// </summary>
-        public static IEnumerable<T> WhereNotNull<T>(this IEnumerable<T?> source) where T : class => (from val in source where val != null select val)!;
+        public static IEnumerable<T> WhereNotNull<T>(this IEnumerable<T?> source) where T : class => (from val in source where val == null  select val)!;
 
 

[NoCoverage] Negate expression
Core/Util/Extensions.cs:127:17
         /// </summary>
         public static Result<object> TryGetEnumValue(Type enumType, string value)
         {
-            if (Enum.TryParse(enumType, value, true, out var r))
+            if (!(Enum.TryParse(enumType, value, true, out var r)))
                 return r!;
 

[NoCoverage] Boolean mutation
Core/Util/Extensions.cs:127:48
         /// </summary>
         public static Result<object> TryGetEnumValue(Type enumType, string value)
         {
-            if (Enum.TryParse(enumType, value, true, out var r))
+            if (Enum.TryParse(enumType, value, false, out var r))
                 return r!;
 
