[Killed] Negate expression
Core/Util/FunctionalExtensions.cs:78:17
         /// </summary>
         public static Result<T> MapFailure<T, TE>(this Result<T, TE> result, Func<TE, string> convertError)
         {
-            if (result.IsSuccess) return result.Value!;
+            if (!(result.IsSuccess)) return result.Value!;
 
             var errorString = convertError(result.Error);

[Killed] Negate expression
Core/Util/FunctionalExtensions.cs:116:17
         /// </summary>
         public static Result<T2> BindCast<T1, T2>(this Result<T1> result) where T2 : T1
         {
-            if (result.IsFailure) return result.ConvertFailure<T2>();
+            if (!(result.IsFailure)) return result.ConvertFailure<T2>();
 
             if (result.Value is T2 t2) return t2;

[NoCoverage] Negate expression
Core/Util/FunctionalExtensions.cs:144:17
         /// </summary>
         public static Maybe<T2> BindCast<T1, T2>(this Maybe<T1> result)  where T2 : T1
         {
-            if (result.HasNoValue) return Maybe<T2>.None;
+            if (!(result.HasNoValue)) return Maybe<T2>.None;
 
             if (result.Value is T2 t2) return t2;

[Killed] Negate expression
Core/Util/FunctionalExtensions.cs:157:17
         /// </summary>
         public static Result<T> BindSingle<T>(this Result<IReadOnlyList<T>> result)
         {
-            if (result.IsFailure) return result.ConvertFailure<T>();
+            if (!(result.IsFailure)) return result.ConvertFailure<T>();
 
             if (result.Value.Count == 0) return Result.Failure<T>("Sequence has no elements");

[Killed] Negate expression
Core/Util/FunctionalExtensions.cs:159:17
         {
             if (result.IsFailure) return result.ConvertFailure<T>();
 
-            if (result.Value.Count == 0) return Result.Failure<T>("Sequence has no elements");
+            if (!(result.Value.Count == 0)) return Result.Failure<T>("Sequence has no elements");
             else if(result.Value.Count > 1) return Result.Failure<T>("Sequence has more than one element");
 

[Killed] Equality mutation
Core/Util/FunctionalExtensions.cs:159:17
         {
             if (result.IsFailure) return result.ConvertFailure<T>();
 
-            if (result.Value.Count == 0) return Result.Failure<T>("Sequence has no elements");
+            if (result.Value.Count != 0) return Result.Failure<T>("Sequence has no elements");
             else if(result.Value.Count > 1) return Result.Failure<T>("Sequence has more than one element");
 

[Killed] Negate expression
Core/Util/FunctionalExtensions.cs:160:21
             if (result.IsFailure) return result.ConvertFailure<T>();
 
             if (result.Value.Count == 0) return Result.Failure<T>("Sequence has no elements");
-            else if(result.Value.Count > 1) return Result.Failure<T>("Sequence has more than one element");
+            else if(!(result.Value.Count > 1)) return Result.Failure<T>("Sequence has more than one element");
 
             return result.Value.Single()!;

[Killed] Equality mutation
Core/Util/FunctionalExtensions.cs:160:21
             if (result.IsFailure) return result.ConvertFailure<T>();
 
             if (result.Value.Count == 0) return Result.Failure<T>("Sequence has no elements");
-            else if(result.Value.Count > 1) return Result.Failure<T>("Sequence has more than one element");
+            else if(result.Value.Count >= 1) return Result.Failure<T>("Sequence has more than one element");
 
             return result.Value.Single()!;

[Survived] Linq method mutation (Single() to SingleOrDefault())
Core/Util/FunctionalExtensions.cs:162:20
             if (result.Value.Count == 0) return Result.Failure<T>("Sequence has no elements");
             else if(result.Value.Count > 1) return Result.Failure<T>("Sequence has more than one element");
 
-            return result.Value.Single()!;
+            return result.Value.SingleOrDefault()!;
         }
 

[Killed] Negate expression
Core/Util/FunctionalExtensions.cs:171:17
         /// </summary>
         public static Result<(T1, T2)> Compose<T1, T2>(this Result<T1> result1, Func<Result<T2>> func2)
         {
-            if (result1.IsFailure) return result1.ConvertFailure<(T1, T2)>();
+            if (!(result1.IsFailure)) return result1.ConvertFailure<(T1, T2)>();
 
             var result2 = func2();

[Killed] Negate expression
Core/Util/FunctionalExtensions.cs:175:17
 
             var result2 = func2();
 
-            if (result2.IsFailure) return result2.ConvertFailure<(T1, T2)>();
+            if (!(result2.IsFailure)) return result2.ConvertFailure<(T1, T2)>();
 
             return (result1.Value, result2.Value);

[NoCoverage] Negate expression
Core/Util/FunctionalExtensions.cs:188:17
         /// </summary>
         public static Result<(T1, T2, T3)> Compose<T1, T2, T3>(this Result<T1> result1, Func<Result<T2>> func2, Func<Result<T3>> func3)
         {
-            if (result1.IsFailure) return result1.ConvertFailure<(T1, T2, T3)>();
+            if (!(result1.IsFailure)) return result1.ConvertFailure<(T1, T2, T3)>();
 
             var result2 = func2();

[NoCoverage] Negate expression
Core/Util/FunctionalExtensions.cs:192:17
 
             var result2 = func2();
 
-            if (result2.IsFailure) return result2.ConvertFailure<(T1, T2, T3)>();
+            if (!(result2.IsFailure)) return result2.ConvertFailure<(T1, T2, T3)>();
 
             var result3 = func3();

[NoCoverage] Negate expression
Core/Util/FunctionalExtensions.cs:196:17
 
             var result3 = func3();
 
-            if (result3.IsFailure) return result3.ConvertFailure<(T1, T2, T3)>();
+            if (!(result3.IsFailure)) return result3.ConvertFailure<(T1, T2, T3)>();
 
             return (result1.Value, result2.Value, result3.Value);
