[NoCoverage] Negate expression
Core/Util/Option.cs:45:17
         /// </summary>
         public TResult Join<TResult>(Func<T1, TResult> f1, Func<T2, TResult> f2)
         {
-            if (Choice1.HasValue)
+            if (!(Choice1.HasValue))
                 return f1(Choice1.Value);
             if (Choice2.HasValue)

[NoCoverage] Negate expression
Core/Util/Option.cs:47:17
         {
             if (Choice1.HasValue)
                 return f1(Choice1.Value);
-            if (Choice2.HasValue)
+            if (!(Choice2.HasValue))
                 return f2(Choice2.Value);
 

[NoCoverage] Negate expression
Core/Util/Option.cs:62:17
         /// </summary>
         public bool Equals(Option<T1, T2> other, Func<T1, T1, bool> equals1, Func<T2, T2, bool> equals2)
         {
-            if (Choice1.HasValue && other.Choice1.HasValue)
+            if (!(Choice1.HasValue && other.Choice1.HasValue))
                 return equals1(Choice1.Value, other.Choice1.Value);
 

[NoCoverage] Logical mutation
Core/Util/Option.cs:62:17
         /// </summary>
         public bool Equals(Option<T1, T2> other, Func<T1, T1, bool> equals1, Func<T2, T2, bool> equals2)
         {
-            if (Choice1.HasValue && other.Choice1.HasValue)
+            if (Choice1.HasValue || other.Choice1.HasValue)
                 return equals1(Choice1.Value, other.Choice1.Value);
 

[NoCoverage] Negate expression
Core/Util/Option.cs:65:17
             if (Choice1.HasValue && other.Choice1.HasValue)
                 return equals1(Choice1.Value, other.Choice1.Value);
 
-            if (Choice2.HasValue && other.Choice2.HasValue)
+            if (!(Choice2.HasValue && other.Choice2.HasValue))
                 return equals2(Choice2.Value, other.Choice2.Value);
 

[NoCoverage] Logical mutation
Core/Util/Option.cs:65:17
             if (Choice1.HasValue && other.Choice1.HasValue)
                 return equals1(Choice1.Value, other.Choice1.Value);
 
-            if (Choice2.HasValue && other.Choice2.HasValue)
+            if (Choice2.HasValue || other.Choice2.HasValue)
                 return equals2(Choice2.Value, other.Choice2.Value);
 

[Killed] Negate expression
Core/Util/Option.cs:133:17
                 return f1(Choice1.Value);
             if (Choice2.HasValue)
                 return f2(Choice2.Value);
-            if (Choice3.HasValue)
+            if (!(Choice3.HasValue))
                 return f3(Choice3.Value);
 

[Killed] Negate expression
Core/Util/Option.cs:154:17
             if (Choice2.HasValue && other.Choice2.HasValue)
                 return equals2(Choice2.Value, other.Choice2.Value);
 
-            if (Choice3.HasValue && other.Choice3.HasValue)
+            if (!(Choice3.HasValue && other.Choice3.HasValue))
                 return equals3(Choice3.Value, other.Choice3.Value);
 

[Survived] Logical mutation
Core/Util/Option.cs:154:17
             if (Choice2.HasValue && other.Choice2.HasValue)
                 return equals2(Choice2.Value, other.Choice2.Value);
 
-            if (Choice3.HasValue && other.Choice3.HasValue)
+            if (Choice3.HasValue || other.Choice3.HasValue)
                 return equals3(Choice3.Value, other.Choice3.Value);
 
